[
  {
    "name": "Thời kỳ dựng nước ",
    "startYear": -2000,
    "endYear": -258,
    "desc": " Kinh Dương Vương là Thủy tổ của dân tộc Việt Nam có con Lạc Long Quân lấy Âu Cơ sinh ra một bọc một trăm trứng nở ra một trăm người con trai là tổ tiên của người Bách Việt. Con trưởng làm Hùng Vương nối ngôi. Nước  Văn Lang  kéo dài gần 2000 năm, trải qua 18 đời vua Hùng, đóng đô ở Phong Châu.    ",
    "kings": [],
    "figures": []
  },
  {
    "name": "Nhà Thục ",
    "startYear": -257,
    "endYear": -208,
    "desc": " Thục Phán hợp nhất Âu Việt với Văn Lang lập nên nhà Thục, lấy quốc hiệu là  Âu Lạc , đóng đô ở Cổ Loa, xưng là An Dương Vương.    ",
    "kings": [],
    "figures": []
  },
  {
    "name": "Thời kỳ phong kiến phương Bắc đô hộ lần thứ nhất ",
    "startYear": -207,
    "endYear": 39,
    "desc": " Nhà Triệu (207 - 111 trCN) chiếm Âu Lạc rồi đổi tên nước thành Nam Việt. Nhà Hán (111 trCN - 39) chiếm Nam Việt rồi đổi thành Giao Chỉ bộ.    ",
    "kings": [],
    "figures": []
  },
  {
    "name": "Trưng Nữ Vương ",
    "startYear": 40,
    "endYear": 43,
    "desc": " Trưng Trắc đánh đuổi quân Hán, lên ngôi vua đóng đô tại Mê Linh.    ",
    "kings": [],
    "figures": []
  },
  {
    "name": "Thời kỳ phong kiến phương Bắc đô hộ lần thứ hai ",
    "startYear": 43,
    "endYear": 542,
    "desc": " Trải qua các triều sau: Đông Hán, Đông Ngô, Tây Tấn, Lương. Nổi bật nhất là cuộc khởi nghĩa của Bà Triệu (248) và Lý Bôn (542)    ",
    "kings": [],
    "figures": []
  },
  {
    "name": "Nhà tiền Lý và nhà Triệu ",
    "startYear": 544,
    "endYear": 602,
    "desc": " Lý Bôn đánh đuổi quân Lương lấy quốc hiệu  Vạn Xuân , đóng đô ở Long Biên  ",
    "kings": [],
    "figures": []
  },
  {
    "name": "Thời kỳ phong kiến phương Bắc đô hộ lần thứ ba ",
    "startYear": 603,
    "endYear": 939,
    "desc": " Lý Phật Tử đầu hàng, nước ta rơi vào tay nhà Tùy (603) rồi sau đó là nhà Đường (618). Các cuộc khởi nghĩa tiêu biểu: Mai Thúc Loan (722), Phùng Hưng (766-791), Dương Thanh (819-820).    ",
    "kings": [],
    "figures": []
  },
  {
    "name": "Thời kỳ xây nền tự chủ ",
    "startYear": 905,
    "endYear": 938,
    "desc": " Khúc Thừa Dụ đuổi giặc về nước, tự xưng là Tiết độ sứ. Nhà Đường công nhận ông là người đứng đầu đất Việt.  ",
    "kings": [],
    "figures": []
  },
  {
    "name": "Nhà Ngô ",
    "startYear": 939,
    "endYear": 965,
    "desc": " Ngô Quyền là con rể Dương Đình Nghệ, giết Kiều Công Tiễn trả thù cho bố vợ, đánh thắng quân Nam Hán, lập ra triều Ngô, đóng đô ở Cổ Loa. Dương Tam Kha cướp ngôi nhà Ngô, các nơi không chịu thuần phục, mỗi thủ lĩnh cát cứ một vùng gọi là \"Loạn 12 sứ quân\".  ",
    "kings": [],
    "figures": []
  },
  {
    "name": "Nhà Đinh ",
    "startYear": 968,
    "endYear": 980,
    "desc": " Đinh Bộ Lĩnh dẹp xong loạn 12 sứ quân, lên ngôi Hoàng đế lấy niên hiệu là Tiên Hoàng đế, đặt quốc hiệu là  Đại Cồ Việt , đóng đô ở Hoa Lư. Năm 979, Đinh Tiên Hoàng và và con là Đinh Liễn bị giết chết trong khi uống rượu ngủ say. Đinh Toàn mới 6 tuổi lên ngôi (979-980).    ",
    "kings": [],
    "figures": []
  },
  {
    "name": "Nhà Tiền Lê ",
    "startYear": 980,
    "endYear": 1009,
    "desc": " Nhà Tống xâm lược nước ta, Lê Hoàn được Thái hậu Dương Vân Nga trao ngôi vua, lấy niên hiệu là Lê Đại Hành, đánh tan quân Tống và chấn hưng đất nước.  ",
    "kings": [],
    "figures": []
  },
  {
    "name": "Nhà Lý ",
    "startYear": 1010,
    "endYear": 1225,
    "desc": " Lê Ngọa Triều mất, triều thần tôn Lý Công Uẩn lên ngôi Hoàng đế. Tháng 7-1010, Lý Công Uẩn dời đô về Thăng Long, năm 1054 lấy quốc hiệu là  Đại Việt  ",
    "kings": [],
    "figures": []
  },
  {
    "name": "Nhà Trần ",
    "startYear": 1225,
    "endYear": 1400,
    "desc": " Năm 1208, Thái tử Sảm (sau thành vua Lý Huệ Tông) chạy loạn về Hải Ấp (Thái Bình) vào ở nhà ông Trần Lý làm nghề đánh cá rồi cưới con gái Trần Lý là Trần Thị Dung. Anh em nhà Trần mộ quân giúp Thái tử Sảm khôi phục kinh đô Thăng Long. Từ đó nhà Trần mà đứng đầu là Trần Thủ Độ dần thao túng quyền lực. Trần Thủ Độ ép Lý Chiêu Hoàng (8 tuổi) lấy và nhường ngôi cho Trần Cảnh, chấm dứt sự tồn tại của nhà Lý trên đà suy vong. Chiến công vẻ vang nhất của nhà Trần là 3 lần đánh thắng quân Nguyên.  ",
    "kings": [],
    "figures": []
  },
  {
    "name": "Nhà Hồ ",
    "startYear": 1400,
    "endYear": 1407,
    "desc": " Nhà Trần suy yếu. Hồ Quý Ly thâu tóm quyền lực, bức vua Thuận Tông phải dời kinh về Tây Đô (1397), ép Trần Thiếu Đế phải nhường ngôi (1400) rồi bức tử, lấy quốc hiệu là  Đại Ngu .Hồ Quý Ly thực hiện nhiều cải cách táo bạo đi trước thời đại. Nhưng do mắc tội giết vua cùng tôn tộc và quan lại nhà Trần nên ông đã không tập hợp được lực lượng toàn dân để chống giặc Minh.  ",
    "kings": [],
    "figures": []
  },
  {
    "name": "Hậu Trần ",
    "startYear": 1407,
    "endYear": 1413,
    "desc": " Trần Ngỗi là con thứ của Trần Nghệ Tông, cuối thời Hồ đã khởi binh khôi phục nhà Trần. Đến đời vua Trùng Quang Đế do quân ít nên không chống nổi giặc Minh.  ",
    "kings": [],
    "figures": []
  },
  {
    "name": "Thời kỳ thuộc Minh ",
    "startYear": 1414,
    "endYear": 1427,
    "desc": " Quân Minh chiếm nước ta, cai trị nhân dân ta vô cùng hà khắc. Ngày 7/2/1418, Lê Lợi phất cờ khởi nghĩa ở Lam Sơn kéo dài suốt 10 năm và giành thắng lợi.    ",
    "kings": [],
    "figures": []
  },
  {
    "name": "Triều Lê Sơ ",
    "startYear": 1428,
    "endYear": 1527,
    "desc": " Ngày 15/4 Mậu Thân - 1428, Lê Lợi chính thức lên ngôi Vua, đặt tên nước là  Đại Việt , đóng đô ở Đông Đô (Hà Nội).   ",
    "kings": [],
    "figures": []
  },
  {
    "name": "Bắc Triều - Nam Triều ",
    "startYear": 1527,
    "endYear": 1592,
    "desc": " Trải qua 3 đời vua Lê, Mạc Đăng Dung được phong Thái sư Nhân quốc công rồi đến An hưng vương. Lợi dụng lúc vua Lê Cung Hoàng ươn hèn, Mạc Đăng Dung đem quân về kinh đô ép vua nhường ngôi, lập nên triều Mạc ở miền Bắc gọi là  Bắc Triều .    \n Nguyễn Kim giúp vua Lê Trang Tông chiếm được Nghệ An lập nên  Nam Triều . Nguyễn Kim bị đánh thuốc độc chết (1545). Con rể là Trịnh Kiểm nắm giữ binh quyền, ngấm ngầm ám hại các em vợ. Nguyễn Hoàng là con Nguyễn Kim xin vào trấn thủ Thuận Hóa nên thoát chết và đã gây dựng giang sơn riêng của nhà Nguyễn ở Đàng Trong.     Nam Triều  giao tranh với  Bắc Triều  của nhà Mạc gần 50 năm (1543-1592). Trịnh Tùng đánh bại được nhà Mạc (1592) rồi đón vua Lê Thế Tông vào Thăng Long (1595), mở đầu thời kỳ  \"Vua Lê, Chúa Trịnh\" . Mọi việc trong triều do chúa quyết, vua chỉ nghe theo.      Bắc Triều  ",
    "kings": [],
    "figures": []
  },
  {
    "name": "Thời Trịnh - Nguyễn phân tranh ",
    "startYear": 1533,
    "endYear": 1788,
    "desc": " Cuộc chiến Trịnh (Đàng Ngoài) - Nguyễn (Đàng Trong) phân tranh mở đầu khi Trịnh Tráng đem quân đánh Nguyễn Phúc Nguyên (1627). Đến năm 1672 hai bên tạm ngừng chiến, lấy sông Gianh làm giới tuyến.   Nhà Lê Trung Hưng (1533-1788)  ",
    "kings": [],
    "figures": []
  },
  {
    "name": "Nhà Tây Sơn ",
    "startYear": 1778,
    "endYear": 1802,
    "desc": " Năm 1771 anh em Tây Sơn phất cờ khởi nghĩa đến năm 1778 thì diệt được chúa Nguyễn ở Đàng Trong, chỉ có Nguyễn Ánh chạy thoát. Nguyễn Nhạc lên ngôi Hoàng đế lập nên Triều đại nhà Tây Sơn, đặt niên hiệu là Thái Đức.  ",
    "kings": [],
    "figures": []
  },
  {
    "name": "Nhà Nguyễn thời kỳ độc lập ",
    "startYear": 1802,
    "endYear": 1883,
    "desc": " Năm 1802, Nguyễn Ánh diệt xong nhà Tây Sơn đang suy yếu, lên ngôi hoàng đế, niên hiệu là Gia Long đóng đô tại thành Phú Xuân, đặt quốc hiệu là  Việt Nam . Năm 1820 vua Minh Mạng đổi quốc hiệu thành  Đại Nam  ",
    "kings": [],
    "figures": []
  },
  {
    "name": "Thời kì Pháp đô hộ ",
    "startYear": 1883,
    "endYear": 1945,
    "desc": " Triều đình Huế đời vua Tự Đức ký hòa ước Quý Mùi (1883), rồi hòa ước Pa-tơ-nốt (1885), đất nước ta bị chia làm 3 kỳ (Bắc kỳ, Trung kỳ, Nam kỳ) chịu sự bảo hộ của đế quốc Pháp.  ",
    "kings": [],
    "figures": []
  },
  {
    "name": "Nước Việt Nam mới ",
    "startYear": 1945,
    "endYear": 2023,
    "desc": " Dưới sự lãnh đạo của lãnh tụ Nguyễn Ái Quốc, dân tộc ta đã khởi nghĩa làm cuộc Cách mạng tháng Tám (19-8-1945) thành công, đánh đổ đế quốc Pháp và phát xít Nhật. Ngày 2/9/1945, Chủ tịch Hồ Chí Minh đọc \"Tuyên ngôn độc lập\" tại Quảng trường Ba Đình lập nên nước  Việt Nam Dân Chủ Cộng Hòa  với thủ đô là Hà Nội.   ",
    "kings": [],
    "figures": []
  }
]