[
  {
    "name": "An Tiêm",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Dựng nước",
    "home": "Không rõ",
    "desc": "Nhân vật truyền thuyết thời Hùng Vương dựng nước. Theo dã sử và truyền miệng, ông họ Mai, tên An Tiêm được vua Hùng Vương thứ XVII yêu mến và gả con gái cho, vợ chồng sống trong an vui. Ông thường tâm sự với vợ: \"Giàu sang này đều là do tiền kiếp\". Câu nói trên lọt vào tai bọn nịnh thần, chúng tâu lên khiến vua Hùng Vương giận, đày ông và gia đình ra ngoài hải đảo sống với nghề trồng dưa, mà dưa rất ngon. Cuộc sống rất chật vật, nhưng không vì vậy mà ông than oán bất cứ ai kể cả nhà vua. Một thời gian sau, dưa của ông được đem về đất liền. Có người đem dâng lên nhà vua, nhà vua ăn thử dưa do An Tiêm trồng và tiến cống, thấy quả thật như lời truyền trong dân gian. Từ đó vua Hùng Vương ân xá cho vợ chồng, con cái An Tiêm; cho gia đình ông trở về đất liền và phục chức cũ. Cuộc đời ông và sự nghiệp trồng dưa của An Tiêm được nhà văn Nguyễn Trọng Thuật hư cấu nên tiểu thuyết Quốc ngữ đầu tiên ở miền Bắc có tên Quả dưa đỏ. Tác phẩm được giải văn học của hội Khai trí tiến đức năm 1925 ở Hà Nội."
  },
  {
    "name": "Âu Cơ",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Dựng nước",
    "home": "Không rõ",
    "desc": "Tị tổ nòi giống Lạc Việt, vợ Lạc Long Quân. Truyền thuyết kể rằng: Bà sinh một bọc trứng, nở được trăm người con. Các con khôn lớn, bà đem 50 người lên núi, 50 người thì theo cha định cư ở vùng đồng bằng... Người con cả về sau nối truyền trị nước, xưng hiệu Hùng Vương, lấy tên nước là Văn Lang. Thế cho nên trong văn chương truyền khẩu có câu nam nữ đối ca đầy tính sử thi: Gần nhà xa ngõ khó hỏi thăm Có chim chi đẻ trứng ấp ngàn năm rứa bạn tề? Nở ra nam nữ bộn bề Nửa theo quê mẹ, nửa về quê cha. Thiếp hỏi chàng, chàng phải nói ra, Em về làm vợ luận là cưới cheo."
  },
  {
    "name": "Bạch Hoa",
    "otherName": "Ngọc Hoa",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Dựng nước",
    "home": "Không rõ",
    "desc": "Công chúa con gái Hùng Vương thứ XVIII, có sách chép là Ngọc Hoa, nổi tiếng sắc nước hương trời. Nhân vật gây nên cuộc \"tranh hôn kết oán\" trong thời Văn Lang. Huyền sử lưu truyền: Gần bờ côi Văn Lang có người của bộ lạc do Thục Phán lãnh đạo, có lần đến cầu hôn con vua Hùng mà không thành. Gã cố oán, khi sắp mất dặn lại cháu Thục Phán phải đánh lấy nước Văn Lang, rửa hận. Đồng thời có Nguyễn Tùng là nhân vật lỗi lạc ở ẩn trên ngọn núi Tản Viên cũng đến cầu hôn. Lại có một thanh niên anh tuấn ngụ ở ven biển đến cầu hôn nữa. Hùng Vương chằng biết chọn ai, bèn giao hẹn: \"Ngày mai ai đưa lễ vật quí giá đến trước thì gả con cho\". Nguyễn Tùng y hẹn đến trước và dâng lễ vật trọng hậu, Bạch Hoa vâng mạng vua cha theo Nguyễn Tùng về núi. Chàng trai ở biển nổi nóng, đánh phá dữ dội. Câu chuyện tranh hôn kết oán trong đời Hùng Vương thứ 18 này, huyền sử gọi là chuyện Sơn tinh, Thủy tinh. Cuộc tình duyên của Bạch Hoa, chẳng những khiến hai chàng trai ở biển và ở núi sinh thù gây biến, mà họ Thục cũng oán. Do đó nước Văn Lang mất về tay Thục Phán vào năm Giáp thìn 257 trước Công nguyên."
  },
  {
    "name": "Cao Sơn Đại Vương",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Dựng nước",
    "home": "Không rõ",
    "desc": "Nhân vật thần thoại trong thời Hồng Bàng. Anh linh hiển hách, được dân chúng thờ phụng. Ông nguyên là một trong 50 người con đã theo Âu Cơ về núi. Suốt đời ông mưu ích lợi cho dân chúng miền núi, và do tinh thần vị tha của ông, dân trong nước đều cảm động, ngưỡng mộ noi theo gương sáng. Về sau, các triều đại nối tiếp truy phong ông là phúc thẫn, thụy hiệu Cao Sơn đại vương. Đời hậu Lê, các tướng Nguyễn Văn Long, Nguyễn Văn Hoằng và Nguyễn Văn Lữ kính trọng uy linh ông, đồng xin lập đền thờ ông để biểu dương. Đền thờ ông còn ở huyện Phụng Hoa, tỉnh Ninh Bình (nay thuộc tỉnh Ninh Bình). Trong Công dư tiệp ký và trong Kiến văn tiểu lục lại có một truyền thuyết khác. Đền thờ Cao Sơn đại vương ở Ương Giản, huyện Chí Linh, tỉnh Hải Dương (nay thuộc tỉnh Hải Dương). Tương truyền đây là thần nhân rất giỏi chữa bệnh, thường hiện thân làm thầy lang đề cứu đời, nhất là chữa chứng đậu mùa. Khi hỏi họ tên, địa chỉ thì vị thần ấy nói: \"Ta là Cao Sơn, nhà ở xứ Đầu Hồ, xã Lương Giản, thuộc huyện Chí Linh\". Bởi thế dân chúng tin tưởng là Cao Sơn đại vương đã hiển thánh. Đời Lê Tương Dục, khoảng năm Canh ngọ 1510, đại học sĩ Lê Trụy có phụng soạn bài bia dựng nơi đền Cao Sơn."
  },
  {
    "name": "Chử Đồng Tử",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Dựng nước",
    "home": "Hưng Yên",
    "desc": "Nhân vật thần thoại, một trong bốn vị bất tử thời Hồng Bàng là ông, vợ ông (Tiên Dung mị nương), Phù Đồng thiên vương và Tản Viên sơn thần. Quê làng Chử Xá, xã Đa Hòa, Mễ Sớ phủ Khoái Châu, tỉnh Hưng Yên. Ông là con của Chử Cù Vân, mẹ là Bùi Thị Gia. Nhà nghèo khó, sinh nhai về nghề chài lưới, rất hiếu thuận với gia đình. Mẹ mất sớm, ít lâu cha cũng qua đời, ông sống cô đơn. Nào hay duyên số lạ thường, ông gặp con gái Hùng Vương III là Tiên Dung mà nên nghĩa vợ chồng, rồi bỏ hết vinh hoa phú quí, vợ chồng ông đến bộ Hoài Hoan (Nghệ An) theo học đạo với cao sĩ Phật Quang, lên núi lập am Quỳnh; trì chí tu hành. Thỉnh thoảng vợ chồng ông xuống núi; phàm nơi nào dân chúng đói khổ, bệnh tật vợ chồng ông đều tìm đến nghĩ cách giúp đỡ. Sau, ông có thêm người vợ thứ là Tây Nương, gia đình vẫn thuận hòa. Tương truyền: \"Một đêm, ba vợ chồng phi thăng thành tiên\". Những dấu vết để lại trên đời trong một đêm đều xóa sạch, biến thành một cái đầm lởn gọi là Đầm Nhất Dạ. Bấy giờ là ngày 17 tháng giêng Quí mão (318 tr.CN). Dân chúng lập đền thờ ông ở nhiều nơi, xưng tụng ông là Chử tiên, hoặc Chử đạo tổ. Đền chính thờ ông ở xã Đa Hòa, tổng Mễ Sở, phủ Khoái Châu, tỉnh Hưng Yên. Hằng năm từ ngày 12 đến 16 tháng 3 là ngày hội. Khoảng năm Bính thân 1896, Tri phủ Khoái Châu là Nguyễn Chí Đạo hiệp với án sát Châu Mạnh Trinh trùng tu đền chánh Đa Hòa. Trong Hồng Đức quốc âm thi tập, có thơ đề vịnh: Hiền thảo dòng nhà thấu bích niên, Dành hay phúc thiện máy từ nhiên. Máy thu nhem thuốc rèn gan sắt, Một chút giàu sang kết bạn tiên. Triệu Việt nạm xong nên nghiệp cả! Ức Trai mộng tỏ chí lời nguyền. Anh linh miếu dõi lừng hương khói, Còn nước còn non tiếng hãy truyền."
  },
  {
    "name": "Cường Bạo Đại Vương",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Dựng nước",
    "home": "Nam Định",
    "desc": "Nhân vật thần thoại đời Hồng Bàng. Tương truyền ông là người làng Bối Cẩm, huyện Thiên Bản (sau đổi là làng Bối Lan, huyện Vụ Bản) tỉnh Nam Định. Vốn là thần tiên núi Nhạc giáng sinh, do bà mẹ nằm mộng thấy dị nhân mặt đen mách báo cho biết như thế. Ông có sức mạnh phi thường, nhưng tâm tính rất ngỗ nghịch. Đến nỗi thượng đế từng phải sai Lôi thần đập chết ông đi. Ông thác, hóa thành thần linh, cải tà qui chánh, cứu độ người đời, cho nên được dân chúng lập đền thờ. Triều đình có sắc phong làm phúc thần. Có bài thơ xưa đề vịnh về nhân vật thần thoại này. \"Nhị ngũ chung linh quýnh nhĩ thừ, Thần tiêu hắc hán ứng gia phù. Xích chi luyện được lôi hà úy? Bạch nhật thừa phù thủy bất ngu. Hương hỏa vĩnh tồn quang tự điền. Thái bàn mặc hựu tráng hoàng đô. Cổ văn kính viễn kim nghi vị, Quân tử hưu tương biện hữu vô.\" Bản dịch: Lạ thay. Nhị ngũ khí hồn nhiên, Điềm báo canh khuya tướng mặt đen. Mỡ nhớt, Thiên lôi không hoảng sợ! Nước dâng, bè chuối khỏi lo phiền. Trải bao tự điểm còn hương khói, Gúp mãi hoàng đô được vững bền, \"Kinh viễn\" đồi lời đôi lời nên ngẫm nghĩ. Có không đừng vội nói huyên thiên"
  },
  {
    "name": "Hồng Bàng",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Dựng nước",
    "home": "Không rõ",
    "desc": "Nhân vật dã sử, theo cổ sử Việt Nam, cách nay hơn 4 nghìn năm, theo truyền thuyết vua Đế Minh là cháu ba đời của Viêm Đế họ Thần Nông đi tuần du phương Nam, lấy con gái Vũ Tiên, sinh ra Kinh Dương Vương được vua cha cho làm vua phương Nam gọi là nước Xích Quỷ lập ra họ Hồng Bàng. Kinh Dương Vương sinh ra Sùng Lãm sau nối ngôi lấy hiệu là Lạc Long Quân. Lạc Long Quân lấy bà Âu Cơ sinh ra trăm con, bèn chia đôi, 50 con theo mẹ lên miền núi, 50 con theo cha xuống miền biển. Con trưởng nối ngôi gọi là Hùng Vương, đặt tên nước là Văn Lang. Các vua kế tiếp vẫn gọi là Hùng Vương. Sau nước Văn Lang bị vua Thục chiếm. Họ Hồng Bàng ở ngôi được 2.622 năm."
  },
  {
    "name": "Hùng Vương",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Dựng nước",
    "home": "Không rõ",
    "desc": "Thuỷ tổ dân tộc Việt Nam, họ Hồng Bàng dựng nước, 18 đời đều xưng hiệu Hùng Vương; (theo Hùng triều ngọc phả và Thiên Nam bảo lục diễn ca). 1. Kinh Dương Vương Lộc Tục, tôn dâng miếu hiệu là Hùng Dương 2. Lạc Long Quân Sùng Lãm thụy hiệu Hùng Hiền. 3. Hùng Lân 4. Hùng Việp 5. Hùng Hi (1) 6. Hùng Huy 7. Hùng Chiêu 8. Hùng Vĩ 9. Hùng Định 10. Hùng Hi (2) 11. Hùng Trinh 12. Hùng Võ 13. Hùng Việt 14. Hùng Anh 15. Hùng Triều 16. Hùng Tạo 17. Hùng Nghị 18. Hùng Duệ Hiệu nước khi ấy là Văn Lang, đóng đô ở Phong Châu (thuộc huyện Bạch Hạc, tỉnh Phú Thọ ngày nay). Toàn lãnh thổ chia làm 15 bộ: Văn Lang, Châu Diên, Phúc Lộc, Tân Hưng, Võ Định, Võ Ninh, Lục Khải, Ninh Hải, Dương Tuyền, Giao Chỉ, Cửu Chân, Hoài Nam, Cửu Đức, Việt Thường và Bình Văn. Về danh hiệu Hùng Vương, gần đây có nhiều học giả cho rằng chữ Lạc đã chép sai ra Hùng, nên phải gọi là Lạc Vương thay vì Hùng Vương. Đến nay di tích này còn trên đỉnh Hùng Sơn cách Hà Nội 97 cây số, cũng gọi là núi Đền, là Nghĩa Lĩnh hay Nghĩa Cương. Bia đề 4 chữ to \"Cao sơn cảnh Hùng\". Nơi đền thượng, phía ngoài nêu 4 chữ Nam thiên triệu tổ. Gian giữa, tấm hoành lớn ghi Hùng Vương miếu. Trên bàn thờ có ba bài vị, bài vị chính ghi Khai quốc hồng đồ, đột ngột cao sơn cố Việt Hùng thị, thập bát thế thánh vương. (Mười tám đời vua thánh dòng Hùng nước Việt xưa, non cao chất ngất nên sự nghiệp to mở nước). Hai cột chính giữa điện có đôi câu đối: \"Thiên địa trường tồn, ức vạn niên do truyền quốc tổ. Tinh thần bất hủ, thập bát thế giai hiệu Hùng Vương\". (Trời đất còn dài, ức muôn năm vẫn truyền là quốc tổ, Tinh thần không diệt, mười tám đời, đều mang hiệu Hùng Vương). Trong đền có rất nhiều câu đối chữ Nôm và chữ Hán. Về chữ Nôm có hai câu đối đáng chú ý: Vật đổi sao dời, phúc tổ vẫn lưu nền cổ tích; Nước nguồn cây cội, đạo người nên nhớ mộ Hùng Vương. Về chữ Hán, đôi câu đối sau đây bút pháp thần tình: \"Vấn lai dĩ sự tu vi sử Tế dục dư đồ dục mệnh thi\". (Hỏi lại chuyện xưa nên chép sử, Xem rành đồ bản muốn đề thơ). Có người cho đôi câu đối ấy là của chúa Trịnh đô vương Trịnh Sâm cách nay hơn 200 năm. Đến nay, toàn dân đã công nhận ngày 10 tháng 3 âm lịch là ngày giỗ Quốc tổ của nhân dân ta."
  },
  {
    "name": "Kinh Dương Vương",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Dựng nước",
    "home": "Không rõ",
    "desc": "Tổ thứ nhất của dân tộc Việt Nam, họ Hồng Bàng dựng nước. Tất cả truyền được 18 đời đều xưng họ Hùng Vương (theo Hùng triều ngọc phả và Thiên Nam bảo lục diễn ca). Ngài là đời thứ nhất gọi là Kinh Dương Vương Lộc Tục, tôn dâng miếu là Hùng Vương, thứ hai là Lạc Long Quân Sùng Lãm, thứ ba là Hùng Lân... Quốc hiệu ta lúc ấy là Văn Lang đóng đô ở Phong Châu (thuộc huyện Bạch Hạc, tỉnh Vĩnh Phú ngày nay. Ông làm vua nước Xích Quỉ vào khoảng năm Nhâm tuất (2879 tr.CN) lấy con gái Động Đinh quan là Long Nữ sinh ra Sùng Lãm, nối ngôi làm vua. Toàn lãnh thổ chia ra làm 15 bộ: Văn Lang, Châu Diên, Phúc Lộc, Tân Hưng, Võ Định, Võ Ninh, Lục Khái, Ninh Hải, Dương Tuyền, Giao Chỉ, Cửu Chân, Hoài Nam, Cửu Đức, Việt Thường và Binh Văn. Và truyền nhau đến đời thứ 18 là Hùng Duệ. Đến nay di tích hay còn trên đỉnh Hùng Sơn (Núi Hùng) cách Hà Nội 97km, cũng gọi là Núi Đền, Nghĩa Lĩnh, hay Nghĩa Cương. Bia đề 4 chữ lớn Cao Sơn cảnh Hùng."
  },
  {
    "name": "La Viện",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Dựng nước",
    "home": "Thanh Hóa",
    "desc": "Đạo sĩ lừng danh đời Hùng Vương, không rõ năm sinh, năm mất, quê xã Nhuệ Trại, huyện Thuần Kính (Hậu Lộc), tỉnh Thanh Hóa. Khi Hùng Vương nam chinh, thuyền qua cửa biển bị trở gió, phải ở lại đấy hơn một tháng. Khi nhà vua trai giới, khiến ông ngồi thuyền đi trước. Ông phụng mạng lên đường, bể lại lặng sóng, nhưng khi về, ông mất giữa đường. Vua hạ chiếu phong ông làm \"Áp Lăng chân nhân\" rồi lập đền thờ ở phía Nam cửa biển Thần Phù, lưu một toán quân đã theo ông đánh giặc ở lại đấy phụng thờ. Nay là các thôn Nhân Phẩm, Phù Sa và Anh Tốt, thuộc huyện Yên Mô, tỉnh Ninh Bình."
  },
  {
    "name": "Lý Ông Trọng",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Dựng nước",
    "home": "Không rõ",
    "desc": "Nhân vật trong thần thoại Việt Nam, người huyện Từ liêm, quận Giao Chỉ, nguyên tên là Lý Thân. Có lần ông lỡ tay làm chết người, bị tội tử hình, nhưng vua Hùng Vương tha tội cho, sau vua Thục An Dương Vương đem cống hiến cho Tần Thủy Hoàng. Ở Trung Quốc trở nên một tướng tài được phong làm Vạn Tín Hầu và cho trở về Việt Nam. Mấy năm sau, quân Hung Nô lại quấy phá ở biên thùy, Tần Thủy Hoàng phải nhờ đến Lý Thân, bèn sai sứ sang nước ta vời, nhưng ông không chịu đi làm tay sai cho nước người, ông bỏ trốn vào rừng ẩn. An Dương Vương phải nói dối là Lý Thân đã chết Tân Thủy Hoàng đòi lấy xác của ông. Bất đắc dĩ Lý Thân phải tự tử, An Dương Vương lấy thủy ngân ướp xác ông rồi đem nộp cho họ Tần, thấy Lý Thân đã chết, Tần Thủy Hoàng cho đúc tượng ông đem dựng ở cửa thành Tư Mã đất Hàm Dương gọi là tượng Lý Ông Trọng. Tượng rất cao lớn, thân hình khổng lồ, bụng rất to, trong bụng làm rỗng có thể chứa đựng nhiều người, hai tay và đầu, cổ có máy cử động, mỗi khi có người nước ngoài đến viếng thì đã có người ở trong bụng tượng kéo máy cho thân hình cử động. Sau đó, quân Hung Nô đến đánh Hàm Dương thấy tượng, tưởng Lý Thân còn sống, nên khiếp sợ rút quân về. Từ đó không xâm lược Trung nguyên nữa. Đến đời Đường, người Trung Quốc cai trị nước ta vì sợ oai ông, nên cho lập đền thờ Lý Ông Trọng ở làng Thị Hiện, huyện Từ Liêm ngày nay bên cạnh sông Hồng, phía tây thành Đại La (Hà Nội) trước đây"
  },
  {
    "name": "Phù Đổng Thiên Vương",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Dựng nước",
    "home": "Bắc Ninh",
    "desc": "Nhân vật dã sử chiến sĩ chống ngoại xâm. Vào đời Hùng Vương thứ 6 có bọn giặc Ân sang xâm chiếm nước ta. Quân lực của chúng rất mạnh, không ai đánh được. Nhà vua bèn sai sứ đi rao khắp nước, kêu gọi nhân tài ra đánh giặc cứu nước. Bấy giờ tại làng Phù Đổng, lộ Võ Ninh, (nay là huyện Quế Võ), tỉnh Hà Bắc, có một trẻ ba tuổi tình nguyện xin đi yêu cầu sứ giả về tâu vua đúc một con ngựa sắt và cây roi sắt đem đến. Đứa trẻ vươn vai thành người lớn, nhảy lên lưng ngựa sắt, cầm roi sắt xông ra trận đánh quân giặc thua chạy tan tành giải phóng đất nước. Ông phi ngựa đến núi Sóc Sơn thì biến mất. Vua cho lập đền thờ và phong là Phù Đổng Thiên Vương vì cho rằng ông là vua trời ở làng Phù Đổng có công dẹp giặc xâm lược nước nhà."
  },
  {
    "name": "Sùng Lãm",
    "otherName": "Lạc Long Quân",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Dựng nước",
    "home": "Không rõ",
    "desc": "Tức vị Quốc tổ Lạc Long Quân. Huyền sử tương truyền: Sùng Lãm thuộc thị tộc Hồng Bàng, dòng Lạc Việt, xưng hiệu Lạc Long Quân, kết duyên cùng Âu Cơ sinh được 100 người con trai. Sau, 50 người con trai theo Lạc Long Quân xuống sinh hoạt ở vùng biển, 50 người theo Âu Cơ lên non lập nghiệp. Người con trưởng được giao cho cai trị nước Văn Lang, xưng hiệu Hùng vương, đóng đô ở Phong Châu. Các vua Hùng nối nhau trị nước, sử còn ghi lại 18 đời uy linh hiển hách. Trong ca dao Việt Nam có bài ca về sự tích Trăm trứng trăm con giàu tính sử học: Gần đàng xa ngõ thiếp nghiêng tai, chàng tỏ thiếp tường, Long Quân Nam Việt gặp nàng Âu Cơ. Dạo chơi sơn thuỷ dật dờ, Đạp nhằm dấu thỏ một giờ thọ thai. Nở ra nửa gái nửa trai sẵn sàng Nửa thì qui phụng rồng loan Nửa thì quê mẹ cho nhàn tấm thân Thiếp hỏi chàng, chàng nói từng câu Nơi tưởng niệm Lạc Long Quân ngày nay vẫn còn di tích, ấy là Đình Nội, làng Bình Đà, huyện Thanh Oai, tỉnh Hà Đông (nay thuộc Hà Tây). Đình đã có từ lâu, tấm bia duy nhất nơi đình còn sót lại làm trong năm Kỉ mùi 1919 sau khi sửa sang vào năm Mậu ngọ 1918. Bức hoành nêu to 4 chữ \"Vi Bách Việt tổ\" (Tổ dân Bách Việt). Tượng Lạc Long Quân đội mũ bình thiên, mặc hoàng bào, tay cầm hốt, chân đi hia, cân đai rạng rỡ. Hai bên phải trái chân dung, có đến 60 hình người chạm nổi, gồm 18 thị nữ dâng hoàn sớ, 20 quan văn, 16 tướng võ, 6 vị cưỡi ngựa, 12 người chèo thuyền rồng, và các hình thú hổ, voi, đầu rồng và các hoa văn, sóng nước. Ngày 6-3 âm lịch là ngày hội hàng năm kỉ niệm Lạc Long Quân, trước ngày Hội đền Hùng 4 ngày. Lễ vật dâng cúng thường là 100 oản, 100 quả chuối, 100 bánh dẻo, 100 ghe chèo để mời 100 người con của Lạc Long Quân và Âu Cơ về hưởng. Trong ngày hội, người ta đốt pháo Bình Đà, nó chằng những thể hiện tài nghệ của nhân dân lao động mà còn có ý nghĩa tượng trưng cho sự tích Lạc Long Quân, Âu Cơ và cũng mô phỏng lại tiếng trống lệnh của Lạc Long Quân. Làng Bình Đà với địa thế nằm giữa vùng đồng bằng, với trống đồng Đông Sơn, cũng có thể là nơi quần tụ cư dân Văn Lang xa xưa khai phá vùng châu thổ. Cho nên Đình Nội làng Bình Đà thật là di tích cần trân trọng bảo tồn."
  },
  {
    "name": "Cao Thông",
    "otherName": "Cao Lỗ",
    "bornYear": "Không rõ",
    "deathYear": "180",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Thục",
    "home": "Không rõ",
    "desc": "Có sách chép là Cao Lỗ, danh tướng thời Thục An Dương vương không rõ năm sinh. Ông có sáng chế nỏ thần, và là vai chủ yếu trong sự sắp đặt kĩ thuật quân sự giúp cho nhà Thục hưng lên. Năm Đinh hợi 214 tr. Công nguyên, Tần Thủy Hoàng phái quân đánh Âu Lạc. Tướng Tần là Đồ Thư cầm quân 5 đạo, trước thắng nhưng sau bị quân dân Âu Lạc trường kì kháng chiến giết chết. Cao thông chỉ huy quân kháng chiến sử dụng cung nỏ thần tình do ông sáng chế. Khi Triệu Đà đánh Thục, Cao Thông dàn quân ngăn chống. Triệu Đà thua to, dùng kế phản gián, khiến vua tôi nhà Thục nghi ngờ nhau, đồng thời cho con trai là Trọng Thủy đến cầu hôn con gái vua Thục là Mị Châu rồi xin ở rể để do thám tình hình. Thục An Dương vương mắc kế, đuổi Cao Thông đi. Từ ấy nhà Thục suy sụp rồi đất nước lọt vào tay Triệu Đà. Dân chúng có lập đền thờ Cao Thông ở địa phương."
  },
  {
    "name": "Thục Phán",
    "otherName": "An Dương Vương",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Thục",
    "home": "Không rõ",
    "desc": "Người mở nghiệp nhà Thục trong năm Giáp thìn 275 trước Công nguyên, tự xưng là An Dương Vương, đổi quốc hiệu là Âu Lạc, đóng đô ở Phong Khê. Năm Bính ngọ 255 trước công nguyên, ông truyền cho dân chúng xây Loa Thành (Thành Ốc) nay hãy còn dấu tích ở làng Cổ Loa, huyện Đông Anh, tỉnh Phúc Yên (nay thuộc TP. Hà Nội). Bấy giờ vua có một vị tướng tài là Cao Lộ giúp sức, lại được thần Kim Qui phù trợ cho chiếc móng chân để chế ra thứ nỏ thần, mỗi lần bắn ra 10 mũi tên, khiến Triệu Đà ở phương bắc đến đánh mấy lần đều bị thua. Năm Tân mão 210 trước công nguyên ông kết thông gia với Triệu Đà, gả con gái là Mỵ Châu cho Trọng Thủy, bề ngoài là kết tình thông gia hòa hiếu, bề trong là tìm hiểu vì sao lực lượng quân sự của Âu Lạc lại mạnh như thế. Sau khi đã hiểu rõ lí do, Trọng Thủy lừa gạt Mị Châu, ăn cắp chiếc nỏ thần đem về nước, rồi cùng vua cha là Triệu Đà đem quân đánh Âu Lạc. Năm Quí tị 208 tr.CN Triệu Đà cướp nước Âu Lạc. Trên đường chạy trốn giặc, sau lưng ngựa có Mỵ Châu, ông biết được kẻ phản bội là cha con Triệu Đà - Trọng Thủy ông uất hận vung gươm chém Mỵ Châu rồi tự vẫn nơi cửa biến Đại Nha (đất Nghệ An xưa). Ngày nay đền thờ ông hãy còn ở núi Mộ Dạ, xã Hương Ái, huyện Đông Thành, tỉnh Nghệ An (nay vẫn thuộc tỉnh Nghệ An). Chí sĩ Dương Bá Trạc có thơ đề vịnh cố sự này. Thành Loa trăm thước chẳng là bền! Móng rùa ba thước chẳng là thiêng. Nước nhà đấy, mất tại người cả, Thành trì không hiểm, thần không quyền. Gió mưa gầy dựng công khó nhọc, Nam gồm Văn Lang, bắc Ba Thục. Dư đồ muôn dặm mơ màng tới, Một tấm sơn hà, một tấm vóc. Sẵn sàng cơ nghiệp không biết giữ! Chiến đã không xong hòa cũng ngộ Biên phòng chểnh mảng, thù lấn quân. Quanh quẩn một lầm, hai tại lỡ! Thân già đâu nới kẻ thù gieo. Chồng nào thương vợ, con lìa cha, Giặc ngồi sau lưng nói chi nữa! Nước ôi! Nhà ôi! Biển Đại Nha."
  },
  {
    "name": "Bốc Long",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Bắc thuộc lần 1",
    "home": "Không rõ",
    "desc": "Du học sinh đầu tiên trong thời Bắc thuộc lần thứ nhất không rõ năm sinh, năm mất. Ông sang Trung Quốc du học và tụ tiến thân, được vua Hán nạp dụng, hầu cận trong cung. Một lần, nhân ngày Tết nguyên đán, giữa lúc trăm quan triều hội chúc tụng nhà vua, chính ông và Lý Cầm đã đứng ra đòi hỏi quyền lợi cho người Việt. Lời yêu sách của ông được vua Hán chú ý, và sau đó một vài người Việt có tài năng cũng được vua Hán đối xử trọng hậu, quyền lợi ngang với quan lại nhà Hán. Đồng thời với ông, còn có Trương Trọng cũng là một du học sinh lỗi lạc của nước ta, khiến vua Hán phải kính nể."
  },
  {
    "name": "Châu Đạt",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Bắc thuộc lần 1",
    "home": "Thanh Hóa",
    "desc": "Liệt sĩ trong thời Bắc thuộc, quê huyện Cư Phong, quận Cửu Chân (Thanh Hóa). Canh tí 160, ông khởi nghĩa chống quân Hán. Đầu tiên ông chỉ huy dân quân tiêu diệt viên huyện lịnh tàn ác ở huyện Cư Phong, rồi tiến đánh khắp nơi trong quận Cửu Chân, giết chết thái thú là Nghê Thức. Đô úy giặc là Nguy Lãng chống không nổi bỏ chạy, ông tiến chiếm luôn vùng quần Nhật Nam. Hán hoàng đế sai Hạ Phương sang làm thứ sử. Hạ Phương dẫn quân sang, đàn áp hung bạo và mua chuộc đám tay sai. Thế yếu, lực lượng kháng chiến của Châu Đạt dần dần bị tiêu hao, tan rã. Dù thế, trong bản ghi tên những hào kiệt chống xâm lăng, Châu Đạt vẫn đáng được muôn đời tưởng niệm."
  },
  {
    "name": "Lữ Gia",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Bắc thuộc lần 1",
    "home": "Không rõ",
    "desc": "Đại thần, không rõ năm sinh, năm mất. Tể tướng đời vua Triệu Ai vương năm 113 trước công nguyên. Bấy giờ sứ nhà Hán là An Quốc Thiếu Quý vốn là tình nhân cũ của hoàng thái hậu Cù Thị, âm mưu với nhau định đem nước Nam Việt nhập vào lãnh thổ Trung Quốc. Ông hết lời can ngăn không được, bèn truyền hịch khắp nơi tố cáo việc làm hại dân hại nước ấy, rồi đem quân vào cung giết luôn Thiếu Quý, Cù hậu và Ai vương, tôn con trường của Triệu Minh vương là Kiến Đức lên làm vua. Năm sau, nhà Hán sai Phục Ba tướng quân Lộ Bác Đức và Dương Bộc sang đánh. Ông Lữ Gia cầm quân chống cự, lúc đầu giết được tướng Hán là Hàn Thiên Thu. Nhưng sau vì thất thế, ông bị bắt và bị giết. Nước ta bị người Hán cai trị từ đó."
  },
  {
    "name": "An Bình Lý",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Trưng Nữ Vương",
    "home": "Vĩnh Phúc",
    "desc": "﻿Liệt sỹ đời Trưng Vương, không rõ năm sinh, năm mất và quê quán. Em trai út của ba vị anh thư Đạm Nương, Hồng Nương và Thanh Nương, con quan huyện lệnh họ Lê, trấn nhậm Tam Dương. Ông cùng ba người chị ngày đêm luyện tập sĩ tốt, kết giao hào kiệt lựa chọn người tài để cầm quân khởi nghĩa. Khi Hai Bà Trưng phát động cuộc đánh đuổi quân cướp nước, chị em ông hơn quân hưởng ứng với các đạo binh của Thánh Thiên, Lê Chân, Bát Nạn, tiến công như vũ bão. Đuổi xong Tô Định, khôi phục non sông, người chị cả của ông là Đạm Nương được Trưng Vương phong làm Tả đạo tướng quân; còn ông lãnh trọng trách đóng binh trấn giữ Tam Dương, Quất Lưu. Đến năm Quí mão 43, ngày 11 tháng 11, Hồng Nương và Thanh Nương tử tiết, trong khi chống trả cuộc tấn công do Mã Viện chỉ huy. Sáng ngày 1 tháng 12, An Bình Lý hi sinh và đêm ấy Đạm Nương cũng tự sát. An Bình Lý, Tam Nương, Tuấn Công đều được thờ ở đình Quất Lưu, thuộc huyện Bình Xuyên, tỉnh Vĩnh Phú ngày nay. Ngày 12 tháng 11 là ngày giỗ. Hội đình Quất Lưu trước tổ chức vào ngày 10 tháng giêng, lệ có đánh vật và thi 14 thứ bánh nếp. aaaa"
  },
  {
    "name": "Bát Nạn",
    "otherName": "Bát Nàn - Bát Não",
    "bornYear": "17",
    "deathYear": "43",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Trưng Nữ Vương",
    "home": "Vĩnh Phúc",
    "desc": "Công chúa, cũng gọi là Bát Nàn, có sách chép là Bát Não. Theo truyền thuyết và theo thần tích làng Tiên La, huyện Duyên Hà, tỉnh Thái Bình, cùng thần tích thờ miếu ở xa Phượng Lâu, huyện Phù Ninh - nay thuộc Vĩnh Phú (thần tích do danh thần thái hậu Lê là Hàn Lâm đại học sĩ Nguyễn Bính phụng soạn): Bát Nạn công chúa là vị anh thư thời Trưng Vương. Bà vốn là con của Võ Công Chất và Hoàng Thị Mầu. Thân phụ bà là hào trưởng ở Phượng Lâu. Khi bà chào đời, cha mẹ đặt tên là Thục, về sau bà nổi tiếng tài sắc, tục gọi Thục nương. Bà có chồng là Phạm Danh Hương (có sách chép là vi Lạc hầu Trương Quân) quê ở Đức Bác (tức Liệp Trang, huyện Lập Thạch). Vợ chồng bà đều có lòng yêu nước, ngầm lo việc cứu nước, giúp dân. Bấy giờ có tên hào mục là Trần căm tức vì không cưới được Thục nương, bèn ton hót với Thái Thú Tô Định rằng vợ chồng Thục nương có ý \"làm phản\", nên bắt giết đi. Năm Kì hợi 39, khi Đặng Thi Sách bị giết ở Châu Diên, thì chồng bà cũng bị giết ở Duyên Hà. Quân Tô Định vây dinh trại, chồng bà bị hại, nửa đêm bà cầm song đao, mở đường máu chạy đến làng Tiên La, vào chùa ẩn thân. Từ ấy, nặng nợ nước thù nhà, bà quyết chí báo phục, đêm ngày chiêu tập hào kiệt dựng cờ khởi nghĩa. Năm Canh tí 40, tháng 3, Hai Bà Trưng lãnh đạo nhân dân toàn quận phát động cuộc khởi nghĩa. Bà theo giúp, cùng với nữ tướng Lê Chân thống lãnh quân tiên phong. Cứu quốc thành công nước nhà độc lập Trưng Tương phong bà làm Bát Nạn đại tướng quân Trinh thục công chúa. Bà từ chối tước lộc, chỉ xin đem đầu giặc tế chồng một tuần. Tế xong, bà cởi bỏ nhung trang, trở lại chùa làng Tiên La. Nhưng chẳng bao lâu nghe an Mã Viện kéo binh sang, bà dấn thân cứu nước lần nữa. Chị em Trưng vương tuẫn quốc trong ngày 6 tháng 2, bà cũng tử tiết trong ngày 16 tháng 3 năm Quí mão 43. Các triều đại sau đều có truy phong bà làm thần: - Đời Lê Thánh tông, sắc phong: Ý đức đoan trang Trinhh thục công chúa. - Đời Minh Mạng nhà Nguyễn sắc phong: Dục bảo trung hưng linh phù chi thần. - Đời Khải Định sắc phong: Dực bảo trung hưng linh phù thượng đẳng thần. Vì khi cầm binh đuổi giặc, từ cửa sông Đáy về ngã ba sông Nông, bà thường cai quản những 18 cửa ngàn, nên tục gọi bà là bà Thượng ngàn. Và ngôi chùa mà bà ở tu, sách chép là chùa Nam Liên ở trên núi, nên tục cũng gọi bà là sư nữ Nam Liên. Nơi chùa Nam Liên có đôi liễn thờ bà: \"Vị quốc Nguyên khu, quắc thước thoa quần bình Bắc khấu; Xuất gia đầu Phật, anh hoa khí tiết bạn Nam Liên\" Bản dịch: Vì nước quên mình, quắc thước thoa quần bình giặc Bắc; Tìm về cõi tịch, anh hoa khí tiết rạng chùa Nam."
  },
  {
    "name": "Bảo Giác",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "1173",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Lý",
    "home": "Không rõ",
    "desc": "Thiền sư đời Lý Anh tông, không rõ họ tên, pháp danh Bảo Giác (sư Bảo Giác này với sư Bảo Giác - thân phụ sư Viên Thông Nguyễn Nguyên ức - là hai người khác nhau). Ông là bạn tâm giao và cũng là người đã dẫn dắt Thiền sư Tĩnh Giới (Châu Hải Ngang) trong việc tu học và hoằng dương đạo pháp đương thời. Năm Chính Long Bảo ứng 11 (Quí tị 1173), ông viên tịch. Trước lúc mất, ông có đọc bài kệ cho Tĩnh Giới nghe: \"Vạn pháp qui không vô sở y, Qui tích chân như mục tiền kì. Đạt ngộ tâm viên vô sở chỉ, Thủy thủy tâm nguyệt dãn tâm nghi. \" Bản dịch: Muôn pháp về không, không tựa nương Chân như trước mắt, một con đường. Cái tâm liễu ngộ khôn nơi chỉ Như bóng trăng rằm đáy đại dương"
  },
  {
    "name": "Bùi Quốc Khái",
    "otherName": "Không rõ",
    "bornYear": "1141",
    "deathYear": "1234",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Lý",
    "home": "Hà Nội",
    "desc": "Danh thần đời Lý Cao tông, quê làng Bình ông, huyện Cẩm Giang, (có sách chép quê làng Trinh Sài, bên cạnh Hồ Tây, Hà Nội. Ông có tài, nhưng chán công danh, không ra thi cử. Mãi đến năm Trinh Phù 10 (Ất tị 1185), tuổi đã 44 ông mới ra ứng thí, đứng hàng thứ nhì trong 20 người trúng tuyển. Làm quan trải 3 triều công cán (Lý Cao tông, Lý Huệ tông và Lý Chiêu hoàng), một lòng trung nghĩa, dày công giúp nước an dân. Gặp lúc triều chính đổ nát, gian thần lộng quyền, ông treo ấn từ quan. Rồi xuất gia đầu Phật nơi Thiền viện. Giáp ngọ 1234, ngày 18 tháng giêng âm lịch, ông mất, thọ 93 tuổi. Dân chúng tưởng niệm, tô tượng thờ ông ở chùa Thiên Niên (gần Hồ Tây) và đặt bài vị thờ ở đình làng Trinh Sài (thuộc Hà Nội)."
  },
  {
    "name": "Châu Hải Ngung",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "1207",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Lý",
    "home": "Không rõ",
    "desc": "Thiền sư đời Lý Anh tông, pháp danh Tĩnh Giới, đời thứ 10 phái Vô Ngôn Thông, quê làng Giang Mão. Ông nhà nghèo, tính hạnh thuần hòa trung hậu. Năm 26 tuổi ông xuất gia, vào núi Lăng thọ giới với thiền sư Bảo Giác ở chùa Viên. Năm Trình Phù 4 (Kỉ hợi 1179). Lý Cao tông xây xong chùa Chân Giáo; triệu ông vào dinh dự hội khánh tán. Rồi về trụ trì ở chùa Quốc Thanh, núi Bí Linh, thuộc tỉnh Nghệ An. Vị châu mục ở đây là Phạm Từ rất kính trọng ông. Chính ông đã trùng tu ngôi chùa Thánh Hóa (có sách Quang Thánh ở quê ông), và quyên đúc một quả chuông. Năm Trị Bình Long Ứng 3 (Đinh mão 1207) ngày 7 tháng 7 ông viên tịch."
  },
  {
    "name": "Châu Văn Thuờng",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Lý",
    "home": "Thanh Hóa",
    "desc": "Văn thần đời Lý Nhân tông, không rõ năm sinh, năm mất, quê ở quận Cửu Chân, trấn Thanh Hóa. Làm chức Thự mẫn thư lang, quản công ngự phủ, đồng trung thư kiệm biên tu. Ông có soạn bài Kí bia chùa Báo Ân núi An Hoạch (An Hoạch sơn Báo Ân tự bi kí) ghi công nghiệp Lý Thường Kiệt."
  },
  {
    "name": "Diên Thành Hầu",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Lý",
    "home": "Không rõ",
    "desc": "Vị Hầu tước có danh trong thời Lý Nhân tông. Ông cậy tay pháp sư Đại Diện trừ khử gã phù thủy Từ Vinh thường lẻn vào cung khuấy rối. Do đó gây nên cuộc báo oán giữa thiền sư Từ Lộ tức Từ Đạo Hạnh (con Từ Vinh) và pháp sư Đại Diện. Ông nhiệt thành mưu việc phúc lợi cho dân chúng, sửa sang chính trị đời Lý."
  },
  {
    "name": "Diệu Nhàn",
    "otherName": "Không rõ",
    "bornYear": "1041",
    "deathYear": "1113",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Lý",
    "home": "Bắc Ninh",
    "desc": "Nữ thiền gia, tên thật là Lý Ngọc Kiều con gái trưởng của Phụng Loát vương (có sách chép là Phụng Càn vương) Lý Nhật Trung (con Lý Thái tông). Quê làng Phù Đổng, huyện Tiên Du, Bắc Ninh (nay thuộc tỉnh Bắc Ninh). Bà được Lý Thánh tông nuôi dạy ở trong cung từ bé, đến trưởng thành, vua gả bà cho người họ Lê làm Châu mục Châu Đăng (vùng Tam Nông, Hưng Hóa, nay thuộc tỉnh Vĩnh Phú). Không bao lâu chồng mất, bà xuống tóc đi tu, đem hết của cải bố thí. Sư Chân Không (Vương Hải Thiềm) thuyết giáo và đặt pháp danh cho bà là Ni sư Diệu Nhàn. Về sau, bà nối truyền đứng vào thế hệ thứ 17 dòng thiền Nam phương. Ngày 1-6 ÂL, Quí tị (15-7-1113) bà mất, thọ 72 tuổi. Ngày nay còn lưu truyền một bài kệ của bà. \"Sinh lão bệnh tử, Tự cổ thường nhiên, Dục cầu xuất lí, Giải phược thiêm triền. Mê chi cầu Phật, Hoặc chi cầu thiên, Thiên Phật bất cầu Uổng khẩu vô ngôn.\" Bản dịch: Sinh, lão, bệnh, tử, Lẽ thường tự nhiên, Muốn cảnh siêu thoát, Càng trói buộc thêm. Mê, phải cầu Phật, Hoặc, phải cầu Thiên. Chẳng cần Thiên, Phật, Mím miệng ngồi yên."
  },
  {
    "name": "Dĩnh Đạt",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Lý",
    "home": "Không rõ",
    "desc": "Cao tăng đời Lý Nhân tông. Không rõ tên họ, năm sinh và năm mất. Pháp danh Dĩnh Đạt. Ông học thức uyên thâm, được triều đình trọng vọng, nhưng cương quyết ẩn tu, từ chối không vào chầu vua theo lời triệu thỉnh của triều đình đương thời. Nhâm dần 1122, ông làm bài minh khắc vào chuông và soạn bài bia chùa Viên Quang. Hầu hết sĩ phu đương thời đều ngương mộ đạo hạnh ông."
  },
  {
    "name": "Dương Không Lộ",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "1119",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Lý",
    "home": "Nam Định",
    "desc": "Thiền sư đời Lý Anh tông. Không rõ tên thật, pháp danh Không Lộ quê ở Hải Thanh (có sách chép Giao Thủy); tỉnh Nam Định. Ông xuất thân làm nghề chài lưới, nhưng có học, giỏi văn chương, mộ đạo Phật, ông tu nơi chùa Hà Trạch. Về sau được truyền tâm ấn, ông nghiễm nhiên là đời tổ thứ 6 phái Thảo Đường. Năm Kỉ hợi 1119, ngày 3-6 ông mất. Lý Nhân tông có sai sửa rộng ngôi chùa của ông trụ trì và quyên cho 20 hộ để hương khói. Nhiều nơi trong huyện Giao Thủy có đền thờ ông."
  },
  {
    "name": "Dương Tự Minh",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Lý",
    "home": "Thái Nguyên",
    "desc": "Võ tướng đời Lý Anh tông. Quê ở Thái Nguyên, không rõ năm sinh, năm mất. Gặp khi tướng giặc nhà Tống là Đàm Hữu Lượng trốn sang biên giới nước ta, sách động dân quân kết đảng đi đánh cướp châu Quảng Nguyên, ông phụng mạng đem binh hợp với quân sĩ nhà Tống vây bắt được bọn ấy, giao trả cho nhà Tống. Quan Tri châu châu Ung là Triệu Nguyện nhận lãnh và hành quyết cả bọn Hữu Lượng gồm hơn 20 người. Từ ấy dân chúng được an cư lạc nghiệp. Sau thấy Đỗ Anh Võ tư thông với Lê Thái hậu, lộng quyền, ông bèn liên kết với nhóm Võ Đới ngằm mưu trừ khử Anh Võ. Thất bại, ông bi phe đảng Đỗ Anh Võ bắt giam rồi đày đi nơi xa. Khi ông mất, được dân Thái Nguyên lập đền thờ."
  },
  {
    "name": "Đa Bảo",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Lý",
    "home": "Bắc Ninh",
    "desc": "Thiền sư đời Lê Thái tổ, không rõ họ tên và năm sinh năm mất, thuộc phái Võ Ngôn Thông, đời thứ 5. Ông vốn là đệ tử Khuông Việt Đại sư Ngô Châu Lưu. Trụ trì ở chùa Kiến Sơ, làng Phù Đổng, tỉnh Bắc Ninh. Vua Lý thường vời ông vào triều hỏi đạo và các việc quan trọng, xem ông như một vị cố vấn. Nhà vua cũng có ban sắc trùng tu chùa Kiến Sơ đề tỏ lòng tôn kính, đãi ngộ ông. Khi ông mất, truyền tâm pháp cho Định Hương."
  },
  {
    "name": "Đàm Cứu Chỉ",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "1067",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Lý",
    "home": "Bắc Ninh",
    "desc": "Thiền sư đời Lý Thái tông, không rõ tên thật, năm sinh. Pháp danh là Cửu Chỉ, đời thứ bảy phái Võ Ngôn Thông, nguời huyện Phủ Đàm, phủ Chu Minh, tỉnh Bắc Ninh. Thuở nhỏ ông hiếu học, đọc nhiều sách thường than rằng: \"Khổng Tử, Mặc Tử, câu chấp về lẽ có; Lão Tử, Trang Tử đắm đuối về lẽ không. Những cách vụn vặt của thế tục đều không phải phương pháp giải thoát. Chỉ có Phật giáo không kể Có, Không có thể kết liễu được cuộc sống thác, nhưng phải tự tu rất nghiêm nghặt mới được\". Ông tham đạo với Định HươngTrường lão ở chùa Cam Ứng, núi Ba Sơn, rồi tiếp tục tu học ở chùa Quang Minh, núi Tiên Du. Lý Thái tông ba lần cho vời, ông vẫn không đến, khiến vua phải thân tới chùa thăm hỏi. Sau, ông vui lòng về trụ trì ở chùa Diên Linh, núi Long Đội do Tể tướng Dương Đạo Gia xây dựng và mời ông. Ông mất năm Đinh mùi 1067."
  },
  {
    "name": "Đàm Dĩ Mông",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Lý",
    "home": "Không rõ",
    "desc": "Danh thần đời Lý Cao tông, không rõ năm sinh, năm mất. Làm quan đến Thái úy, tước Vương. Chính ông đã đưa ý kiến nên chọn lọc lại tăng đồ để Phật giáo giữ vững được giá trị không bị hỗn tạp, vua Lý Cao tông xuống chiếu chuẩn y. Nhờ thế, các tu sĩ vẫn được trọng vọng. Sau ông bị Phí Lang ở Đại Hoàng dâng thư hạch tội tham nhũng. Ông bị đánh đòn làm nhục, nên tụ tập quần chúng dấy loạn triều đình không dẹp nổi. Ít lâu, nhân có Quách Bốc đem quân đánh phá hoàng thành (Mậu thìn 1208) thẳng vào cung Vạn Duyên, lập Hoàng tử Thẩm lên làm vua, Đàm Dĩ Mông lại xu phụ theo phe đảng ấy. Đến khi anh em họ Trần chiêu binh đánh dẹp được loạn Quách Bốc (Kỉ tị 1209), đưa Lý Cao tông về kinh tiếp tục làm vua, thì sĩ phu không còn cảm tình gì với ông, ông hổ thẹn mà chết."
  },
  {
    "name": "Đàm Khí",
    "otherName": "Không rõ",
    "bornYear": "1020",
    "deathYear": "1088",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Lý",
    "home": "Hà Tây",
    "desc": "Thiền sư đời Lý Nhân tông, Pháp danh Ngộ Ấn, đời thứ 14 phái Võ Ngôn Thông. Quê thôn An Li, làng Kim Bài, huyện Thanh Oai, tỉnh Hà Đông (nay là Hà Tây). Tương truyền: thân mẫu ông chửa hoang sinh ra ông, đem bỏ vào rừng. Nhờ có nhà sư họ Đàm (người Chiêm Thành) đem về nuôi. Năm 10 tuổi ông đã giỏi chữ Phạn; 15 tuổi thêm thông chữ Hán. Năm Đinh sửu 1037, ông 17 tuổi vào tu ở chùa Long An, sau được sư Quảng Trí truyền tâm ấn, ông đến ngọn Ninh Sơn tu trì. Ông chủ trương thuyết Tam Bảo: \"...Lấy thân làm Phật, lấy miệng làm pháp, lấy tâm làm thiền\". Năm Mậu thìn 1088, ngày 14-6 ông mất, thọ 68 tuổi."
  },
  {
    "name": "Đặng Nghiêm",
    "otherName": "Không rõ",
    "bornYear": "1170",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Lý",
    "home": "Nam Định",
    "desc": "Danh sĩ đời Lý Cao tông, quê làng An Đề huyện Thư Trì, tỉnh Nam Định. Ông thông minh, hiếu học, nổi tiếng thần đồng. Lớn lên, ông đọc rộng các sách chuyên nghiên cứu kinh điển tam giáo (Nho, Lão, Fhật). Năm Ất tị 1185, ông đỗ khoa thi chọn hiền sĩ, mới 15 tuổi được vào hầu giảng sách cho vua nghe. Ông làm quan đến Thị lang bộ Công, tăm tiếng ông vang lừng vượt hẳn các sĩ phu đương thời. Ông là người khoa hoạn hiển đạt đầu tiên trong tỉnh Nam Định."
  },
  {
    "name": "Đạo Dung",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "1174",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Lý",
    "home": "Thanh Hóa",
    "desc": "Thiền sư đời Lí. Không rõ năm sinh, thiền sư trụ trì chùa Hương Nghiêm thuộc tỉnh Thanh Hóa. Đương thời gọi sư là Pháp Dung (vì kiêng húy Trần Hưng Đạo). Đạo Dung là pháp hiệu, không rõ tên, hiệu là Tăng Phán, tên là Huyền Nghi. Năm Đinh mão 1087 sư Đạo Dung được vua Lý Nhân tông triệu tới kinh, lập đạo trong hoàng cung. Năm Nhâm dần (1122) sư trở về thăm quê cũ, dựng chùa để ở đến lúc tuổi già. Sư Đạo Dung là một cao tăng đời Lý và có những liên hệ tình cảm thắm thiết với Lưu Khánh Đàm và Lý Thường Kiệt, Bia chùa Hương Nghiêm có ghi rõ hành trạng công nghiệp của sư và danh tướng kiệt xuất Lý Thường Kiệt. Ông mất ngày 5-2 năm Giáp ngọ 1174. Sau khi sư mất, học trò là cao tăng Tăng Đạo Lâm làm lễ hỏa táng, xây tháp ở núi Lân Ni thuộc tỉnh Thanh Hóa"
  },
  {
    "name": "Đào Thuần Chân",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "1101",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Lý",
    "home": "Không rõ",
    "desc": "Thiền sư đời Lý Thánh tông, họ Đào, không rõ tên thật, pháp danh Thuần Chân. Thuộc đời thứ 12 phái Thiền tông Tì-ni-đa-lưu-chi, quê làng Cửu ông, huyện Tế Giang. Ông thọ giáo với thiền sư Pháp Bảo ở chùa Quang Tịnh, rồi trụ trì chùa Hoa Quang, làng Tây Kết, huyện Thượng Nghi. Năm Tân tị 1101, ngày 7-2 ông mất còn lưu lại một bài kệ: \"Chân tánh thường vô tánh, Hà tằng hữu sinh diệt Thân thị sinh diệt pháp, Pháp tánh vị tằng diệt. \" Bản dịch: Chân tính thường không tính, Đâu từng có sinh diệt. Thân là pháp sinh diệt, Pháp tính chưa từng diệt."
  },
  {
    "name": "Đào Tông Nguyên",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Lý",
    "home": "Không rõ",
    "desc": "Danh thần đời Lý Nhân tông, không rõ năm sinh, năm mất. Ông hết lòng sửa sang việc chính trị, văn hóa. Khoảng năm Đinh mão 1087, ông đi sứ nhà Tống, đưa voi sang cống và trình quốc thư đòi lại những châu huyện ở mạn Quảng Nguyên mà nhà Tống đã chiếm đoạt trước đó. Do tài ngoại giao khéo léo của ông, nhà Tống thuận trả Quảng Nguyên; đổi lại, ta trả cho họ những tù binh đã bắt được do công trận của Lý Thường Kiệt."
  },
  {
    "name": "Đinh Khả",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Lý",
    "home": "Ninh Bình",
    "desc": "Người đời Lý Cao tông, không rõ năm sinh năm mất, cầm đầu cuộc vận động quần chúng chống lại nhà Lý. Quê ở Đại Hoàng, Ninh Bình (nay thuộc tỉnh Ninh Bình). Thừa lúc nhà Lý suy vi, ông tự xưng là con cháu nhà Đinh, lãnh đạo nhân dân khởi nghĩa, lực lượng của ông khá hùng hậu, Lý Cao tông sai tướng đánh dẹp phải khó nhọc lắm mới đàn áp được các nhóm nghĩa quân. Về sau, dư đảng của ông vẫn khuấy rối triều Lý không ít. Kể từ khi nhà Đinh mất, đến bấy giờ ông là nguời đã khơi động lại lòng dân cơ hồ đã quên mất họ Đinh."
  },
  {
    "name": "Đỗ Anh Kiệt",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Lý",
    "home": "Không rõ",
    "desc": "Đại thần đời Lý Cao tông, không rõ năm sinh, năm mất. Tính ông khảng khái, chính trực, thường bênh vực người ngay thẳng lâm nạn, thẳng tay trừng trị những quan lại tham ô nhiễu hại dân lành, nên Lý Cao tông rất tin dùng ông. Gặp khi Đàm Dĩ Mông và Quách Bốc gây biến loạn, ông bảo thẳng vào mặt Dĩ Mông: \"Mày làm đại thần lại nhận ngụy chức của lũ nghịch nay lại còn ở đây mà đứng cùng hàng với chúng ta nữa hay sao?\" Khiến Đàm Dĩ Mông vừa thẹn, vừa sợ lui mất. Chính ông đã giúp cho nhà Lý đứng vững được phần nào trong lúc vận nước đã suy vi."
  },
  {
    "name": "Đỗ Anh Võ",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "1185",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Lý",
    "home": "Không rõ",
    "desc": "Đại thần đời Lý Anh tông, em bà Đỗ Thái hậu (mẹ Lý Thần tông) Đỗ Anh Võ làm đến quan Thái úy, quyền cao chức trọng, nhưng tính tham những, lại tư thông với Lê Hậu làm bại hoại triều chính. Năm Canh thân 1140 Đỗ đi đánh dẹp cuộc nổi loạn của Thân Lợi cả phá đối phương ở Quảng Dịch bắt sống hai thủ lãnh là Dương Mục và Châu Ái. Cậy nhiều công lao, Đỗ càng ngày càng hống hách. Ngày trước, khi Đỗ mới hầu Lý Thần tông và khéo nịnh hót, lại có vẻ đẹp trai nên được hoàng hậu là Lê thị chú ý. Khi Lý Thần tông mất, Anh tông còn nhỏ, y được dịp cùng Lê Thái hậu tư thông, thường mài miệt truy hoan nơi cung Quảng Từ. Việc xấu dần dần nhiều người biết, các quan triều gồm Võ Đới, Dương Tự Minh mưu cùng Nguyễn Dương bắt y, giao cho đình úy xét án làm nhơ cung đình. Nhờ có Lê Hậu khéo lo lót vận động, nên Đỗ được nhẹ tội, Nguyễn Dương tức giận mắng Võ Đới tham của đút lót, rồi nhảy xuống giếng tự tử. Chẳng bao lâu y được miễn tố, cho phục chức cũ. Y giết chết Võ Đới và đày Dương Tự Minh đi xa lại đánh thuốc độc giết chết Nguyễn Quốc nên lòng nguời đều oán ghét. Nhưng rồi y hưởng lộc cũng chẳng lâu bệnh mất trong năm Ất tị 1185."
  },
  {
    "name": "Đặng Hữu Điểm",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Trần",
    "home": "Không rõ",
    "desc": "Danh thần đời Trần Nhân tông, làm đến Đại phu. Trong cuộc kháng chiến chống Mông Nguyên, ông đã tích cực điều khiển các cơ sở để kịp thời ứng phó với tình hình, giành thắng lợi cho tổ quốc. Năm Nhâm ngọ 1282, ông đi sứ nhà Nguyên, hiệp với Đại phu Lê Nổ hướng dẫn phái đoàn, trước dâng lễ cống, sau dò xét tình hình. Trở về nước, ông càng nỗ lực phục vụ dân nước, nên được sĩ phu trọng vọng kính yêu."
  },
  {
    "name": "Đặng Lộ",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Trần",
    "home": "Không rõ",
    "desc": "Người đời Trần Hiến tông, không rõ năm sinh, năm mất, quê quán. Ông là người có óc khoa học, ông hay sáng tác và phát minh. Ông học rộng, hay nghiên cứu học hỏi, làm quan Hậu nghị lang, ông thường lưu tâm khảo nghiệm về thiên văn, lịch số Chính ông đã sáng chế máy trắc nghiệm khí hậu, khảo sát hình tượng ở trên trời, gọi là Linh lung nghi. Do sự chỉ dẫn của ông, Trần Hiến tông cho sửa đổi quyển lịch thụ thời, gọi là Hiệp kỉ lịch. Khoa thiên văn, toán định lịch số, đời bấy giờ có ông mà phát triển khả quan hơn xưa. Đặng Lộ được xem như nhà khoa học thực nghiệm ra đời sớm nhất của nước ta vào thời phong kiến."
  },
  {
    "name": "Đặng Ma La",
    "otherName": "Không rõ",
    "bornYear": "1234",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Trần",
    "home": "Hà Nội",
    "desc": "Danh thần đời Trần Thái tông, quê làng Tụy Động, huyện Chương Đức, Hà Nội (nay thuộc thành phố Hà Nội). Ông nổi tiếng văn học, gặp khi nhà vua cho thi Đình chọn nhân tài, ông ra thi năm Đinh vị 1247, mới 13 tuổi. Khoa này lấy đỗ Trạng nguyên là Nguyễn Hiền cũng mới 13 tuổi. Bảng nhãn là Lê Văn Hưu 17 tuổi, ông đỗ thứ ba tức Thám hoa. Về việc khoa cử đời Trần, sau hai khoa Nhâm thìn 1232 và Kỉ hợi 1239, gọi là khoa Giáp và khoa Ất, đến khoa Đinh mùi 1247 này, mới bắt đầu lấy đỗ tam khôi. Như vậy ông và Nguyễn Hiền, Lê Văn Hưu nghiễm nhiên là tam khôi đầu tiên của nhà Trần và cũng là đầu tiên của nền khoa cử Việt Nam."
  },
  {
    "name": "Đặng Nhữ Lâm",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Trần",
    "home": "Không rõ",
    "desc": "Danh thần đời Trần Nhân tông, không rõ năm sinh, năm mất, có công trong cuộc kháng chiến chống Mông - Nguyên, ông làm đến Đại phu, tận tụy lo nước thương dân. Sang đời Trần Anh tông, ông hướng dẫn một phái đoàn đi sứ Mông - Nguyên, bị chúng bắt giữ lại suốt hai năm. Đến năm Tân sửu 1301, ông và phái đoàn mới được trả về nước."
  },
  {
    "name": "Đặng Tảo",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Trần",
    "home": "Không rõ",
    "desc": "Một trong năm cao sĩ đời Trần (Châu An, Trương Đỗ, Bùi Mộng Hoa, Trần Đình Tham và ông) không rõ năm sinh, năm mất. Ông nổi tiếng thơ văn, nhưng ông cho sủng lộc làm cay đắng khó chịu cho nguời nên chẳng cầu tiến thân, cam tâm ở chốn ruộng vườn. Các vua Trần rất kính mến khí tiết ông, vẫn thường cho nguời lui tới, thăm viếng và những khi có việc nước quan trọng đều hỏi ý kiến ông. Ông nghiễm nhiên đóng vai trò cố vấn nhưng cương quyết từ chối tất cả bổng lộc của triều đình. Ông tình nguyện làm người thắp hương và coi sócThái lăng (lăng vua Trần Anh tông) ở núi An Sinh. Mỗi khi Trần Minh tông (con Anh tông) lên thăm lăng, ông thường lánh mặt. Nhà vua cảm nghĩa ông, ban cho 20 mẫu ruộng. Nhưng ruộng đó trước kia vua đã cho bà thứ phi là Thiên Xuân. Ông cũng không đòi để lấy lại như vua đã ban. Bạn ca của ông là Lê Trung rất cảm nghĩa ông, bán hết cả nhà cửa ruộng đất rồi đem gia quyến đến ở với ông tại núi An Sinh. Sau cả hai đều mất ở đấy. Vua Trần Nghệ tông sắc tứ hai chữ \"Trung tiết\" đề ở ngôi nhà của hai ông."
  },
  {
    "name": "Đào Sư Tích",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Trần",
    "home": "Nam Định",
    "desc": "Danh thần đời Trần Duệ tông, quê làng Cổ Lễ, huyện Tây Chân (Nam Chân nay là Nam Trực), tỉnh Nam Định, ngụ ở xóm Lý Hải, thôn Song Khê, huyện An Lãng (nay là tỉnh Nam Định). Năm Giáp dần 1374, ông đỗ Trạng nguyên, Bảng nhãn là Lê Hiến Phủ, Thám hoa là Trần Đình Tham. Từ thi Hương đến thi Đình đều đỗ đầu, ông làm đến Lang trung, nhập nội hành khiển. Sau, không hơp với Hồ Quí Li, bị giáng làm Trung thư thị lang đồng tri thẩm hình viện sự. Ông nổi tiếng thơ văn, từng được Trần Nghệ tông trao cho đề tựa bộ sách Bảo hoa điện dư bút gồm 8 quyển do Nguyễn Mậu Tiên và Phan Nghĩa soạn thảo, ghi chép những biến cố đã xảy ra trong đời Trần và sưu tập các châm ngôn đời trước còn lại. Thân phụ ông là Đào Kim Bản, làm việc ở Viện Thẩm hình; cha con đồng triều. Tương truyền: khi ông đi thi, vừa ra ngõ gặp gái, ông có ý chẳng hài lòng, cho là điều gở như phần đông đã có thành kiến. Cô gái biết ý nói: - Gái là nữ tử, chữ nữ ghép với chữ tử là chữ hảo, thế là tốt, ông đi chuyến này ắt đỗ tiến sĩ. - Tiến sĩ đâu vừa ý tôi. - Thế thì Trạng nguyên nhé. Quả nhiên khoa đó ông đỗ Trạng nguyên. Ông sáng tác thơ văn khá nhiều, trong Quần hiền phú tập còn lưu lại bài phú Cảnh tỉnh (Bài phú Sao Cảnh) của ông. Đây là một trong những bài phú nổi tiếng đương thời."
  },
  {
    "name": "Đào Thế Quang",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Trần",
    "home": "Không rõ",
    "desc": "Danh thần đời Trần Thánh tông, không rõ năm sinh, năm mất. Ông từng lãnh nhiệm vụ trinh sát, theo dõi hành động quân xâm lược Mông- Nguyên để báo cáo lên triều đình hầu kịp thời đối phó với giặc ngoại xâm. Có lần Đào Thế Quang lên đường giả dạng là người thầy thuốc đi tìm mua thuốc Bắc. Ông thẳng sang Long Châu, dọ thám tình hình bên Nguyên. Chính nhờ công lao ông mà bờ coi được yên vì ta biết trước động tĩnh của đối phương nên đã phòng bị đâu vào đấy, và khi động binh thì nắm thế tất thắng."
  },
  {
    "name": "Đào Tử Kì",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Trần",
    "home": "Không rõ",
    "desc": "Đại thần đời Trần Nhân tông, không rõ năm sinh, năm mất, dày công trong cuộc vận trù quyết sách kháng cự quân Mông - Nguyên. Năm Quí tị 1293, nhà Nguyên cử Thượng thư bộ Lại là Lương Tằng và Thượng thư bộ Lễ là Trân Phu sang giục Nhân tông sang hầu. Nhân tông không đi phái Đào Tử Kì đi thay. Ông cùng với Đại Phu Lê Văn Táo lên đường sang nhà Nguyên dâng lễ cống và biện bạch mọi lẽ nhưng ông bị chúng bắt giam ở Giang Lăng. Mặt khác, chúng sai Lưu Quốc Kiệt và các tướng sửa soạn binh lương định kéo sang đánh nước ta lần nữa. Lại sai Trần Ích Tắc đi theo về ở Trường Sa để đánh úp quân ta. Nhưng kế hoạch của chúng cũng không thành tựu và chẳng bao giờ thành tựu được nữa. Nguyên Thế tổ Hốt Tất Liệt mất, Nguyên Thành tông lên ngôi, bãi việc toan cướp nước ta và cho Đào Tử Kì về nước. Khi trở về ông được triều đình và nhân dân ngưỡng vọng."
  },
  {
    "name": "Đinh Củng Viên",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "1294",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Trần",
    "home": "Không rõ",
    "desc": "Danh thần đời Trần Thánh tông, giỏi biện thuyết, không rõ năm sinh. Năm Canh ngọ 1270, gặp khi Nguyên Thế tổ sái sứ sang khiến vua Trần phải nộp biểu xưng thần, ông cùng với đại phu Lê Đà sang sứ nhà Nguyên để biện bạch, quyết không để nhục quốc thể. Vua Nguyên tông bảo: - Quân của thiên triều đi đến đâu san bằng đến đó, không ai dám đương cự, trái mạng, sao chúa các người không rõ phận nước nhà toan địch thể với ta sao? Ông thản nhiên đáp: - Nếu nhà vua định đem điều nhân nghĩa mà khiến mọi nguời kính nể thì mới thuyết phục được chúng tôi. Nếu đem binh lực ra dọa nạt, thì dù nhỏ, nước tôi vẫn có binh hùng tướng dũng, có núi non hiểm trở để ngăn chặn và thù tiếp binh thiên triều. Thấy ông biểu dương tinh thần bất khuất của dân tộc ta, Nguyên Thế tổ mến phục. Do đó tránh được việc binh đao một thời gian. Ông làm quan ở Viện Hàn lâm, nổi tiếng thơ văn. Và sau cuộc đi sứ Nguyên về, ông được ca tụng là trang biện sĩ ưu tú."
  },
  {
    "name": "Đỗ Hành",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Trần",
    "home": "Không rõ",
    "desc": "Liệt sĩ đời Trần Nhân tông, trong cuộc kháng Nguyên công lao ông chẳng nhỏ. Năm Mậu tí 1288, trong trận đánh ở Bạch Đằng giang, chính ông đã bắt được tướng Nguyên Ô Mã Nhi và Tích Lệ Cơ Ngọc. Khi kháng chiến thành công, định luận ban thưởng, ông được phong tước Nội Minh tử, sau thăng tước Quan Nội Hầu."
  },
  {
    "name": "Đỗ Khắc Chung",
    "otherName": "Trần Khắc Chung",
    "bornYear": "Không rõ",
    "deathYear": "1330",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Trần",
    "home": "Hải Dương",
    "desc": "Võ tướng đời Trần Anh tông, quê ở Anh Sơn (có sách chép Giáp Sơn), tỉnh Hải Dương). Ông xuất thân là Chi hậu cục thủ, một chức nhỏ, nhưng có tài. Năm Bính tuất 1286, quân Nguyên đóng ở Đông Bộ đầu, Hưng Đạo vương cố thủ ở mé bờ Nam. Trần Nhân tông muốn sai người đi dọ thám tình hình giặc, Đỗ Khắc Chung xin đi, Nhân tông khen: \"Ngờ đâu xe muối mà có ngựa kì ngựa kí như thế\", rồi trao thư cho ông đi đến trại quân Nguyên xin hòa, làm chước hoãn binh. Hoàn thành sứ mạng, ông được trọng dụng. Về sau làm đến Ngự sử đại phu, ít lâu thăng Đại hành khiển. Và được cho theo họ vua, nên cũng gọi là Trần Khắc Chung, rồi thăng làm Thượng thư Tả bộc xạ. Đến đời Trần Anh tông, chính ông đã sang Chiêm Thành cứu Huyền Trân công chúa khỏi phải lên hỏa đàn. Đương thời, ông bị nhiều người chê trách cho là ông có tâm địa xấu. Như khi Huệ Võ vương Trần Quốc Điền bị Văn Hiến Hầu vu làm phản đang giam trong ngục, Trần Minh tông hỏi ý kiến ông xem nên xử thế nào. Ông vốn cùng phe với Văn Hiến Hầu, thản nhiên nói: \"trói cọp dễ, thả cọp khó\". Quốc Điền do đó bị hại. Đến năm Canh ngọ 1330, ông mất được tặng hàm Thiếu sư. Sau đó, bị gia nô của Quốc Điền là Thiếu Võ đào mả lên lấy thây chật đầu và nghiền xương để trả thù cho chủ."
  },
  {
    "name": "Đỗ Thiên Thu",
    "otherName": "Đỗ Thiên Lư - Đỗ Thiên Nghĩa",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Trần",
    "home": "Không rõ",
    "desc": "Danh thần đời Trần Nhân tông, quê ở Hiệp Sơn, em ruột Đỗ Khắc Chung (Trần Khắc Chung) có sách chép là Đỗ Thiên Lư, hay Đỗ Thiên Nghĩa. Anh em ông đều có công đi sứ nhà Nguyên. Khi đi sứ về, được thăng làm An Vũ Vũ Sứ. Sang đời Anh tông, Minh tông, ông cùng với Nguyễn Trung Ngạn, Mạc Đĩnh Chi chung lo việc nước. Tính khẳng khái, mẫn cán trong việc công. Ông là người tự tin mỗi khi tranh chấp với ai điều gì, ông thường lấy ý lực áp đảo. Năm Quí sửu 1313 đời Trần Anh tông, nước Chiêm Thành bị Xiêm (Thái Lan) xâm lược. Ông nhận lệnh đi kinh lí vùng Nghệ An, Tân Bình, rồi sang cứu viện giúp vua Chiêm đuổi được giặc ngoại xâm. Đời Minh tông, khoảng Canh ngọ 1330, khi Thượng hoàng Minh tông thân chinh Ai Lao, ông đang bệnh vẫn hăm hở cố xin theo hộ giá. Thường nói rằng: \"Thà chết ở ngoài quân dinh, chứ không chịu chết ở trên giường đệm\". Thượng hoàng Minh tông khen là khí khái, cho đi theo. Ông tử trận nơi đất địch."
  },
  {
    "name": "Đỗ Tử Bình",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Trần",
    "home": "Không rõ",
    "desc": "Võ tướng đời Trần Duệ tông, không rõ năm sinh, năm mất. Ông giữ nhiệm vụ trấn giữ ở Hóa Châu, để ngăn ngừa Chiêm Thành khuấy rối. Người Chiêm đem vàng dâng vua Tầẫn, Đỗ dấu vàng ấy làm của riêng, lại tâu với vua rằng người Chiêm vô lễ, cần đánh họ, Trần Duệ tông nghe theo, thân chinh đánh Chiêm Thành. Đại thần Đỗ Lê can ngăn không được, treo mũ áo từ quan. Kết quả Duệ tông bị quân Chiêm phục kích tử trận. Đỗ Tử Bình thống lãnh toán hậu quân không ứng cứu, chạy thoát lấy thân. Hồ Quí Li đốc vận lương, được tin, trốn về nước. Triều đình bắt tội, Đỗ bị giáng xuống làm lính. Năm Mậu ngọ 1378, quân Chiêm tràn vào đánh phá, Đỗ đem quân chống cự. Quan quân tự tan vỡ, quân giặc thừa thế tiến đến kinh đô khiến Lê Giác tử tiết, nhưng nhờ có Trần Khắc Chân đánh đuổi được quân giặc. Sau đó quân Chiêm lại xâm phạm Diễn Châu, ông thống lĩnh lục quân, hiệp với Hồ Quí Li thống lĩnh thủy quân, ra sức đánh dẹp. Chiêm vương Chế Bồng Nga thua trận trốn chạy. Ngay khi trở về triều, ông dâng sớ cáo bệnh, xin giải binh quyền rồi chẳng mấy ngày thì mất."
  },
  {
    "name": "Đỗ Tử Vi",
    "otherName": "Tôn Trai",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Trần",
    "home": "Không rõ",
    "desc": "Danh sĩ đời Trần Nghệ tông, hiệu Tôn Trai, không rõ năm sinh, năm mất. Ông làm đến Trung thư lệnh, tính cương trực, khí khái, hết lòng chăm lo việc nước. Thơ văn ông còn truyền tụng nhiều, ý tứ sâu sắc như bài Quá Việt tỉnh cương (Qua gò Việt tỉnh), cảm khái truyện Việt Vương Triệu Quang Phục và Lý Phật Tử xưa. \"Việt tỉnh thê lương thảo mộc thu, Trích lưu sự khứ sử nhân sầu. Bằng thùy mịch đắc tam niên ngãi, Y ngã càn khôn nhất chuế vưu.\" Bản dịch: Việt tỉnh buồn thu cỏ một vùng, Đâu còn việc vắng khách đau lòng. Ba năm cây ngãi ai tìm được, Thử chữa người thừa của hóa công."
  },
  {
    "name": "Đoàn Nhữ Hài",
    "otherName": "Không rõ",
    "bornYear": "1280",
    "deathYear": "1336",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Trần",
    "home": "Hải Dương",
    "desc": "Danh thần đời Trần Anh tông, quê làng Trường Tân, huyện Gia Lộc, thuộc Hồng Châu, tỉnh Hải Dương. Từ bé, ông nổi tiếng ham học, lúc nào cũng cắp sách trên tay. Lớn lên vào học ở kinh sư càng nổi tiếng hơn. Có lần Thượng hoàng Nhân tông về kinh, xem xét qua khắp các cung điện, không thấy Anh tông ra mắt, hỏi ra mới biết nhà vua uống rượu xương bồ say vùi, cung nhân vào gọi không dậy được. Thượng hoàng giận quá, lập tức về Thiên Trường, xuống chiếu nhóm họp các quan làm việc. Anh tông tỉnh rượu, nghe nói kinh hãi, đi bộ qua chùa Tư Phúc định khấn Phật cứu nạn. Bỗng gặp nho sinh Đoàn Nhữ Hài, bèn bảo: - Ta vì quá chén đắc tội với Thượng hoàng, ngươi hãy thảo cho ta một tờ biểu tạ lỗi. Ông vâng lời làm ngay. Anh tông lập tức đem ông theo xuống thuyền, đang đêm về Thiên Trường dâng biểu tạ lỗi. Đến nơi, ông quì dâng sớ, Thượng hoàng không tiếp nhận, ông vẫn phủ phục ngoài thềm, cho đến chiều, mưa to sầm sập, ông cũng không đứng lên. Thượng hoàng nghe nói cảm động, sai đưa tờ biểu vào xem rồi nói với Anh tông: - Trẫm còn có con khác có thể nối ngôi được. Trẫm còn sống mà còn như thế sau này biết đến thế nào! Anh tông cúi đầu tạ lỗi, Thượng hoàng lại hỏi ai làm bài biểu, Anh tông tỏ thật. Thượng hoàng cho vời Nhữ Hài vào ban lời khen. Do đấy, ông được Anh tông phong làm Trung tán. Khi ấy ông mới 20 tuổi (có sách chép là 15 tuổi). Năm 1312, ông đi sứ nước Chiêm Thành. Theo thông lệ, sứ ta phải lạy vua Chiêm rồi mới mở tờ chiếu, nhưng ông nghĩ cách thay đổi lệ ấy. Ông đến thẳng nơi đặt bàn, để tờ chiếu của vua lên, bảo rằng lạy chiếu của vua rồi sau mới tuyên đọc, tỏ ra không chịu khuất. Sau này các sứ ta không lạy vua Chiêm, chính do ông mở lối. Ông càng được trọng dụng, phong làm Tham tri chính sự. Sang đời Trần Hiến tông, Thượng hoàng Minh tông thân chinh đi đánh Ai Lao, ông làm đốc tướng và tử trận. Sau khi mất ông được truy phong làm Thượng đẳng phúc thần, các làng trong huyện Gia Lộc như Hội Xuyên, Tăng Thượng, Phó Trào đều có miếu thờ ông."
  },
  {
    "name": "Đổng Kiên Cương",
    "otherName": "Pháp Loa",
    "bornYear": "1284",
    "deathYear": "1330",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Trần",
    "home": "Hải Dương",
    "desc": "Thiền sư tổ thứ hai phái Trúc Lâm, thiền tông Việt Nam, đạo hiệu Pháp Loa. Quê làng Cửu La (nay là Phụ Vệ), huyện Chí Linh, tỉnh Hải Dương. Ông sinh ngày mùng 7 tháng 5 năm Giáp thân 1284 đời Trần Nhân tông, cha là Đồng Thuần Mậu, mẹ là Võ Từ Cứu. Tương truyền: thân mẫu ông từ trước đã mấy lần sinh gái, đến khi có nghén ông, tưởng sẽ là gái nữa, nên thất vọng uống thuốc phá thai, không muốn sinh nở. Chẳng dè thuốc không công hiệu, bà mang mãn, đến khi sinh ra ông mới đặt tên là Kiên Cương. Năm Giáp thìn 1304, vua Nhân tông khi ấy đã đi tu ở núi Trúc Lâm, gặp ông trong cuộc vân du ở mạn sông Nam Sách, khen ông có pháp nhân, thâu làm đệ tử, đặt pháp hiệu là Thiện Lai, đưa về liêu Kì Lân ở Linh Sơn cho học đạo. Năm sau, Ất tị 1305, thấy ông học lực tinh tiến, Nhân tông lại đặt pháp hiệu khác cho ông là Pháp Loa. Năm Mậu thân 1308, ông được lệnh làm lễ khai giảng ở chùa Siêu Loại, có vua và đình thần tham dự. Xong ông được mời trụ trì chùa Siêu Loại, làm chủ sơn môn Yên Tử, coi sóc hơn 200 bộ kinh điển. Ông cũng nhận sắc truyền giới xuất gia cho Tuyên Từ Hoàng Thái hậu và Thiên Trinh trưởng công chúa. Lại phụng chiếu định chức các tăng đồ và quản lãnh lấy. Trước sau ông cho đúc 1300 tượng Phật, dựng ba đài giảng đạo, năm ngôi tháp, 200 sở tăng đường. Khi Trần Nhân tông, tức Điền Ngự Giác Phật mất ở am Ngọa Vân, chính ông phụng tống xá lợi vào đại nội. Trần Anh tông tôn ông làm Quốc sư và phong là Anh mẫn phủ tuệ tôn giả. Năm Canh ngọ 1330, ngày 3-3, ông mất hưởng dương 46 tuổi, còn để lại các tác phẩm: - Đoạn sách lục, - Tham thiền yếu chỉ - Kim cương đạo tràng đà la ni kinh, - Tán pháp hoa kinh khóa số, - Bát nhã tâm kinh khoa, Khi sắp mất, ông truyền tâm ấn cho sư Huyền Quang Lý Đạo Tái và đọc bài kệ cho các đệ tử (hơn 15.000 người). Vạn duyên tuyệt đoạn nhất thân nhàn, Tứ thập dư niên mộng huyễn gian. Trân trọng chư nhân hưu quái vấn, Na biên phong nguyệt cánh cư khoan Bản dịch: Muôn duyên cắt đứt một thân nhàn, Hơn bốn mươi năm giấc mộng tràn. Nhắn bảo người đời đừng gạn hỏi, Bên kia trăng gió rộng mang mang. Khi ông mất, các đệ tử đem thi hài ông về núi Thanh Mai, đến ngày 11-3, Thái thượng hoàng Minh tông ngự bút truy tặng tôn hiệu ông là Tịnh trí Đại tôn giả, ban mười lượng vàng để xây tháp gọi là tháp Viên Thông. Hay tin ông mất, Trần Hiến tông có làm bài thơ viếng ông; trong đó có mấy câu: \"Tự tòng Pháp Loa khứ thế hậu Thiên hạ Thích tử không vô nhân\". Nghĩa: Pháp Loa từ bỏ cõi đời, Khắp trong thiên hạ ai người chân tu? Ở chùa Thanh Mai nơi quê quán ông hãy còn nhiều di tích, và tại chùa Hương Thảo còn có bài bia ghi tiểu sử ông."
  },
  {
    "name": "Hà Chương",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Trần",
    "home": "Không rõ",
    "desc": "Chí sĩ đời Trần Nhân tông, không rõ năm sinh, năm mất ông cùng với anh là Hà Đặc nỗ lực kháng Nguyên, đánh nhau với giặc nhiều trận oanh liệt. Sa cơ, ông bị giặc bắt, chúng dụ hàng, ông một mực cự tuyệt. Rồi lừa lúc chúng bất cẩn trong việc giam giữ, ông vượt nguc, lấy theo một số cờ và quân trang của giặc trốn về dâng lên chủ tướng, xin dùng cho quân mình trá hình làm quân địch để trà trộn tấn công chúng. Mưu kế thành tựu, giặc vỡ tan sau nhiều trận đột kích dữ dội do ông chỉ huy."
  },
  {
    "name": "Hà Đặc",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Trần",
    "home": "Không rõ",
    "desc": "Thủ lĩnh dân tộc miền núi. Không rõ năm sinh, năm mất. Năm Kỉ mão 1279, giặc Nguyên sang xâm lược, vượt sông Thiên Mạc, tiến binh đến huyện Phù Ninh. Ông đem dân binh lên núi Trĩ cố thủ, quân Nguyên đóng đồn ở động Cự Đà ông làm kế nghi binh để cầm chân giặc rồi bện tre làm bù nhìn cho mặc áo quần giống như người thật, hằng đêm dàn đám bù nhìn ấy ra. Giặc Minh nghi không dám giao chiến. Chẳng bao lâu quân tiếp viện kéo đến, ông hiệp sức đánh phá, giặc tan vỡ. Ông đuổi theo đến vùng A Lạc, rồi bắc cầu nổi sang sông, đánh đuổi cho kì quân địch tan vỡ mới thôi. Em ông là Hà Chương cũng nổi danh anh hùng liệt sĩ kháng Nguyên."
  },
  {
    "name": "Hồ Huyền Quy",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Trần",
    "home": "Không rõ",
    "desc": "Xử sĩ cuối đời Trần, không rõ năm sinh, năm mất, tác giả tập truyện thơ Trinh thử. Ông có tài văn thơ. Nhân thời cuộc rối rắm, lại không phục Hồ Quí Ly lúc ấy đang nắm quyền chính, có ý khuynh đảo nhà Trần, ông lánh mình ở ẩn. Tập thơ Trinh thử của ông còn được lưu truyền, vốn ngụ ý châm biếm Quí Ly và hoàn cảnh chính trị thời ấy. Tác phẩm bằng văn Nôm, 850 câu, thể lục bát. Tục gọi Thơ nàng chuột, có giá trị về luân lí và triết lí."
  },
  {
    "name": "Hồ Tông Thốc",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Nhà Trần",
    "home": "Nghệ An",
    "desc": "Danh sĩ đời Trần Duệ tông, không rõ năm sinh, năm mất, quê làngThổ Thành, phủ Diễn Châu, tỉnh Nghệ An, sang cư ngụ xã Vô Ngại, huyện Đường Hào (sau là phủ Mĩ Hào) tỉnh Hưng Yên (nay vẫn là tỉnh Hưng Yên). Năm Nhâm tí 1372, ông đỗ Thái học sinh làm An phủ sứ, ông có sang sứ nhà Minh. Năm Bính dần 1386, làm Học sĩ Viện Hàn lâm, kiêm chức Thẩm hình viện sự. Đến khi Hồ Quí Ly truất phế Trần Thiếu đế, ông cáo quan lui về, hơn 80 tuổi mới mất, còn để lại các sách: - Thảo nhàn hiệu tần tập - Việt sử cương mục. - Việt Nam thế chí - Phú học chỉ nam Ông còn có nhiều bài thơ được truyền tụng như: Qua miếu Hạng Võ, Tặng Nuyễn Phi Khanh. Ông cũng có soạn bài văn Bia chùa Báo ân. Con cháu ông như Hồ Sĩ Dương, Hồ Sĩ Đống đều là bậc danh sĩ đương thời."
  },
  {
    "name": "Trần Hi Cát",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "1409",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Hậu Trần",
    "home": "Thanh Hóa",
    "desc": "Văn thần đời Hậu Trần, người tỉnh Thanh Hóa. Khi quân Minh sang cướp nước, dứt nhà Hồ, ông cùng các nghĩa sĩ lo liệu việc chống giặc cứu nước. Khi Trần Quĩ (có sách chép là Trần Ngỗi) con Trân Nghệ tông khởi nghĩa kháng chiến, ông theo giúp, được trọng dụng, phong đến chức Thái bảo. Năm Mậu tí 1408, khoảng tháng 11 âm lịch, tướng giặc Mộc Thạch đem binh vây đánh, bắt được ông và Giản Định đế Trần Quĩ cùng với hai tướng Nguyễn Nhữ Lệ, Nguyễn Yến tại bến Cát Lợi huyện Mĩ Lương (nay thuộc tỉnh Nam Định), đóng cũi giải về Yên Kinh (Trung Quốc). Chúng giết ông, Trần Quĩ Nguyễn Nhữ Lệ và Nguyễn Yến trong năm Kỉ sửu 1409. Người sau có thơ điếu: \"Thành Bắc luy lung lưỡng diếu mang, Quân thần tương ngộ mạc tương vương (vong) Bách niên nghĩa hiệp sơn hà cố, Thiên tải danh lưu nhật nguyệt trường. Khuy khấp dã viêm bi trú bạch, Thính ai sơn điểu phạ hôn hoàng. Hành nhân quải kiếm kim hà tại, Độc đối càn khôn trở đậu hương.\" Bản dịch: Thảm thảm Bắc thành xiết nỗi đau. Vua tôi gặp gỡ dám quên đâu. Trăm năm nghĩa hiệp còn lưu mã, Muôn thuở phương danh vẫn để lâu. Vượn khóc đầu non lòng những ngán, Chim than trên núi dạ thêm sầu. Mang gươm người cũ nay đâu tá? Trở đậu hương nồng trải mấy thu."
  },
  {
    "name": "Trần Phong",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "1428",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Hậu Trần",
    "home": "Hải Dương",
    "desc": "Tay sai giặc Minh đời hậu Trần, quê xã Ma Lộng, huyện Chí Linh, tỉnh Hải Dương. Khi quân Minh sang xâm lược nước ta, ông ta đem bộ thuộc hàng giặc được phong chức chỉ huy Đồng Tri, Hữu Vệ. Ông từng báo cáo, chỉ điểm giết hại nhiều nhà yêu nước, phá vỡ các phong trào khởi nghĩa gây nhiều nợ máu với nhân dân. Năm 1412 ông giữ chức Đô chỉ huy cùng với Lương Nhữ Hốt là hai tên tàn hại nhiều đồng bào ta. Đến lúc cuộc khởi nghĩa Lam Sơn đến hồi quyết định, bọn Vương Thông xin hòa và rút quân về, ông và Lương Nhữ Hốt xin qui thuận Lê Lợi. Nhưng sau đó ông và Lương Nhữ Hốt lại kết bè đảng âm mưu làm gián điệp cho giặc Minh. Việc bại lộ, do tướng trấn thủ Thái Nguyên là Hoàng Nguyên Ý khám phá được một số mật thư của ông gởi cho tướng Minh ở biên giới xúi giục tướng Minh sang gây hấn, bọn ông sẽ làm nội ứng. Tội ác của ông bị phơi bày, vào khoảng cuối năm Mậu thân 1428, ông và đồng bọn bị đền tội."
  },
  {
    "name": "Trần Quí Khoáng",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "1414",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Hậu Trần",
    "home": "Nam Định",
    "desc": "Có sách chép là Khoách hay Khuyết, cháu vua Trần Nghệ tông. Quê ở làng Tức Mặc, huyện Mĩ Lộc, phủ Thiên Trường tỉnh Nam Định. Khi quân Minh xâm lược, ông được Đặng Dung và Nguyễn Cảnh Dị đón vào Nghệ An tôn lên làm vua, lấy hiệu là Trùng Quang, tiếp tục cuộc kháng chiến cứu nước. Năm Quí tị 1413 Trương Phụ đưa quân đi đánh Nghệ An, ông lui vào Hóa Châu, sai Nguyễn Biểu đến trại Trương Phụ điều đình. Phụ giết Nguyễn Biểu tiến đánh Hóa Châu, rồi vào Thuận Hóa; ông và tướng Đặng Dung bị bắt, Đặng Dung bị giết, còn ông thì chúng giải về Trung Quốc cùng với tướng Nguyễn Súy. Trên chiến thuyền giải đi, dọc đường ông nhảy xuống biển tự tử vào năm Giáp ngọ 1414. Ông có làm bài thơ Nôm tiễn Nguyễn Biểu đi sứ, và khi nghe tin Nguyễn Biểu hi sinh, ông làm bài văn tế bằng chữ Nôm rất thống thiết."
  },
  {
    "name": "Nguyễn Trãi",
    "otherName": "Ức Trai",
    "bornYear": "1380",
    "deathYear": "1442",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Hậu Trần",
    "home": "Hà Tây",
    "desc": "Danh sĩ, nhà văn hóa lớn, hiệu Ức Trai, cháu ngoại Tư Đồ Trần Nguyên Đán - tôn thất nhà Trần - con danh sĩ Nguyễn Ứng Long tức Nguyễn Phi Khanh. Quê làng Nhị Khê, huyện Thượng Phúc, tỉnh Hà Đông (nay là thôn Nhị Khê, xã Quốc Tuấn, huyện Thượng Phúc, thuộc tỉnh Hà Tây). Năm Canh thìn 1400 ông đỗ Thái học sinh, đời nhà Hồ, lúc 20 tuổi. Làm Ngự sử đài chánh chưởng. Năm Đinh hợi 1407, nhà Minh sang cướp nước ta, cha ông bị chúng bắt giải về Kim Lăng, ông đi theo đến Nam Quan gặp cha. Cha ông khuyên ông hãy trở về lo việc báo thù cho cha, rửa hận cho nước, ông vâng lời nhưng khi trở về, ông bị chúng bắt giam lỏng ở phía Nam thành Đông Quan (Hà Nội). Năm Mậu tuất 1418 ông cùng Trần Nguyên Hãn trốn vào Lam Sơn, tham dự cuộc khởi nghĩa do Lê Lợi lãnh đạo. Suốt 10 năm kháng chiến cứu nước, ông đã ra tài về chiến lược quân sự, ngoại giao giúp cuộc kháng chiến thành công. Năm Đinh vị 1427 ông được liệt vào hàng Đại phu, coi sóc các việc chính trị và gồm coi việc ở Viện Khu mật. Năm sau (Mậu thân 1428) Lê Lợi lên ngôi, phong ông tước Quan Phục Hầu và cho theo họ vua, nên cũng gọi là Lê Trãi. Đến khi Lê Thái tổ mất, ông bị bọn nịnh thần gièm pha nên phải cáo quan, ẩn dật ở Côn Sơn, thuộc Chí Linh, tỉnh Hải Dương (nay vẫn thuộc Hải Dương). Năm Giáp dần 1434, Lê Thái tông lại triệu ông ra, tỏ vẻ tin dùng, ông đành trở lại triều đình lo việc chính trị, văn hóa. Nhưng không bao lâu Lê Thái tông đi duyệt binh ở Hải Dương, ngụ nơi Vườn Vải (Lệ Chi viên) của ông, rồi đột ngột bệnh mất tại đấy. Đám gian thần nhân đó ghép ông vào tội đã khiến nàng hầu Nguyễn Thị Lộ giết vua, rồi bắt ông giam vào ngục. Năm Nhâm tuất, ngày 16-8 Ất lịch (19-9-1442) ông bị giết với cả ba họ, thọ 62 tuổi. Sang đời Lê Thánh tông, nỗi oan của ông được giải, vua truy phong là Tế Văn Hầu, và các con cháu còn sót lại (Nguyễn Anh Võ, Tô Giám, Tô Kiên...) đều được trọng dụng. Tâm sự ông u uất, nghìn sau như còn thấy tiếng thở dài của ông trong bài thơ Oan ngục bằng chữ Hán và bài Tự Thán bằng Quốc âm: Chiếc thuyền lơ lửng bên sông, Biết đem tâm sự ngõ cùng ai hay. Chắc chi thiên hạ đời này, Mà đem non nước làm rầy chiêm bao. Đã buồn về trận mưa rào, Lại đau về nỗi ào ào gió đông. Mây trôi nước chảy xuôi dòng, Chiếc thuyền lơ lửng trên sông môt mình. Các tác phẩm của ông còn truyền tụng: - Bình Ngô đại cáo - Bài văn bia Vĩnh Lăng ỏ Lam Sơn - Quân trung từ mệnh tập - Ức Trai dư địa chí - Quốc âm thi tập - Ức Trai di tập - Ngọc Đường di cảo - Gia huấn ca Nay đền thờ ông vẫn còn rực rỡ ở quê hương. Hai câu đối của Phạm Quí Thích tán tụng công nghiệp ông: Sự nghiệp văn chương khai quốc thủ Kì thường đới lê cố gia thanh. Công tồn khai quốc Lam Sơn lục; Khánh điển truyền gia cố ấp từ. Các danh sĩ từ trước đến nay đều ca ngợi công nghiệp ông. Trong Khiếu Vịnh thi tập của Hà Nhậm Đại đời Hậu Lê có bài thơ quốc âm đề vịnh: Giấc mộng hai nơi khéo tỏ tường, Tới non sông gặp đức Cao hoàng. Hịch thư nhiều thuở tài mau mắn, Pháp độ trăm đường sức sửa sang. Công giúp hồng đồ cao tợ núi, Danh ghi thanh sử sáng bằng gương. Họa kia gây bởi văn hoàng lỗi, Xà nọ lời đâu chỉn lạ nhường."
  },
  {
    "name": "Bùi Ban",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Thuộc Minh",
    "home": "Hà Tĩnh",
    "desc": "Danh tướng của Bình Định vương Lê Lợi, không rõ năm sinh năm mất. Con Mậu Quận Công Bùi Bị, cha con đều là bậc trung nghĩa. Khi giặc Minh xâm lược, ông theo phù tá Lê Lợi, Lê Lợi cảm nghĩa gả con gái Trang Từ cho. Trong trận đánh ở làng Thổ Hoàng, huyện Hương Khê, tỉnh Hà Tĩnh (nay thuộc tỉnh Hà Tĩnh), ông bị tử thương. Sau được truy phong tước Minh Quận Công. Đền thờ ông được lập ở làng Thổ Hoàng."
  },
  {
    "name": "Đinh Lễ",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "1427",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Thuộc Minh",
    "home": "Thanh Hóa",
    "desc": "Danh tướng kháng Minh, dưới cờ Bình Định vương Lê Lợi, quê huyện Thụy Nguyên, tỉnh Thanh Hóa (nay vẫn thuộc tỉnh Thanh Hóa). Ông vốn là cháu ngoại Lê Lợi, vì nhờ các chiến công to nên được mang họ vua, cũng gọi là Lê Lễ. Ông cùng em là Đinh Liệt dấn thân cứu nước, ngay từ lúc đầu Lê Lợi hưng binh. Khi hành quân ở Chí Linh, bị quân Minh vây, ông cùng Bình Định vương náu mình trên ngọn núi, không có lương thực và cũng không nấu nướng gì được để ăn. Mãi khi giặc rút lui, ông lại cùng Bình Định vương quay về đắp lũy để giữ Lam Sơn. Trận đánh ở cửa ải Khả Lưu, ông cùng Lê Sát, Phạm Vấn dũng câm xông trận, bắt được đô tư Châu Kiệt, chém tướng tiền phong giặc là Hoàng Thành nên được thăng chức Tư Không. Khi đó ông liền dẫn quân đánh úp thành Tây Độ. Năm Ất tị 1425, tháng 5, ông phục binh đoạt đoàn thuyền lương của giặc do Trương Hàng điều khiển. Năm Bính ngọ 1426, tháng 10 mở màn trận Tụy Động, ông và Lê Truyện đại phá giặc Minh, chém Thượng thư Trần Hiệp và nội quan Lý Lượng, giết hơn 5 vạn địch quân, thu nhiều chiến lợi phẩm. Thừa thắng, ông tiến đóng ở Bồ Đề, Vương Thông ra đánh quân ta ở Tây Phù Liệt (thuộc huyện Thanh Trì) ông và Nguyễn Xí đem binh đi cứu, đến Mi Động (thuộc Hoàng Mai, huyện Thanh Trì, đôi bên đối địch ông cưỡi voi hăng hái đánh phá. Nhưng vì địa bàn bùn lầy nước đọng, thất thế, ông sa vào tay giặc và bị giết, khoảng mùa xuân Đinh tị 1427. Đền thờ ông ở núi Tùng Linh, thuộc làng Việt Yên Hạ, huyện La Sơn, tỉnh Hà Tĩnh. Vì xưa kia ông từng đóng quân trên núi ấy để chống quân Minh. Cho đến đời nhà Nguyễn, Gia Long vẫn tỏ lòng kính mộ uy phong ông, liệt vào hàng đệ nhất công thần đời Lê Thái tổ."
  },
  {
    "name": "Lê Lai",
    "otherName": "Nguyễn Thân",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Thuộc Minh",
    "home": "Thanh Hóa",
    "desc": "Danh tướng, có sách chép là Nguyễn Thân, sau theo phò Lê Lọi, đổi tên là Lê Lai. Quê thôn Dang Ta, huyện Thụy Nguyên, tỉnh Thanh Hóa. Thân phụ ông tên Kiều, làm phụ đạo đất Lam Sơn, sinh hai trai, trưởng tên Lạn, thứ là ông. Ông theo dưới cờ Bình Đinh vương Lê Lợi, dũng liệt kháng Minh cứu quốc. Năm Bính thân 1416, tại Lũng Nhai, ông cùng Bình Định vương và 17 tướng lãnh tâm phúc thề sống chết có nhau, được Lê Lợi trao chức Đô tổng quản. tước Quan Nội Hầu. Năm Mậu tuất 1418, khoảng cuối năm, bị quân Minh vây ngặt ở vùng Chí Linh, Bình Định vương hỏi các tướng: - Ai khứng giả dạng ta cầm quân chống nhau với giặc, noi gương Kỉ Tín ngày xưa chết thay cho Hán Cao tổ? Để ta náu dấu nghỉ binh góp nhặt tướng sĩ mà lo nổi dậy phục quốc về sau? Lê Lai tình nguyện xin đi. Bình Định vương cảm khái, khấn với trời đất: - Lê Lai vì đại nghĩa xả thân, tôi thề ngày sau chẳng quên ơn ấy, nếu nuốt lời thề thì cung điện thành rừng núi, ấn báu thành đồng, gươm thần thành đao. Lê Lai bèn ăn mặc giả nhà vua, đem 500 quân, 2 thớt voi, thẳng tới trại giặc khiêu chiến. Quân Minh vây đánh, ông chiến đấu đến lúc kiệt sức, để cho giặc bắt và chịu cho chúng giết. Nhớ công ơn Lê Lai, vua Lê đã cho tìm thây ông từ trước, chôn ở Lam Sơn, khi lên ngôi truy tặng ông là Đệ nhất công thần. Năm Kỉ dậu 1429 truy phong là Thái úy. Đến đời Nhân tông, Quí hợi 1443, truy tặng là Bình Chương quân quốc trọng sự, cho Kim ngù đại kim phù, tước là Huyện Thượng Hầu. Đời Thánh tông lại tặng là Thái phó, tước Diên Phúc Hầu, truy phong là Trung Túc vương. Lê Lai có 3 người con là Lư, Lộ và Lâm đều có tiếng trên lịch sử. Đến đời nhà Nguyễn, Gia Long liệt tên ông vào hàng khai quốc công thần đệ nhất triều Lê, cho tìm con cháu ông coi giữ đền thờ. Bình Định vương thường nói: \"Sau này ta mất đi, khi đến lễ giỗ ta, thì một ngày trước đó phải cúng tế Lê Lai\". Ca dao ta còn truyền tụng: Hăm mốt Lê Lai, hăm hai Lê Lợí."
  },
  {
    "name": "Lê Lăng",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Thuộc Minh",
    "home": "Không rõ",
    "desc": "Võ tướng, phục vụ dưới cờ kháng Minh cứu quốc do Bình Định vương Lê Lợi lãnh đạo không rõ quê quán, năm sinh và năm mất. Ông tận tụy hi sinh, hăng say chống địch, trăm trận xem thường sống chết, được Lê Lợi trọng vọng, phong tước là Tư Quận Công. Con ông là Lê Ngang cũng là viên dũng tướng, lừng danh trong các chiến dịch đánh thành Cổ Lộng, Nghệ An."
  },
  {
    "name": "Lê Lộ",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "1424",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Thuộc Minh",
    "home": "Không rõ",
    "desc": "Võ tướng đời Lê Thái tổ. Con thứ hai của Trung Túc vương Lê Lai. Ông nhiệt thành phò tá Bình Định vương Lê Lợi, tận tụy kháng Minh cứu nước. Trong chiến dịch ở sách Ba Lẫm, ải Kình Lộng, ông phát phục binh phá quân của tướng Minh là Trần Trí, đại thắng, được thăng Tả trung quân tổng đốc chư quân sự. Năm Giáp thìn 1424, ông theo Bình Định vương đánh châu Trà Lân, dự trận Bồ Liệp, phá quân Phương Chính và Sư Hữu, được thăng Thái bảo. Nhưng đến tháng 10 năm ấy, ông bị trúng tên lạc mà chết ngay trận địa. Năm Mậu thân 1428, Bình Định vương lên ngôi vua tức Lê Thái tổ, truy tặng ông là Thái úy. Đời Lê Thánh tông, tặng ông tước Chiêu Quận Công. Anh ông là Lê Lư, em là Lê Lâm cũng đều là bậc hào kiệt. Ba con trai của ông là Tích, Trung, Dũng cũng đều có công giữ nước nên đều được phong thần."
  },
  {
    "name": "Ngô Đễ",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Thuộc Minh",
    "home": "Bắc Ninh",
    "desc": "Võ tướng theo giúp Lê Lợi khởi nghĩa ở Lam Sơn, không rõ năm sinh, năm mất, được cho theo họ vua, nên cũng gọi là Lê Đễ. Quê huyện Yên Phong, tỉnh Bắc Ninh. Ông dũng cảm xông pha trận mạc, dày công lao, được phong làm Thống lĩnh tướng quân. Đến khoảng năm 1426-1427, ông hi sinh lúc cuộc khởi nghĩa sắp thành công. Khôi phục xong đất nước, vua Lê truy niệm ông vào hàng đệ nhất công thần, phong làm Phúc thần, cấp cho ruộng đất để con cháu gầy nghiệp, thờ phụng. Trải qua các triều đại đều có truy phong."
  },
  {
    "name": "Nguyễn An",
    "otherName": "Không rõ",
    "bornYear": "1381",
    "deathYear": "1453",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Thuộc Minh",
    "home": "Không rõ",
    "desc": "Công trình sư đời Trần Thuận tông, không rõ quê quán. Năm Đinh hợi 1407, giặc Minh sang xâm chiếm bắt một số đông người tài giỏi về mọi ngành nghề đưa về Kim Lăng (Trung Quốc) trong số đó có Nguyễn An lúc ông mới 28 tuổi. Ông có trình độ kĩ thuật cao, lại giỏi về kiến trúc, nên được Minh Anh tông trọng dụng, phong làm Thái giám. Nhân khi xây dựng lại thành Bắc Kinh, có nguời tiến cử ông. Vua Minh giao cho ông đốc suất toàn thể nhân công xây dựng, hiệp cùng Đô đốc nguời Minh là Ngô Trung lo việc thiết kế thi công. Trong quyển Kinh kì kỉ thắng của Dương Sĩ Kỳ - một quan lại nhà Minh, có ghi thuật công trình kiến trúc quần thể cung điện nhà vua ở kinh thành Bắc Kinh đã khen ngợi tài năng Nguyễn An trong việc tu tạo cố cung. Đến lúc ngoài 70 tuổi nhà Minh vẫn dùng ông trong công tác xây dựng cống đập ở sông Hoàng Hà. Vất vả cực nhọc vì công tác xây dựng, ông bệnh mất trong năm Quí dậu 1453, thọ 72 tuổi."
  },
  {
    "name": "Nguyễn Cảnh Dị",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "1413",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Thuộc Minh",
    "home": "Nghệ An",
    "desc": "Anh hùng liệt sĩ kháng Minh trong đời vua Trùng Quang, quê làng Ngọc Sơn, tỉnh Nghệ An (nay là Nam Đàn, tỉnh Nghệ An). Cha là Cảnh Chân theo Giản Định Đế làm Đồng Tri khu mật tham mưu quân sư, có công chống giặc Minh, nhưng lại bị vua Giản Định nghe gièm mà giết đi. Thù nhà nợ nước, ông bèn đem quân vào Thanh Hóa lập Trần Quí Khoách lên ngôi tức vua Trùng Quang, ông làm Thái bảo, dẫn quân tới Bình Than (huyện Chí Linh, tỉnh Hải Dương) chống nhau với tướng Minh là Trương Phụ dẫn đầu xâm lược. Năm Canh dần 1410, đạo quân của ông phá tan binh giặc do Đô đốc Minh là Giang Hạo chỉ huy tại Hạ Hồng (Ninh Giang), rồi thừa thắng xông lên. Truơng Phụ kéo quân đánh phá Nghệ An. Ông và Nguyễn Súy chống cự quyết liệt nơi Mô Độ (huyện Tam Điệp, tỉnh Ninh Bình). Thế yếu, tướng sĩ cùng quan quân bỏ Mô Độ chạy về đường biển. Cuối cùng Trương Phụ bắt được ông và Nguyễn Súy vào năm Quí tị 1413, giặc dụ hàng nhiều lần nhưng không khuất được ông, ông mắng Trương Phụ: \"Tao muốn giết mày, trở lại bị mày bắt, đành là một chết mà thôi!\" Trương Phụ giết rồi ăn gan ông."
  },
  {
    "name": "Lê Ngân",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Thuộc Minh",
    "home": "Thanh Hóa",
    "desc": "Võ tướng đời Lê Thái tổ, không rõ năm sinh năm mất, quê huyện Thụy Nguyên, tỉnh Thanh Hóa. Nhiệt thành ái quốc, ông theo dưới cờ giải phóng của Bình Định vương Lê Lợi ngay từ khi mới dấy quân. Trong các trận đánh ải Khả Lưu và vây thành Nghệ An, ông lập nhiều chiến công hiển hách. Cuộc khởi nghĩa thành công, ông được phong tước Á Thượng Hầu, nghiễm nhiên là vị đại thần tại triều. Đời Lê Thái tông, ông làm phụ tướng (Ất mão 1435) nhưng được ít lâu thì bị ghép vào tội nặng, phải tự tử. Sang đời Lê Nhân tông, khoảng năm Mậu thìn 1448, nhà vua truy niệm công lao ông, ban cho con cháu ông 100 mẫu ruộng. Đến đời Thánh tông, Giáp thìn 1484, truy tặng ông là Thái phó."
  },
  {
    "name": "Nguyễn Chích",
    "otherName": "Không rõ",
    "bornYear": "1382",
    "deathYear": "1448",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Thuộc Minh",
    "home": "Thanh Hóa",
    "desc": "Danh tướng trong cuộc khởi nghĩa Lam Sơn và là trọng thần giữ phần đất phía Nam của triều Lê sơ, được cho theo họ vua, nên cũng gọi là Lê Chích. Quê ở thôn Mạc, huyện Đông Sơn, tỉnh Thanh Hóa (nay là xã Vạn Lộc, Đông Sơn, Thanh Hóa). Ông thuở trẻ nghèo khổ, chăn trâu ở vùng núi Hoàng, núi Nghiêu. Khoảng cuối đời Trần, quân Minh xâm chiếm nước ta, ông chiêu tập nghĩa quân hơn 1000 người, đắp 1ũy trong vùng động Hoàng Nghiêu làm căn cứ kháng chiến. Sau ông theo giúp Lê Lợi, làm Nội Thiếu úy công trận rất nhiều, lại từng hiến nhiều kế sách rất hay, thu đạt thắng lợi. Cuối năm 1427, ông cùng Phạm Văn Xảo, Trịnh Khả đánh tan quân Mộc Thạch ở Lê Hoa (Hà Tuyên). Sau khi đuổi xong giặc Minh (1428), ông lại tham gia đánh dẹp cuộc nổi dậy của Đèo Cát Hãn, Cấm Quí. Trong đời Lê Thái tổ, ông được trọng dụng, sang đời Lê Thái tông, ông làm Tổng quản ở Hóa Châu đánh dẹp Chiêm Thành, thanh danh lừng lẫy. Rồi làm Đô đốc từng được tham dự việc triều đình. Năm Mậu thìn 1448, ông mất thọ 66 tuổi được truy tặng chức Tư Không Bình chương sự. Cho đến đời nhà Nguyễn, các triều vua vẫn tưởng niệm ông, liệt ông vào hàng khai quốc công thần nhà Hậu Lê."
  },
  {
    "name": "Phạm Vấn",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "1435",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Thuộc Minh",
    "home": "Thanh Hóa",
    "desc": "Danh tướng đời Lê Thái tổ, quê làng Nguyên Xá, huyện Lương Giang (nay thuộc huyện Thọ Xuân, tỉnh Thanh Hóa). Ông tham gia khởi nghĩa Lam Sơn từ buổi đầu, lập nhiều chiến công hiển hách. Trong trận Bồ Mộng (thuộc vùng thượng du Thanh Hóa) phá vỡ đạo quân của Lý Bôn. Phương Chính (Canh tí 1420), trận phá vây ở Khôi Sách (1422), chém tướng giặc Phùng Quí; trận Nghệ An (1424) ông chiến thắng ở Trà Lân, Khả Lưu, trận đánh Xương Giang (1427), ông cùng Trần Nguyên Hãn, Lê Sát, vây chặt toàn quân của tướng giặc Thôi Tụ, Hoàng Phúc khiến Vương Thông phải xin hòa. Kháng chiến thành công (1428) ông được phong Đại tướng quân, tước Thượng Tứ Tự, rồi ít lâu thăng Tể phụ. Nhập nội Kiểm hiệu. Bình chương quân quốc trọng sự. Năm 1429, tấn phong ông tước Huyện Thượng Hầu, khắc tên ông đứng hàng đầu trên bia công thần. Năm 1431, ông được thăng Kiểm hiệu Đô đốc, Quận hầu. Lê Thái tổ mất (1433) ông và Lê Sát phụ chính Lê Thái tông, hai năm sau (Ất mão 1435) ông mất, được tặng Thái phó, thụy Tuyên Võ."
  },
  {
    "name": "Phạm Văn Xảo",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "1429",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Thuộc Minh",
    "home": "Hà Nội",
    "desc": "Danh tướng trong cuộc khởi nghĩa Lam Sơn, quê ở miền Kinh Lộ, tức vùng kinh đô Thăng Long (nay thuộc Hà Nội). Ông tham gia khởi nghĩa từ buổi đầu được Bình Định vương Lê Lợi trao chức vụ Khu mật đại sứ. Năm Bính ngọ 1426, ông cùng Lý Triện, Trịnh Khả đóng bản doanh ở phía Tây Ninh Giang để uy hiếp Đông Đô, Tam Giang, rồi đánh tan đạo quân do Vương An Lao chỉ huy. Nghĩa quân giải phóng một vùng rộng lớn gồm Gia Hưng, Thao Giang, Quy Hóa (nay thuộc các tỉnh Vĩnh Phú, Hoàng Liên Sơn, Sơn La...). Cuối năm Đinh mùi 1427 ông cùng Trịnh Khả đánh tan viện binh của Mộc Thạnh ở ải Lê Hoa, từ đó quân Minh bắt đầu tan rã. Sau khi chống ngoại xâm thành công (1428) ông được phong Thái bảo theo họ vua. Năm 1429 tấn phong ông tước Huyện Thượng Hầu, Thái phó, ông đứng vào hàng thứ ba công thần. Nhưng không bao lâu bọn nịnh thần tố cáo ông mưu phản, ông phải tự sát. Đến đời Lê Thánh tông triều đình mới phục danh dự cho ông, truy phong là Thái bảo, tước Thắng Quận Công."
  },
  {
    "name": "Trần Lựu",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Thuộc Minh",
    "home": "Thanh Hóa",
    "desc": "Danh tướng trong cuộc khởi nghĩa Lam Sơn, không rõ năm sinh năm mất. Con nghĩa sĩ Trần Lượng đời Hậu Trần. Quê xã Lỗ Tự, huyện Thụy Nguyên (nay thuộc huyện Thiệu Hóa, tỉnhThanh Hóa) được theo họ vua Lê, nên cũng gọi là Lê Lựu. Cha ông giúp vua Trần Trùng Quang chống giặc Minh và hi sinh. Về sau ông tham gia khởi nghĩa Lam Sơn ngay từ buổi đầu hội thề ở Lũng Nhai. Ông chỉ huy đội quân thiết, đội hoạt động ở Nghệ An, nổi tiếng trong nhiều trận đánh lớn. Cuối năm 1426, ông cùng Lê Bôi, Trịnh Khả, giải phóng các vùng Hồng Châu Bắc Giang, Lạng Giang, Lạng Sơn, rồi được phong làm Tổng tri Hồng Châu kiêm tri An Bang (1427). Sau đó, ông nhận lệnh điều động quân sĩ chặn viện binh của Liễu Thăng nơi Lạng Giang. Ông đưa quân đi, một mặt giả thua để nhử Liễu Thăng đuổi theo, một mặt phục binh nơi Chi Lăng, kết liễu cuộc đời tướng giặc tại đấy trong ngày 20-9 âm lịch Đinh mùi 1427, lập nên kì tích Chi Lăng. Khởi nghĩa thành công, năm 1426, ông được dự vào bậc công thần đệ nhất phong làm Trấn viễn đại tướng quân tước Thượng Trí Tự. Khi ông mất, được truy phong Trung Dũng Hầu. Tại xã Lỗ Tự có đền thờ ông."
  },
  {
    "name": "Xa Khả Tham",
    "otherName": "Xa Kha Sâm",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Thuộc Minh",
    "home": "Không rõ",
    "desc": "Cũng gọi là Xa Kha Sâm, Danh tướng trong cuộc khởi nghĩa Lam Sơn, không rõ năm sinh năm mất. Ông vốn là Tù trưởng người Thái, Mộc Châu, khi giặc Minh sang cướp phá, ông điều động dân quân chống cự quyết liệt. Năm Ất tị 1425, nhóm nghĩa quân của ông mở rộng địa bàn chiến đấu khắp vùng Gia Hưng (Sơn La, Lai Châu và một phần Hà Sơn Bình). Giữa năm 1425 ông kết hợp với nghĩa quân Lam Sơn, cùng sát cánh với chiến hữu Trịnh Khả, Phạm Văn Xảo giải phóng miền Tây Bắc. Ngoài ra, ông còn vận động nhân dân tiếp tế lương thực, voi, ngựa cho Bình Định vương Lê Lợi. Năm Mậu thân 1428 khởi nghĩa thành công ông được phong là Nhập nội Tư không, Đổng bình chương sự, tri Đà Giang trấn thượng (quản lí vùng đất thượng lưu sông Đà)."
  },
  {
    "name": "Bồi Liễn Tiên Nương",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Triều Lê Sơ",
    "home": "Không rõ",
    "desc": "Nhân vật thần kì trong thời vua Lê Thánh tông. Tương truyền: Một hôm Lê Thánh tông đi thăm nhà Thái học và qua chùa Ngọc Hồ ở thôn Thanh Ngô (nay là chùa Bà Ngô ở phố Sinh Từ), thấy một ni cô trẻ đẹp liền rẽ vào vãn cảnh. Ni cô biết ý, viết hai câu dâng trình: Vào chùa mến cảnh mến thầy Tuy vui đạo Phật chưa khuây lòng người. Lê Thánh tông làm ngay một bài thơ, trao Thân Nhân Trung đưa lại ni cô: Ngẫm sự trần duyên khéo nực cười Sắc không tuy vội hẩy lòng người Chày kình một tiếng tan niềm tục, Hồn bướm ba canh lẫn sự đời... Ni cô chê hai câu tam tứ và chữa lại: Gió thông đưa kệ tan niềm tục. Hồn bướm mơ tiên lẫn sự đời Vua phục có tài, vời lên xe về cung, nhưng vừa đến cửa Đại Hưng (cửa nam kinh thành) ni cô biến mất. Lê Thánh tông sai làm một cái lầu ở trong vườn ngư, gọi là lầu vọng tiên. Không ai rõ danh hiệu ni cô, nhân sự tích theo xe vua về cung nên gọi là Bồi Liễn tiên nương."
  },
  {
    "name": "Bùi Cầm Hổ",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Triều Lê Sơ",
    "home": "Hà Tĩnh",
    "desc": "Danh thần đời Lê Thái tông, không rõ năm sinh, năm mất, quê làng Đỗ Liêu, tục gọi làng Treo, huyện Thiên Lộc (sau đổi là Can Lộc), tỉnh Hà Tĩnh. Nguyên thân phụ ông nằm mộng thấy một con hổ gầm ở sân, giật mình tỉnh dậy thì vừa lúc thân mẫu ông hạ sinh ông, mới đặt tên là Cầm Hổ. Năm Thiệu Bình 1 (Giáp dần 1434), ông được bổ làm Ngư sử trung thừa. Tính ông cương trực, dám nói thẳng, không kiêng nể những kẻ quyền thế. Gặp việc đáng khuyên ngăn vua, ông vẫn thẳng thắn vạch trần việc xấu. Lúc đại thần Lê Sát nắm giữ triều chính, ỷ thế lộng hành, ông dâng sớ công kích; do đấy ông bị đổi lên Lạng Sơn làm An phủ sứ. Đến khi Lê Sát bị hạ bệ, ông được triệu về kinh làm Đô ngự sử như cũ. Năm Thiệu Bình 5 (Mậu ngọ 1438) mùa đông, ông sung chức phó sứ sang nhà Minh trình bày những việc xảy ra ở địa phương Thái Bình. Đời Nhân tông, năm Thái Hòa 1 (Quí hợi 1443), ông kiêm lĩnh chức Đông Tây đạo rồi thăng Tham tri chính sự. ít lâu thì mất. Tương truyền: Lúc còn du học, một hôm có người lái buôn ở xa về, người vợ nấu canh lươn cho chồng ăn, ăn xong thì chết ngay. Bởi lươn giống như rắn, con nào đầu trắng thì có độc, có thể giết người. Người vợ lái buôn bị quan sở tại buộc tội giết chồng, ông đã biện bạch oan tình và gỡ tội được. Triều đình nghe biết, vời ông ra làm quan. Gần nhà ông ở dãy núi Hồng Lĩnh, ông có đào một con kênh dẫn nước vào ruộng được nghìn khoảnh. Dân chúng cảm đức, sau khi ông mất, có lập đền thờ ông ở dưới núi Bạch Cao. Các triều vua đều gia phong ông làm phúc thần. Sách Thiên Nam bảo lục diễn ca đề cao ông: \"Cầm Hổ cương trực, Bất tị cường hào, Tạc khê quán mẫu, Từ trì Bạch Cao\" Nghĩa: Bùi Cầm Hổ cư quan chính trực, Chẳng kinh gì những bậc thếquyền. Kênh đào tưới ruộng hơn nghìn, Để ân Hồng Lĩnh, dựng đền Bạch Cao. Trong Kiển văn tiểu lục, Lê Quí Đôn có lời phẩm bình: \"Hồi Lê sơ, vì sau khi loạn lạc, nho sĩ thưa thớt. Người đem thân chầu chực trong triều đường Nguyễn Thiên Tích, Bùi Cầm Hổ, phần nhiều bộc lộ chí khí sáng suốt, có những lời nói quả cảm\"."
  },
  {
    "name": "Lưu Xuân Tín",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Triều Lê Sơ",
    "home": "Hưng Yên",
    "desc": "Danh thần đời Lê Thánh tông, không rõ năm sinh năm mất, quê làng Châu Khen, huyện Đông An, tỉnh Hưng Yên, nay là huyện Châu Giang, tỉnh Hưng Yên. Ông làm quan và sống dưới triều vua Lê Thánh tông được nhà vua giao cho việc đúc tiền: ông có sáng kiến đúc các thoi vàng và thoi bạc để dùng vào việc thương mại, thay cho việc trao đổi bằng hiện vật trên thị trường, rất bất lợi cho việc giao lưu hàng hóa. Do đó, ông được nhà vua giao cho chức Công bộ thượng thư trông nom về tài chánh. Lúc ông mất, nhà vua sai quan địa phương lập đền thờ ông ở quê nhà. Có thể nói ông là chuyên viên tài chánh, tiền tệ đầu tiên của nước ta."
  },
  {
    "name": "Lý Tử Tấn",
    "otherName": "Chuyết Am",
    "bornYear": "1378",
    "deathYear": "1454",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Triều Lê Sơ",
    "home": "Hà Tây",
    "desc": "Danh sĩ, tác giả đời Lê sơ, Nguyên tên là Tấn, hiệu Chuyết Am, quê làng Triều Đông, huyện Thượng Phúc (nay thuộc tỉnh Hà Tây). Năm Canh thìn 1400 ông đỗ thái học sinh (tiến sĩ) đời nhà Hồ. Đến khi cuộc khởi nghĩa Lm Sơn thành công, ông vào yết kiến Lê Thái tổ, được nạp dụng. Làm quan qua ba triều vua, trải các chức Thông phụng đại phu, Hành khiển bắc đạo, Thừa chỉ Viện Hàn lâm, vào hầu giảng ở tòa Kinh diên. Tài đức ông, sĩ phu đều trọng vọng. Năm Giáp tuất 1454 ông mất, thọ 76 tuổi (có sách ghi mất năm 1457) còn để lại tác phẩm Chuyết Am thi tập. Ông cũng có làm lời thông luận cho bộ Dư địa chí của Nguyễn Trãi, hiệu chính và phê điểm trong bộ Việt âm thi tập. Bộ Chuyết Am thi tập của ông nay không còn, nhưng trong Toàn Viêt thi lục của Lê Quí Đôn còn ghi 73 bài thơ của ông. Trong Quần hiền phú còn ghi 5 bài phú của ông, được ca tụng là bài Phú Xương Giang. Bộ Chuyết Trai văn tập do ông soạn. Về sách này Phan Huy Chú cho rằng thơ Lý Tử Tấn bình đạm, nhiều ý cổ và trích một số bài trong sách mình (PHC). Về thơ Lý Tử Tấn sách Việt âm thi tập có ghi ở mục lục là quyển 4 có 30 bài, Toàn Việt thi lục (quyển 7) chép 72 bài của Lý Tử Tấn, Hoàng Việt thi tuyển trích 8 bài."
  },
  {
    "name": "Mạc Bang Hộ",
    "otherName": "Võ Hộ",
    "bornYear": "1481",
    "deathYear": "1534",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Triều Lê Sơ",
    "home": "Không rõ",
    "desc": "Võ tướng đời Lê Chiêu tông, sau theo nhà Mạc. Họ tên chính của ông là Võ Hộ, khi theo giúp Mạc Đăng Dung dựng nên nhà Mạc, đổi tên là Mạc Bang Hộ, quê xã Cung Hiệp, huyện Nghi Dương. Ông là em rể Mạc Đăng Dung, tài gồm văn võ, tự là Trung Phụ. Từ năm Đinh mão 1507 ông làm Hiệu úy coi đoàn quân túc vệ. Ít lâu ông làm thuộc tướng của Mạc Đăng Dung, lập nhiều công trạng trong quân được thăng đến Tà đô đốc và được ban hiệu Đồng đức công thần. Năm Canh thìn 1520, Võ Nghiêm Uy nổi loạn ở Đại Đồng, ông nhận lịnh đi đánh dẹp được yên, lãnh chức Tổng trấn Đại Đồng, tước Quỳnh Khê Bá, rồi tiến phong Quỳnh Khê Hầu. Tuy là tôi nhà Lê, nhưng ông ngầm giúp Mặc Đăng Dung nhiều hơn. Năm Ất dậu 1525 ông làm Tả đô đốc Tây quân, phong Đồng đức Tán tn công thần, Thiếu bảo, tước Từ Quận Công. Năm Đinh hợi 1527 Mạc Đăng Dung cướp ngôi vua, nắm quyền nước, phong ông làm Tĩnh Quốc Công. Từ đấy ông đổi họ theo nhà Mạc, mang tên Mạc Bang Hộ, quyền uy tột bậc, càng lúc càng được nhà Mạc trọng đãi. Năm Giáp ngọ 1534, tháng 9 âm lịch ông mất, hưởng hương 53 tuổi, thụy là Đảng Lượng."
  },
  {
    "name": "Nghiêm Bá Ký",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "1530",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Triều Lê Sơ",
    "home": "Bắc Ninh",
    "desc": "Văn thần đời Lê Chiêu tông. Quê huyện Yên Phong, tỉnh Bắc Ninh. Ông có tài đức, từng giữ chức vụ cao trong triều, tước Bình Minh Bá. Năm Đinh hợi 1527, Mạc Đăng Dung cướp quyền vua Lê, ông vẫn trung thành với nhà Hậu Lê. Năm Quang Thiệu 5 (Canh thân 1530) ông lãnh mật chiếu Cần vương, phát động quân sĩ chống nhà Mạc. Thất trận, thua to, ông chạy đến châu Văn Uyên, tỉnh Lạng Sơn, rút gươm tự tử sau khi chết được xưng tụng tiết nghĩa."
  },
  {
    "name": "Nghiêm Hiến",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Triều Lê Sơ",
    "home": "Bắc Ninh",
    "desc": "Võ tướng đời Lê Hiển tông, không rõ năm sinh, năm mất, quê ở Đông Ngạn, tỉnh Bắc Ninh. Ông làm quan Điền bạ, có nghĩa khí, tiết tháo hơn người. Ông cùng với quan Chấp Kim ngô là Phương Đình Pháp đều là thị thần của vua Lê. Năm Bính ngọ 1786, một hôm có vị Thượng công - em chúa Trịnh - đến hầu, mặc giáp đeo gươm mà vào, ai cũng cho là nguy hiểm, có vẻ lo sợ. Khi đó quanh vua chỉ có ông và Phương Đình Pháp bảo vệ ông cùng Phương ung dung cầm gươm vàng bước xuống thềm tuyên mạng: - Đây là thềm son chỗ thiên tử ngự! Xin tướng quân cởi giáp. Thượng công theo lời bỏ gươm, rồi mới lên thềm bái yết. Tâu trình xong, khi ra khỏi điện Thượng công rất trọng phong cách Nghiêm, Phương, cho rằng triều đình còn có người."
  },
  {
    "name": "Nghiêm Ích Khiêm",
    "otherName": "Không rõ",
    "bornYear": "1459",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Triều Lê Sơ",
    "home": "Bắc Ninh",
    "desc": "Võ tướng đời Lê Thánh tông, quê làng Lan Độ, huyện Đông Ngạn, tỉnh Bắc Ninh. Ông nổi tiếng thơ văn, có sức mạnh và thông hiểu binh pháp, tài gồm văn võ. Năm Canh tuất 1490 ông đỗ tiến sĩ, 31 tuổi. Làm quan trong triều được ít lâu, cải qua chức võ, thăng Cẩm y vệ Đô chỉ huy sứ. Anh ông là Nghiêm Công Phụ cũng đỗ tiến sĩ, làm quan đồng triều, tài đức được sĩ phu trọng vọng."
  },
  {
    "name": "Nghiêm Viến",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Triều Lê Sơ",
    "home": "Bắc Ninh",
    "desc": "Danh thần đời Lê Thánh tông, không rõ năm sinh năm mất, quê làng Bồng Lai, huyện Quế Dương, tỉnh Bắc Ninh. Lúc còn nhỏ ông đã có tài, hoc rộng, gần xa đều biết tiếng. Năm Bính thìn 1496, ông đỗ đệ nhất giáp tiến sĩ, đệ nhất danh (trạng nguyên), được vua gả công chúa cho. Tương truyền khoa này, văn bài của ông và Nguyễn Huân ngang nhau. Nguyễn Huân cũng người tỉnh Bắc Ninh, từ thi Hương đến thi Hội đều đỗ đầu, danh tiếng có phần hơn ông. Nhưng vua Lê nằm mộng thấy \"cọp ăn đầu người\", ứng vào tên ông, chữ Hán viết với bộ \"khuyển\", nên lấy ông đỗ Trạng nguyên và đổi tên ông chữ Hán viết với bộ \"Ngọc\". Ông tuy được làm Phò mã, nhưng về sau quan chức không lớn, còn Nguyễn Huân làm đến Thượng thư bộ Lễ, Thái bảo quận công."
  },
  {
    "name": "Ngô Chi Lan",
    "otherName": "Nguyễn Hạ Huệ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Triều Lê Sơ",
    "home": "Hà Nội",
    "desc": "Nữ sĩ đời Lê Thánh tông, không rõ năm sinh, năm mất. Còn có tên khác nữa là Nguyễn Hạ Huệ, quê làng Phù Lê, huyện Kim Anh (nay thuộc Hà Nội). Bà nổi tiếng thơ văn. Chồng là danh sĩ Phù Thúc Hoành, quê ở làng Phù Xá. Vợ chồng bà đều được vua Lê và các danh sĩ đương thời trọng vọng. Bà từng được phong là Phù Gia nữ học sĩ, đảm đương việc dạy đạo đức nghi lễ, và truyền đạt văn hóa cho các cung nhân. Tương truyền bà có soạn tập thơ Mai trang tập, nhưng đã thất truyền. Nay chỉ còn lại 9 bài thơ chép ở các sách Trích diễm thi tập, Truyền kì mạn lục, Kiến văn tiểu lục, Lĩnh Nam chích quái. ấy là các bài: - Thái liên khúc (Khúc hát hái sen, chữ Hán) - Bốn bài thơ vịnh 4 mùa, cả chữ Hán lẫn Nôm. - Thơ vịnh Phù Đổng thiên vương, núi Vệ Linh. - Thơ vịnh truyện Tô Vũ (chữ Nôm)."
  },
  {
    "name": "Ngô Hoán",
    "otherName": "Không rõ",
    "bornYear": "1460",
    "deathYear": "1528",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Triều Lê Sơ",
    "home": "Hải Dương",
    "desc": "Văn thần đời Lê Thánh tông, quê làng Thượng Đáp, huyện Thanh Lâm, tỉnh Hải Dương. Năm Canh tuất 1490 ông đỗ bảng nhãn, 30 tuổi, làm Hiệu thư trong tòa Đông các và dự vào số 28 người trong Tao đàn do Thánh tông thành lập. Phục vụ trải 4 triều vua, ông làm đến Thượng thư bộ Lại. Năm Đinh hợi 1527, Mạc Đăng Dung cướp ngôi, ông theo Lê Chiêu tông chống lại binh bại phải chạy đến châu Lang Chánh, vua tôi định sang nước Ai Lao (Lào) để mưu việc khôi phục. Nhưng ông tuổi đã cao, sức yếu, thắt cổ tự tử ở mạn nguợc vào năm Mậu tí 1528, thọ 68 tưổi. Nhà Lê trung hưng, ông được truy tặng Suy trung công thần, gia phong làm Phúc thần."
  },
  {
    "name": "Ngô Sĩ Liên",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Triều Lê Sơ",
    "home": "Hà Tây",
    "desc": "Danh sĩ, sử gia đời Lê Thái tông, (1443-1459) không rõ năm sinh, năm mất, quê xã Chúc Lý, huyện Chương Đức, tỉnh Hà Đông (nay là Chương Mĩ tỉnh Hà Tây). Năm Mậu tuất 1442 ông đỗ tiến sĩ, làm Tả thị lang bộ Lễ, rồi giữ việc biên soạn sử sách ở Viện Hàn lâm. Sau làm đến Đô ngự sử, thọ khoảng 98 tuổi. Trong đời Lê Thánh tông ông làm việc ở Viện Quốc sử, khoảng năm Tân hợi 1479, ông soạn xong bộ Đại Việt sử kí toàn thư viết bài tựa và dâng lên vua ngự lãm. Bộ sách gổm 15 quyển chia làm hai phần: 1. Ngoại kỉ từ Hùng Vương đến năm 938, gồm 5 quyển. 2. Bản kỉ từ đời Ngô Quyền đến Lê Thái tổ lên ngôi (939-1428) 10 quyển. Đại Việt sử kí toàn thư là một trong vài sử phẩm ra đời sớm nhất trong khoa học lịch sử nước ta. Tác phẩm đã có một chỗ đứng xứng đáng trong thư tịch Việt Nam. Đại Việt sử kí toàn thư (15 quyển) Ngô Sĩ Liên biên soạn; sách này lấy hai bộ sử của Lê Văn Hưu và Phan Phu Tiên tham khảo thêm các sách dã sử, biên tập thành sách này; lại thêm vào một quyển Ngoại kỉ, để tên Triệu Vũ đế kỉ, còn 24 điều (phàm lệ) của sách. Về sách Sử kí toàn thư hay Đại Việt sử kí toàn thư này, kể cả Ngoại kỉ, phần riêng của Ngô Sĩ Liên, sách chép bắt đầu từ đời Hồng Bàng thị, qua Thục An Dương vương trở xuống đến mãi khi người Minh trở về nước. Đó là nội dung bộ sử này ngay sau khi Ngô Sĩ Liên biên soạn xong năm Hồng Đức thứ 10 (1479). Phan Huy Chú không chua gì khác hơn lời Lê Quí Đôn, nhưng có trích lục nguyên văn bài tựa và bài biểu dâng sách của Ngô Sĩ Liên (năm 1479) và cũng chua tiếp sau như Lê Quí Đôn là sách có 24 điều phàm lệ nhưng không ghi lại 24 điều phàm lệ ấy là những gì. Hiện nay chúng ta, ngoài bộ sử Cương mục triều Nguyễn, còn có được hai bộ sử cũ lớn đã khắc in, một bộ gọi là Đại Việt sử kí toàn thư của Ngô Sĩ Liên, một bộ gọi là Đại Việt sử kí tiền biên, do triều Tây Sơn khắc in, bộ nào cũng tập hợp cả các sách sử cũ và các sử viết sau Ngô Sĩ Liên, gồm có nhiều phần. Riêng bộ Đại Việt sử kí toàn thư, có ba bản in khác nhau, hai bản in trong nước, một bản in ở nước ngoài (Nhật Bản): a) Sách mộc bản của ta khắc in cuối triều Lê (năm 1697). b) Sách in bản chữ chì ở Nhật Bản, là sách in lại bản sách của ta (năm 1884). c) Sách mộc bản do triều Tây Sơn khắc in. Bản này tên đề hơi khác: Đại Việt sử kí tiền biên, chỉ còn đến quyển 10, chép đến hết tiền biên, nhưng trái lại, nội dung có nhiều điểm lại đay đủ hơn hẳn bản trên."
  },
  {
    "name": "Ngô Thị Ngọc Dao",
    "otherName": "Không rõ",
    "bornYear": "1421",
    "deathYear": "1496",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Triều Lê Sơ",
    "home": "Thanh Hóa",
    "desc": "Thái phi, vợ Lê Thái tông, mẹ Thánh tông, cháu nội của Thái phó Ngô Kinh, con Thái bảo Ngô Từ. Quê xa Động Bàng, huyện An Định (nay thuộc huyện Triệu Yên, tỉnh Thanh Hóa). Nhân người chị của bà tên Xuân là cung tần của Lê Thái tông, bà theo chị vào nội đình, nên được Thái tông tuyền làm cung tần. Năm Canh thân 1440, Thái tông sách phong bà làm Tiệp dư ở cung Khánh Phương. Khi bà có thai, nằm mộng thấy thượng đế cho kim đổng giáng sinh, vì thế bị hoàng phi Nguyễn Thị Anh ghen ghét vu hãm buộc tội. May nhờ Nguyễn Trãi và Nguyễn Thị Lộ binh vực che chở, bà mới khỏi phải phát lưu và chỉ bị giam ở chùa Hoa Văn (trong khu vực kinh thành). Sau, bà sinh con trai đặt tên là Lê Tư Thành, rồi vì sợ hoàng phi Nguyễn Thị Anh tiếp tục ám hại, bà ôm con trốn biệt ra miền An Bang (nay là Quảng Yên). Đến khi Nguyễn phi có con là Bang Cơ được lên ngôi tức Nhân tông, Nguyễn phi tức Tuyên từ thái hậu mới ăn năn cho người tìm mẹ con bà về Kinh, phục vị cũ cho bà là Tiệp dư và phong cho Tư Thành làm Bình Nguyên vương, sau đổi là Gia vương. Năm Kỉ mão 1459, Lạng Sơn vương Lê Nghi Dân mưu giết Nhân tông, tự lập làm vua chẳng bao lâu thì bị lật đổ, con bà là Gia vương Tư Thành được lên ngôi tức Thánh tông, bà nghiễm nhiên là Quang Thục hoàng thái hậu. Thánh tông sai dựng Thuần Mậu Đường để thờ tổ tiên bà."
  },
  {
    "name": "Ngô Từ",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Triều Lê Sơ",
    "home": "Thanh Hóa",
    "desc": "Cha ruột Quang Thục hoàng thái hậu Ngô Thị Ngọc Dao, không rõ năm sinh, năm mất, cha vợ vua Lê Thái tông, ông ngoại Thánh tông. Quê xã Động Bàng, huyện An Định, 1ộ Thanh Hoa (nay thuộc huyện Triệu Yên, tỉnh Thanh Hóa). Thân phụ ông là Ngô Kinh, xuất thân nghèo khổ, nên cha ông từng làm người giúp việc của Lê Khoáng (cha Lê Lợi) còn ông thì theo hầu Lê Lợi. Đến khi cuộc khởi nghĩa Lam Sơn phát động, Lê Lợi được tôn làm minh chủ tức Bình Định vương, cha con ông tận tụy theo phục vụ, phụ trách trang trại sản xuất lương thực quân nhu và tiếp nhận người đến tham gia khởi nghĩa. Đuổi xong giặc Minh, Lê Lợi lên ngôi tức Lê Thái tổ phong cho cha ông làm Thái phó, ông là Thái bảo. Về sau con gái ông là Ngô Thị Ngọc Dao được tuyển vào cung làm Tiệp dư, hầu hạ Lê Thái tông, sinh hoàng tử Tư Thành. Đến khi Tư Thành lên ngôi tức Lê Thánh tông, con gái ông là Hoàng thái hậu, có xây dựng tòa đền đặt tên là Thuần Mậu Đường để thờ phụng tổ tiên họ Ngô."
  },
  {
    "name": "Nguyễn Anh Võ",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Triều Lê Sơ",
    "home": "Hà Tây",
    "desc": "Danh sĩ, con trai Nguyên Trãi, mẹ là Phạm Thị Mẫn, vợ thứ Nguyễn Trãi, không rõ năm sinh, năm mất. Quê làng Bối Khê, huyện Thanh Oai, tỉnh Hà Đông (nay thuộc tỉnh Hà Tây). Sau khi Lê Thái tông mất, gây ra vạ cả nhà Nguyễn Trãi bị thảm sát, một số thân quyến trốn thoát được trong đó có Anh Vũ. Nguyên Nguyễn Trãi và vợ chánh là Trần Thị Thành sinh được 3 trai: Hồng Tiệm, Hồng Lục và Hồng Quì đều bị thảm sát. Vợ thứ Nguyễn Trãi là Phạm Thị Mẫn nguời làng Thụy Tú (sau đổi là Thụy Phú), huyện Phú Xuyên, tỉnh Hà Đông. Khi gặp nạn bà đang có thai Anh Võ mới 3 tháng, bà vội vã trốn không kịp đem người con gái lớn là Nguyễn Thị Đào theo, lẩn tránh ở vùng Sơn Nam, rồi sinh ra Anh Vũ, đổi là họ Phạm trốn ở vùng Bồn Man. Sau ông lớn lên, về nương náu nhà họ ngoại ở làng Bối Khê, huyện Thanh Oai, tỉnh Hà Đông, năm 19 tuổi thi đỗ Sinh đồ (Tú tài). Năm Giáp thân 1464, vua Lê Thánh tông xuống chiếu tẩy oan cho Nguyễn Trãi và lục dụng con cháu còn sống sót. Anh Vũ ra khai nhận lấy lại họ Nguyễn, được bổ làm Tri huyện Tây Châu (sau là huyện Nam Trực, tỉnh Nam Định) và được cấp ruộng tế tự. Ông làm quan đến chức Tham chính, có hai con là Nguyễn Tô Giám và Nguyễn Tô Kiên đều đỗ Tiến sĩ."
  },
  {
    "name": "Nguyễn Bá Kí",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "1465",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Triều Lê Sơ",
    "home": "Hà Tây",
    "desc": "Danh thần đời Lê Nhân tông, quê làng Vân Nội, huyện Chương Đức, tỉnh Hà Đông (nay thuộc tỉnh Hà Tây). Năm Mậu thìn 1448, ông đỗ Hoàng giáp, làm Tri chế cáo Viện Hàn lâm, rồi thăng Trực học sĩ. Năm Nhâm thân 1452, ông sung Phó sứ sang Trung Quốc chúc mừng vua Minh lập Thái tử. Khi về làm Tả tư ở tòa Trung thư, và tòa Kinh diên, kiêm chức Thượng kị đô úy, cai quản các cuộc lễ hầu cung vua. Đời Thánh tông, ông cùng Nguyễn Trực soạn văn bia Dương lăng, rồi làm Tế tửu Quốc tử giám, kiêm Đại học sĩ điện Văn minh. Tài đức ông được vua Lê Thánh tông quí trọng ban hiệu là Vân Phong tiên sinh. Năm Ất dậu 1465 ông mất, Lê Thánh tông sai quan mang sắc đến dự tế tỏ lời tiếc thương nồng hậu. Thơ văn ông thâm trầm, trong Toàn Việt thi lục còn sao chép một số bài đề là Quá Nhuận Hồ cựu đô (Qua đô cũ nhà Hồ). Em ông là Nguyễn Bá Kì cũng là bậc đại khoa có danh tiếng đương thời."
  },
  {
    "name": "Nguyễn Bảo",
    "otherName": "Châu Khê",
    "bornYear": "1452",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Triều Lê Sơ",
    "home": "Thái Bình",
    "desc": "Danh thần đời Lê Thánh tông hiệu Châu Khê, quê xã Phượng Lai, huyện Vũ Tiên, phủ Kiến Xương, trấn Sơn Nam (nay thuộc tỉnh Thái Bình). Năm Nhâm thìn 1472 ông đỗ Tiến sĩ lúc mới 20 tuổi được đắc cử chức Thị giảng ở Đông Các. Ít lâu sau ra làm Tham nghị ở Hải Dương, sau về triều giảng sách ở Tả Xuân đường Đông cung Thái tử. Thái tử lên ngôi, tức vua Hiến tông, ông được cử làm Tả Thị lang bộ Lễ, tham dự và trông coi công việc ở Viện Hàn lâm. Vào thời gian này ông nhận việc biên soạn bài văn bia ở am Hiển Thụy trên núi Phật Tích, rồi thăng làm Thưọng thư bộ Lễ, kiêm Thị độc Hàn lâm viện. Một thời gian sau ông mất được truy tặng Thiếu Bảo. Tác phẩm chính của ông là bộ: Châu Khê thi tập (8 quyển) do học trò ông là tiến sĩ Trần Củng Uyên sưu tầm, viết tựa, biên tập. Phan Huy Chú nhận xét thơ ông cho là Lời thơ giản dị, trọng hậu, có khí cốt. Ngoài tập thơ trên thơ ông còn chép trong Toàn Việt thi lục 160 bài."
  },
  {
    "name": "Nguyễn Địch Tâm",
    "otherName": "Không rõ",
    "bornYear": "1461",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Triều Lê Sơ",
    "home": "Hà Tây",
    "desc": "Văn thần đời Lê Thánh tông, quê làng Hoàng Xá, huyện Ninh Sơn (sau đổi là Yên Sơn), trấn Sơn Tây (nay thuộc tỉnh Hà Tây). Năm Mậu tuất 1478 ông đỗ nhị giáp tiến sĩ, 17 tuổi, đồng khoa với Võ Quỳnh. Làm quan đến Thượng thư, gia phong hàm Thiếu bảo, tước An Quận Công. Ông có soạn quyển Việt sử khảo giám. Bộ Việt sử khảo giám (10 quyển) do ông biên soạn. Theo sách Đại Việt lịch triều đăng khoa lục và Đăng khoa bị khảo thì sách này nay đã thất lạc và các sách trên chỉ ghi lại nhan đề mà thôi."
  },
  {
    "name": "Nguyễn Đức Trung",
    "otherName": "Nguyễn Văn Thường",
    "bornYear": "1404",
    "deathYear": "1477",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Triều Lê Sơ",
    "home": "Nghệ An",
    "desc": "Danh tướng, đại thần, nhà doanh điền đời Lê Thánh tông (1442-1497), tiền hiền đất Quảng Nam, con trai khai quốc công thần Nguyễn Công Duẫn đời Bình Định Vương Lê Lợi. Quê xã Kì Châu, huyện Thạch Hà, đạo Thừa Tuyên Nghệ An (nay thuộc tỉnh Nghệ An). Thời niên thiếu ông theo phò vua Lê, đến đời Hồng Đức. Ông có con gái tên là Nguyễn Thị Ngọc Hằng (Ngọc Huyền) tiến cung, nên được gọi là Quốc Cữu... Ông là cao tổ của Nguyễn Hoằng Dụ, cao cao tổ của Nguyễn Kim. Chính ông là một trong những nhân vật rước lập Lê Tư Thành lên ngôi hiệu là Lê Thánh tông, làm quan tại triều đến đời Thánh tông lên đến chức Đô đốc tước Trình Quốc Công, kinh lược An Bang, trấn thủ đạo Thừa tuyên Quảng Nam. Con trai ông là Thái úy Nguyễn Văn Lang đời Lê Túc tông (1504-1505) từng là Thủy quân vệ chỉ huy sứ. Trong Gia phả Nguyễn tộc tại Tam Kì - Quảng Nam ghi rõ: \"... Ngài Công Duẫn sinh ra Thái bảo Quận công Nguyễn Đức Trung, ngài (NĐT) vào đất Quảng cho lập làng Ngọc Thọ và cư ngụ ấp Thọ Tân, làng Ngọc Thọ, tổng Phước Lợi Trung, huyện Lễ Dương, phủ Thăng Hoa, tỉnh Quảng Nam.\" Và trong bài Siêu kì phố ý cũng nói qua vị cao tổ Nguyễn tộc: \"Dòng chánh của cố Nguyễn Đức Trung (Nguyễn Văn Thường)... họp cùng nhau lớn nhỏ nam nữ trong bổn tộc cầu khẩn Lôi ti độ người chết, che chở kẻ sống (...) Thế năm nay ngày lành tháng tốt giúp cho bổn tộc lo việc kì an siêu độ cầu cứu thiên linh thương nhớ là hiền khảo tổ Nguyễn Đức Trung (...) Cúi xin hương hồn chư vị tiếp nhận lễ nghi đàn tràng này mà hướng tới bậc cao hơn là Thỉ tổ Nguyễn đại nhơn\". Ông mất năm Đinh dậu 1477."
  },
  {
    "name": "Nguyễn Giản Thanh",
    "otherName": "Nguyễn Giản Liêm - Cự Nguyên - Phác Hiên - Trạng Me",
    "bornYear": "1481",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Triều Lê Sơ",
    "home": "Bắc Ninh",
    "desc": "Danh sĩ đời Lê Uy Mục, con tiến sĩ Nguyễn Giản Liêm, tự Cự Nguyên, hiệu Phác Hiên, quê làng Ông Mặc, sau đổi là Hương Mặc (tục gọi làng Me), huyện Đông Ngạn, tỉnh Bắc Ninh (nay thuộc huyện Tiên Sơn, tỉnh Bắc Ninh). Ông là học trò danh sĩ Đàm Thận Huy, năm Mậu thìn 1508 ông đỗ đầu nhất giáp tiến sĩ (trạng nguyên) lúc 27 tuổi. Người đỗ kế (Bảng nhãn) là Hứa Tam Tĩnh, người làng Như Nguyệt (tục gọi làng Ngọt), nên có câu ca dao \"Trạng Me đè Trạng Ngọt\". Ông làm quan đến Thị thư Viện Hàn lâm kiêm Đông các Đại học sĩ. Khi nhà Mạc dấy lên, ông lại làm quan với nhà Mạc đến Thượng thư bộ Lễ kiêm Thị độc Viện Hàn lâm, coi sóc việc trong viện, tước Trung Phụ Bá, rồi tiến tước Hầu. Nhiều lần ông đi sứ Trung Quốc. Ông có soạn bộ sách: - Thương Côn châu ngọc, tập hợp thơ vịnh sử của nhiều nhà thơ ta và Trung Quốc. Bài phú Phụng Thành Xuân sắc (Cảnh sắc mùa xuân ở thành Phụng tức thành Thăng Long) của ông nổi tiếng trong lịch sử văn học Việt Nam. Bộ Thương Côn châu ngọc tập (5 quyển) do ông soạn và biên tập, Phan Huy Chú đọc tập này cho rằng \"Chọn các bài thơ của các danh gia Nam (Việt Nam) Bắc (Trung Quốc) sắp đặt theo từng loại là công của Nguyễn Giản Thanh đậu Trạng nguyên đời Đoan Khánh\"."
  },
  {
    "name": "Nguyễn Hãng",
    "otherName": "Nại Hiên",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Triều Lê Sơ",
    "home": "Phú Thọ",
    "desc": "Danh sĩ đời Lê Tương Dực, hiệu là Nại Hiên, không rõ năm sinh, năm mất, quê làng Xuân Lũng, phủ Lâm Thao, trấn Sơn Tây (Phú Thọ - nay là Vĩnh Phú). Ông đỗ hương tiến, khi Mạc Đăng Dung chuyên quyền, ông bỏ quan, ở ẩn nơi Đại Đồng, thuộc huyện Yên Bình, tỉnh Tuyên Quang. Nhà Mạc nhiều phen vời ông ra làm quan nhưng ông từ chối. Nhà Lê Trung hưng, phong tặng ông là Thảo mao dật sĩ (Nguời học trò ẩn dật nơi nhà tranh). Khi ông mất, quê ông làng Xuân Lang có đền thờ ông gọi là Dật Sĩ từ. Những bài phú của ông còn truyền tụng: - Tịnh cư ninh thê - Đại Đồng phong cảnh - Tam nguy động"
  },
  {
    "name": "Nguyễn Lí",
    "otherName": "Không rõ",
    "bornYear": "Không rõ",
    "deathYear": "Không rõ",
    "father": "Không rõ",
    "mother": "Không rõ",
    "dynasty": "Triều Lê Sơ",
    "home": "Thanh Hóa",
    "desc": "Võ tướng đời Lê Thái tổ, không rõ năm sinh năm mất quê huyện Thụy Nguyên, tỉnh Thanh Hóa. Ông vốn họ Nguyễn, Bình Định vương Lê Lợi cho đổi sang họ Lê. Ông chiến đấu kiên cường lập nhiều chiến công trong cuộc chống quân Minh xâm lược. Năm Canh tuất 1430, ông được phong tước Hương Thượng Hầu, nhưng đến đời Thái tông, bị Lê Sát chèn ép, ông phải ra làm Đô thống quản ở lộ Thanh Hoa. Sau được triệu về triều làm Thái úy, kiêm Tây đạo chư vệ quân, được ít lâu thì mất tại chức. Đến đời Thánh tông (1497) được truy tặng là Thái sư, tước Dũ Quốc Công. Đời nhà Nguyễn, vua Gia Long liệt ông vào hàng công thần đệ nhị triều Lê, cho người trong họ ông giữ việc tế tự."
  }
]