[
  {
    "name": "An Duong Vuong",
    "otherName": "Thuc Phan",
    "bornYear": "khong ro",
    "deathYear": "208 TCN / 179 TCN1",
    "father": "Thuc Che (theo truyen thuyet)2",
    "dynasty": "Tan",
    "home": "Ha Noi",
    "desc": "An Duong Vuong (chu Han: 安陽王), ten that la Thuc Phan (蜀泮), la mot vi vua da lap nen dat nuoc Au Lac va cung la vi vua duy nhat cai tri nha nuoc nay. Au Lac la nha nuoc thu hai trong lich su Viet Nam sau nha nuoc Van Lang dau tien cua cac vua Hung. Nien dai tri vi cua An Duong Vuong duoc cac tai lieu ghi khac nhau. Su cu nhu Dai Viet su ky toan thu, Kham dinh Viet su thong giam cuong muc cho rang thoi gian ong lam vua keo dai 50 nam, tu 257 TCN den 208 TCN3 . Cac su gia hien dai can cu vao Su ky Tu Ma Thien la tai lieu gan thoi dai nuoc Au Lac nhat, cho rang An Duong Vuong va nuoc Au Lac ton tai tu khoang 208 TCN den 179 TCN, tuc la gan 30 nam4 .   Cung ton tai o vung Bac Bo Viet Nam va phia Tay tinh Quang Tay (Trung Quoc) vao thoi ky Hong Bang, co cac bo toc Au Viet song xen ke voi nguoi Lac Viet. Hai bo lac nay tu lau da co quan he gan gui voi nhau. Nha nuoc Van Lang do Hung Vuong dung dau cai tri Lac Viet. Thuc Phan, nguoi Au Viet, la vua nguoi Au Viet da danh bai Hung Vuong vua nuoc Van Lang doi quoc hieu thanh Au Lac, tu xung la An Duong Vuong, dong do tai Phong Khe (nay la vung Co Loa, huyen Dong Anh-Ha Noi). Ca dao: Co gia thuyet cho rang gia dinh Thuc Phan la hau due cua cac vua Khai Minh nuoc Thuc thoi Chien Quoc, chay ve phia Nam de tranh bao loan vao cuoi thoi Chien Quoc va khi nha Tan noi len. Thuc Phan da den vung lanh tho cua nguoi Au Viet (nay la phia Tay va Nam tinh Quang Tay, Trung Quoc va dong bac Viet Nam) gay dung luc luong quan su tai day. Sach \"Nguoc dong lich su\" cua GS Tran Quoc Vuong cho rang sau khi nuoc Thuc bi Tan diet, con nho vua Thuc la Thuc Che duoc lap len ngoi, luu vong ve phia dong nam. Tuy nhien qua the he Thuc Che van phai lan tron truoc su truy na cua Tan va khong co co hoi khoi phuc nuoc Thuc cu. Cuoi cung toi con Thuc Che la Thuc Phan thi hinh thanh quoc gia nam o phia bac nuoc Van Lang cua ho Hong Bang. Tuy nhien, gia thuyet nay bi nhieu nha nghien cuu nghi ngo. Khoang cach tu Tu Xuyen toi mien Bac Viet Nam la khoang 3.000 km*, va khoang thoi gian tu khi nuoc Thuc bi Tan diet (316 TCN) den khi An Duong Vuong len ngoi o Viet Nam (257 TCN) la gan 60 nam. Trong thoi gian ngan nhu vay, kho co chuyen dong doi vua Thuc co the di cu xa toi 3.000 km, vuot qua nhieu doi nui hiem tro de toi lap quoc o mien Bac Viet Nam. Moi gia thuyet neu tren deu co nhung cho dang ngo va cho dang ngo chung la: Cho toi dau cong nguyen thoi Hai Ba Trung, nguoi Bach Viet van chua co ho. Do do ho Thuc cua An Duong Vuong la mot van de nghi van, khong ro day co phai ten ho do doi sau gan cho An Duong Vuong hay khong. Bo su lau doi nhat va gan thoi An Duong Vuong nhat la Su ky Tu Ma Thien chi nhac toi nuoc Au Lac5 ma khong nhac toi An Duong Vuong hay ho Thuc. Tuu trung, ca hai thuyet deu chua duoc chung minh bang cac di tich khao co hoac van tu ghi chep lai. Song co the khang dinh: An Duong Vuong la lanh dao nguoi Au Viet dong o phia bac nuoc Van Lang. Sau mot thoi gian, ong da lanh dao nguoi Au Viet tieu diet nuoc Van Lang, thong nhat ca hai nhom Au Viet va Lac Viet duoi 1 quoc gia, day chinh la to tien cua nguoi Kinh o Viet Nam ngay nay. Dai Viet Su ky Toan thu chep: Hung Vuong co nguoi con gai nhan sac tuyet voi ten goi la My Nuong. Vua nuoc Thuc nghe tin, sai su cau hon. Vua Hung muon ga nhung Lac Hau can rang: Thuc muon lay nuoc ta, chi muon tieng cau hon do thoi. Khong lay duoc My Nuong, Thuc Vuong cam gian, dan lai con chau phai diet Van Lang ma chiem lay nuoc. Doi chau Thuc Vuong la Thuc Phan may lan dem quan sang danh nuoc Van Lang. Nhung Hung Vuong co tuong si gioi, da danh bai quan Thuc. Hung Vuong noi: Ta co suc than, nuoc Thuc khong so hay sao? Ben chi say sua yen tiec khong lo viec binh bi. Boi the, khi quan Thuc lai keo sang danh nuoc Van Lang, vua Hung con trong con say. Quan Thuc den gan, vua Hung tro tay khong kip phai bo chay roi nhay xuong song tu tu. Tuong si dau hang. The la nuoc Van Lang mat. Giap Thin, nam thu 1 [257 TCN], vua da thon tinh duoc nuoc Van Lang, doi quoc hieu la Au Lac6 Bo may nha nuoc cua nuoc Au Lac khong co nhieu thay doi so voi bo may nha nuoc thoi Van Lang. Dung dau trong bo may hanh chinh o trung uong van la Vua va Lac Hau Lac Tuong. Dung dau cac bo van la Lac Tuong. Dung dau cac chieng, cha van la Bo chinh. Tuy nhien, o thoi An Duong Vuong quyen hanh cua nha nuoc cao hon va chat che hon. Vua co quyen the hon trong viec cai tri dat nuoc. Cung thoi ky nay, ben Trung Hoa, Tan Thuy Hoang sap nhap 6 nuoc sau nhieu nam hon chien thoi Chien Quoc. Ong tiep tuc tham vong xam chiem Bach Viet, vung dat dai cua cac bo toc Viet o phia nam Trung Quoc va bac Viet Nam ngay nay. Dao quan xam luoc nha Tan do Do Thu chi huy da danh chiem nhieu vung dat cua Bach Viet, nhap vao lanh tho Trung Hoa. Khi vao lanh tho phia Dong Bac nuoc Au Lac, quan Tan gap phai cuoc khang chien truong ki cua nguoi Viet do Thuc Phan chi huy. Theo cuon Lich su Viet Nam (Vien su hoc, 1991): Nam 218 truoc cong nguyen, Tan Thuy Hoang huy dong 50 van quan chia lam 5 dao di chinh phuc Bach Viet. De tien xuong mien Nam, di sau vao dat Viet, dao quan thu nhat phai dao con kenh noi song Luong (vung An Hung, Trung Quoc ngay nay) de cho luong thuc. Nho vay, Do Thu thong linh da vao duoc dat Tay Au, giet tu truong, chiem dat roi tien vao Lac Viet. Thuc Phan duoc cac Lac tuong suy ton lam lanh tu chung chi huy cuoc khang chien nay. Khi Do Thu dem quan tien sau vao dat Lac Viet, Thuc Phan lanh dao nhan dan chong giac. Quan Tan di den dau, nhan dan Viet lam vuon khong nha trong den do. Quan Tan dan lam vao tinh trang thieu luong thuc tram trong. Khi quan Tan da kiet suc, vi thieu luong, thi quan dan Viet, do Thuc Phan chi huy, moi bat dau xuat tran. Do Thu da phai bo mang trong tran nay. Mat chu tuong, quan Tan hoang mang mo duong thao chay ve nuoc. Sau gan 10 nam khang chien, nhan dan Au Viet-Lac Viet gianh duoc doc lap. Thuc Phan cung co va xay dung lai dat nuoc7 . Con theo sach Dai Viet su ky toan thu, quyen 2 thi: dao thu nhat cua quan Tan da di bang thuyen nho theo song Ta Giang, tu Ninh Minh len Thuy Khau, Ta Lung den Cao Binh. Thuc Phan sai tuong Ly Binh phuc quan o doan Hat Gia, khi quan Tan tien den cho nay, bi quan Thuc tha go, nem da, phong lao, ban ten xuong thuyen lam cho giac bi thuong, bi chet vo so ke. Lai nghe tin vua Tan Thuy Hoang da chet, tuong Do Thu hoang hot, ben cho rut quan. O khu vuc Hat Gia hien nay, nguoi dan da tinh co phat hien ra mui ten dong co mot nganh da han ri o bai cat Sooc Luong hay mot so kim khi o Sooc Lac. Tuy nhien, de tim thay hien vat minh chung ve cac su kien lich su lien quan den Thuc Phan o Cao Bang phai tien hanh cac buoc nghiep vu khao sat thuc dia sau hon. Sau chien thang truoc quan Tan, An Duong Vuong quyet dinh giao cho tuong Cao Lo xay thanh Co Loa nham cung co them kha nang phong thu quan su. Tuc truyen rang thanh xay nhieu lan nhung deu do. Sau co than Kim Quy hien len, bo quanh bo lai nhieu vong duoi chan thanh. Thuc An Duong Vuong ben cho xay theo dau chan Rua vang. Tu do, thanh xay khong do nua. An Duong Vuong cung phat trien thuy binh va cho che tao nhieu vu khi loi hai, tao loi the quan su vung chac cho Co Loa. Di tich cua thanh Co Loa van con luu lai cho den nay, cach trung tam Ha Noi khoang 20 km ve phia dong bac. Den tho An Duong Vuong nam o trung tam di tich nay. Cac nghien cuu khao co hoc tai day van tiep tuc lam sang to cac thoi ky lich su ma thanh da trai qua. It lau sau, Trieu Da tu quan Nam Hai (Quang Dong bay gio) sang danh Au Lac. Nho vao chuan bi quan su tot, An Duong Vuong da chong cu duoc hieu qua. Trieu Da buoc phai dung ke noi gian bang cuoc ket hon giua con trai minh, Trong Thuy, va con gai An Duong Vuong la My Chau. Sau khi nam duoc bi mat quan su cua An Duong Vuong thong qua con trai, Trieu Da da thanh cong trong viec chinh phuc Au Lac, buoc An Duong Vuong bo chay va tu tu, ket thuc thoi ky An Duong Vuong. Ve nam mat cua trieu dai An Duong Vuong, cac tai lieu ghi chep khac nhau. Da phan sach su Viet Nam (Dai Viet Su ky Toan thu, Kham dinh Viet su Thong giam Cuong muc, Viet su Tieu an) deu chep la An Duong Vuong mat nuoc nam 208 TCN. Sach giao khoa cua Viet Nam can cu vao Su Ky cua Tu Ma Thien ghi nuoc Au Lac mat nam 179 TCN. So di nhu vay vi Su Ky chep la Trieu Da diet nuoc Au Lac \"Sau khi La Hau chet\", ma La Hau chet nam 180 TCN, do do nuoc Au Lac mat khoang nam 179 TCN. Truyen thuyet An Duong Vuong, No Than, va con trai Trieu Da la Trong Thuy o re nuoc Viet co nhieu cho khong hop voi Su Ky cua Tu Ma Thien, mac dau Su Ky la nguon tu lieu som nhat ma cac nha viet su Viet Nam co duoc de tham khao. Sach Kham dinh Viet su Thong giam Cuong muc chep dan theo sach Thai binh hoan vu ky, phan Nam Viet chi cua Nhac Su nha Tong: An Duong Vuong cai tri Giao Chau, Uy Da dem quan sang danh. An Duong Vuong co Cao Thong (Cao Lo) giup do, che ra cai no, ban mot phat giet chet quan [Nam] Viet hang van nguoi, ban ba phat giet den ba van. Trieu Da biet ro duyen co, lien lui ve dong o Vu Ninh, roi cho con la Trong Thuy sang lam tin, xin hoa hao voi nhau. Ve sau, An Duong Vuong doi xu voi Cao Thong khong duoc hau, Cao Thong bo di. An Duong Vuong co nguoi con gai la My Chau, thay Trong Thuy dep trai, lien phai long. Ve sau, Trong Thuy du do My Chau doi xem no than, My Chau dem cho xem. Trong Thuy nhan day be hong cai lay no, roi lap tuc sai nguoi ruoi ve bao tin cho Trieu Da. Trieu Da lai dem quan sang danh up. Khi quan Trieu keo den, An Duong Vuong dem no ra ban nhu truoc, nhung no hong roi! Quan Thuc chay tan tac. Trieu Da pha duoc Thuc. Ngay nay, mau truyen lich su nay da duoc liet vao mot trong nhung dang chien tranh gian diep rat som cua lich su Viet Nam. The ngoc \"An Duong hanh bao\" duoc tim thay o thanh pho Quang Chau thuoc lanh tho nuoc Nam Viet thoi co. The ngoc co hinh dang gan chu nhat, bon goc the khac bon chu \"安陽行寶\"8 (An Duong hanh bao), kho chu to hon kho chu phia trong mat the gom 124 chu loi co truu. Ban khac toan van sau muoi (Giap Ty), (60 chu can chi). Xung quanh trang tri khac duong van song luon. Do bi chon lau ngay duoi dat nen mau vang hoi hung hung do. Mat trai the trang tri duong cong hinh moc cau. Net cham tren the ngoc An Duong tho.9 Nha nghien cuu \"So gian\" Du Duy Cuong o thanh pho Truong Sa, tinh Ho Nam, Trung Quoc cho rang: \"Ngoc bao An Duong nay la cua An Duong co dai Viet Nam. An Duong hanh bao co lo deo, day la loai ngoc phien nguoi xua deo lam vat bau ho than, tru ta de duoc an lanh\". The ngoc nay dao duoc o phia Dong Nam cach thanh pho Quang Chau 18km o tren ha luu song Viet Giang do mot nong dan khi cuoc dat dao duoc o suon nui nam 1932. Nhung the ngoc dao duoc o Quang Chau khoang 200 the, trong do co the ngoc khac chu An Duong. Khi Nam Viet danh bai Au Lac, cac bau vat cua Au Lac la chien loi pham nen moi dao duoc o Quang Chau.10 (Nguon: Wikipedia) "
  },
  {
    "name": "Au Co",
    "otherName": "Au Co",
    "bornYear": "?",
    "deathYear": "?",
    "father": "De Lai (?)",
    "mother": "Khong ro",
    "dynasty": "Tran",
    "desc": "Au Co (chu Han: 嫗姬), hay phien am Au Co, la mot nhan vat trong truyen thuyet Viet Nam, theo do ba la to mau cua nguoi Viet. Cau chuyen cua ba cung Lac Long Quan duoc ghi lai nhu mot truyen thuyet, than thoai trong chuong dau tien Linh Nam chich quai. Truyen thuyet nay lan dau duoc xem nhu chinh su va ghi lai nhu mot ban ky trong Dai Viet su ky toan thu thoi Hau Le, mot viec hoan toan khong co trong cuon su co hon la Dai Viet su luoc thoi nha Tran.   Ten goi cua Au Co hoan toan khong phai ten nguoi that su, ma no giong nhu mot danh hieu. Theo mat chu Han, Au la mot danh tu de chi mot nguoi me hoac cach goi thuong dung de chi dan ba, con gai nhu Lao au (老嫗; ba gia)1 hoac Thieu au (少嫗; co gai tre)2 . Dieu nay cung duoc kiem chung boi cach goi Ba Trieu la Trieu Au trong cac ghi chep. Con chu Co ban dau la ho cua cac Thien tu nha Chu, ve sau nhung nhan vat nhu Ha Co-co gai ho Co, lay chong ho Ha da tao nen mot nhat thuc chu nay dung de goi cac thieu nu hoac phu nu noi chung, tro thanh mot trao luu ton tai thoi Tien Tan va nhung thoi ky dau cua nha Han. Ngoai ra, chu Co cung thuong dung kem theo voi y nghia co gai nay la ca ky hoac thiep cua mot nguoi quyen quy (dieu nay giai thich vi sao trong Linh Nam chich quai cung ghi nhan Au Co la thiep cua De Lai). Sach Linh Nam chich quai co le la van ban som nhat ghi chep chuyen ve Au Co3 , duoc ghi trong thien Hong Bang Thi truyen (鴻龐氏傳) ngay phan dau tien. Tuong truyen, Au Co la con gai cua De Lai, nhung lai co thuyet ghi ngay trong do rang co la thiep cua De Lai4 . Trong khi di tuan thu phuong Nam, ong da de Au Co lai tren mot cai dong. Dan phuong Nam kho vi bi nguoi Bac phuong quay nhieu, khong duoc yen song nhu xua moi cung goi Long Quan rang: \"Bo oi o dau ma de cho dan Bac xam nhieu phuong dan\". Khi Lac Long Quan di den day, thay Au Co xinh dep nen da dem long yeu men. Ong ben hoa thanh mot trang thieu nien phong tu tu le, ta huu ke hau nguoi ha dong duc, vua di vua ca hat danh trong. Cung dien tu nhien dung len. Au Co thay the vui mung e then, ben bang long cung Lac Long quan den Long Dai, sinh song cung nhau. De Lai tro ve, khong thay Au Co, sai quan than di tim khap thien ha. Lac Long Quan co phep than thong bien hoa thanh tram hinh van trang yeu tinh, quy su, rong, ran, ho, voi... lam cho bon di tim deu so hai khong dam suc sao, De Lai ben phai tro ve. Lau sau, Au Co de ra mot cai boc, cho la diem bat thuong ben vut ra canh dong. Sau sau bay ngay, boc vo ra mot tram qua trung, moi trung no ra mot con trai, moi dem ve nha nuoi. Khong phai bu mom, cac con tu lon len, trong dep de ky di, nguoi nao cung tri dung song toan, nguoi nguoi deu kinh trong cho la trieu phi thuong. Long Quan o lau duoi Thuy Quoc vo con thuong muon ve dat Bac. Luc nay Hoang De danh bai Xi Vuu, Au Co nho nha ben tinh dem con ve, nhung Hoang De so hai ben chan lai, khong de me con Au Co buoc qua bien gioi. Me con Au Co khong the ve duoc ben quay ve nuoc Nam ma goi Long Quan rang: \"Bo o noi nao ma de me con toi co doc, ngay dem buon kho the nay\". Long Quan bong tro ve, gap nhau o dat Tuong. Au Co noi: \"Thiep von la nguoi nuoc Bac, o voi vua, sinh ha duoc tram con trai, vua bo thiep ma di, khong cung thiep nuoi con, lam nguoi vo phu vo phu, chi biet thuong minh\". Long Quan noi: \"Ta la noi rong, dung dau thuy toc, nang la giong tien, song o tren dat, tuy khi am duong hop lai ma sinh ra con, nhung thuy hoa tuong khac, giong giong bat dong, kho o lau voi nhau duoc, nay phai chia la. Ta dem nam muoi con ve Thuy Phu chia tri cac xu, nam muoi con theo nang ve o tren dat, chia nuoc ma tri. Len nui, xuong be, huu su bao cho nhau biet, dung quen\". Tram con vang theo, sau do tu biet ma di. Au Co va nam muoi con len o dat Phong Chau suy phuc lan nhau, cung ton nguoi con ca len lam vua, hieu la Hung Vuong, lay ten nuoc la Van Lang. Do tram nguoi con trai chinh la to tien cua nguoi Bach Viet vay. Tuy nhien, Dai Viet su ky toan thu cua Ngo Si Lien gan nhu xoa di chi tiet cau chuyen trong Linh Nam chich quai, giam di cac tinh tiet va bien cau chuyen nay them phan lang man hoa. Hai vo chong Lac Long Quan va Au Co da gap nhau kha van tat, ca hai ket hon va song voi nhau va sinh ra cai boc tram trung, no ra 100 nguoi con kha em dem, khong co chi tiet ca hai da so hai va vut bo boc trung 5 . Sau do vi thuy tho tuong khac nen hai nguoi phai chia con ra 50 con theo cha ve bien, 50 con theo me ve nui va chia nhau cai quan cac vung5 . Diem khac biet rang, Ngo Si Lien da ghi Lac Long quan \"hoi cuoi\" Au Co, la mot hanh dong hop phap va co le nghi6 , trong khi Linh Nam chich quai chi ghi chep Au Co da dong y theo Long Quan sau su hoanh trang lay long nguoi dep cua ong, ma khong he ghi bat cu chu nao ve ket hon7 . Dieu nay co the giai thich rang Ngo Si Lien muon tao mot truyen thuyet quy mo ve nguon goc Dai Viet khi ay, sau mot thoi gian bi nha Minh do ho, nen nhu cau thiet yeu khi ay la mot nen tang ve mot quoc gia doc lap, bao gom ca truyen thuyet. Nhu vay, ong da dung cach Tu Ma Thien ghi chep nhung vi vua chua huyen thoai cua Trung Hoa trong bo Su ky, de tao nen mot doan truong ca lich su nhuom mau hu cau rat ro rang. Trong cac truyen thuyet pho cap o van hoa Viet Nam hien dai, Au Co la mot nang tien xinh dep song o tren nhung ngon nui cao. Va viec ba ket hon voi Lac Long quan la giong rong, sinh ra 100 nguoi con da bien dan Viet thanh Con rong chau Tien. Theo truyen thuyet pho bien nhat, Au Co la mot tien nu, con gai mot vi than nui nao do ma khong phai la De Lai cua Than Nong Thi. Nang di khap bon phuong de giup do va chua tri cho nhung nguoi dang lam benh va gap kho khan. Nang co long tu bi va co tai ve y thuat. Mot ngay no, mot con quai vat lam nang so hai. Nang lien bien thanh mot con seu ma bay di. Lac Long Quan, la than rong tu bien ca, thay nang dang gap nguy hiem lien cam lay cuc da va giet ten quai vat Sau do tinh yeu da nay no giua hai nguoi va ho cuoi nhau. Au Co sinh ra mot boc trung co 100 nguoi con. Mot ngay no, Lac Long Quan noi voi nang vi hai nguoi den tu chung toc va moi truong rat khac nhau nen khong the chung song voi nhau tron doi duoc. Ho ben chia nhau moi nguoi 50 dua con, 50 theo me, 50 theo bo. 50 nguoi con theo me di den o Phong Chau, nguoi anh ca tro thanh vua Hung Vuong cua nuoc Van Lang.8 Tuy nhien, ve mat ghi chep van ban, xuat than cua Au Co gan nhu thong nhat nhung ghi chep co tu Linh Nam chich quai. Sach Viet Nam su luoc cua Tran Trong Kim cung khong he ghi nhan ve xuat than nang tien nay cua Au Co. Nhu vay, viec Au Co la tien co le chi ton tai nhung thap ki rat gan day, nhung khong the xac dinh cu the, nhung cuon sach cua cac hoc gia nuoc ngoai cung co nien dai kha gan va da chiu nhieu nhung bien doi ve nhan thuc cua nguoi Viet Nam hien dai. (Nguon: Wikipedia) "
  },
  {
    "name": "Ba Trieu",
    "otherName": "Trieu Au",
    "bornYear": "Nam 225 Yen Dinh, Thanh Hoa",
    "deathYear": "Nam 248 Hau Loc, Thanh Hoa",
    "dynasty": "Nguyen",
    "home": "Thanh Hoa",
    "desc": "Ba Trieu (chu Han: 趙婆), con duoc goi la Trieu Au (趙嫗), Trieu Trinh Nuong (趙貞娘), Trieu Thi Trinh (趙氏貞), Trieu Quoc Trinh (225-248), la mot trong nhung vi anh hung dan toc trong lich su Viet Nam. Su gia Ngo Si Lien o the ky 15 viet: Su nha Nguyen o the ky 19 cung da chep:   Nam 226, Si Nhiep mat, vua Dong Ngo la Ton Quyen ben chia dat tu Hop Pho ve bac thuoc Quang Chau dung Lu Dai lam thu su; tu Hop Pho ve nam la Giao Chau, sai Dai Luong lam thai thu; va sai Tran Thi lam thai thu quan Giao Chi. Luc bay gio, con cua Si Nhiep la Si Huy tu noi ngoi va xung la thai thu, lien dem binh chong lai. Thu su Lu Dai ben xua quan sang danh dep. Do nghe loi chieu du, Sy Huy cung nam anh em ra hang. Lu Dai giet chet Huy, con may anh em thi dem ve dat Ngo lam toi. Du dang cua Sy Huy tiep tuc chong lai, khien Lu Dai mang quan vao Cuu Chan giet hai mot luc hang van nguoi. Ba Trieu sinh nam Binh Ngo (226)3 tai mien nui Quan Yen (hay Quan Yen), quan Cuu Chan, nay thuoc lang Quan Yen (hay con goi la Yen Thon), xa Dinh Tien, huyen Yen Dinh, tinh Thanh Hoa. Thuo nho cha me deu mat som, Ba Trieu den o voi anh la Trieu Quoc Dat, mot hao truong4 o Quan Yen. Lon len, ba la nguoi co suc manh, gioi vo nghe, lai co chi lon. Den do 20 tuoi gap phai nguoi chi dau (vo ong Dat) ac nghiet 5 , ba giet chi dau roi vao o trong nui Nua (nay thuoc cac xa Tan Ninh huyen Trieu Son, Mau Lam huyen Nhu Thanh, Trung Thanh huyen Nong Cong, Thanh Hoa), chieu mo duoc hon ngan trang si. Nam Mau Thin (248), thay quan lai nha Dong Ngo (Trung Quoc) tan ac, dan kho so, Ba Trieu ben ban voi anh viec khoi binh chong lai. Luc dau, anh ba khong tan thanh nhung sau chiu nghe theo y kien cua em. Tu hai can cu nui vung Nua va Yen Dinh, hai anh em ba dan quan danh chiem quan ly Tu Pho6 nam o vi tri huu ngan song Ma. Day la can cu quan su lon cua quan quan nha Dong Ngo tren dat Cuu Chan, dung dau la Tiet Kinh Han. Thua thang, luc luong nghia quan chuyen huong xuong hoat dong o vung dong bang con song nay. Dang luc ay, Trieu Quoc Dat lam benh qua doi.7 Cac nghia binh thay ba lam tuong co can dam, ben ton len lam chu. Khi ra tran, Ba Trieu mac ao giap vang, di guoc nga, cai tram vang, cuoi voi8 va duoc ton la Nhuy Kieu tuong quan. Duoc tin cuoc khoi nghia lan nhanh9 , vua Ngo la Ton Quyen lien phai tuong Luc Dan (chau cua Luc Ton), sang lam thu su Giao Chau, An Nam hieu uy, dem theo 8.000 quan sang dan ap cuoc khoi nghia. Den noi, tuong Luc Dan lien dung cua cai mua chuoc mot so lanh tu dia phuong de lam suy yeu va chia re luc luong nghia quan. Nhung tran danh ac liet da dien ra tai can cu Bo Dien10 . Song do chenh lech ve luc luong va khong co su ho tro cua cac phong trao dau tranh khac nen can cu Bo Dien bi bao vay co lap, va chi dung vung duoc trong hon hai thang. Theo Tran Trong Kim trong Viet Nam su luoc, ba chong do voi quan Dong Ngo duoc nam sau thang thi thua. Ba Trieu da tuan tiet tren nui Tung (xa Trieu Loc, huyen Hau Loc, Thanh Hoa) vao nam Mau Thin (248), luc moi 23 tuoi. Co giai thoai noi rang tuong giac loi dung viec phan nu nhi da truat bo y phuc tren nguoi khien Ba Trieu tu do xau ho ma dan den tu tu. Nuoc Viet lai bi nha Dong Ngo do ho cho den 265.11 Nam 19 tuoi, dap loi nguoi hoi ba ve viec chong con, Ba Trieu noi: Ve sau vua Ly Nam De (tuc Ly Bi) khen Ba Trieu la nguoi trung dung sai lap mieu tho, phong la: \"Bac chinh anh liet hung tai trinh nhat phu nhan\". Hien nay, noi nui Tung (xa Trieu Loc), van con di tich lang mo cua ba. Cach noi ba mat khong xa, tren nui Gai ngay sat quoc lo 1A (doan di qua thon Phu Dien, xa Trieu Loc, cach thanh pho Thanh Hoa 18 km ve phia Bac) la den tho ba. Hang nam, vao ngay 21 thang 2 (am lich), nguoi dan trong vung van to chuc te gio ba. Tai nhieu tinh thanh trong nuoc Viet Nam, ten ba cung da duoc dung de dat ten cho nhieu truong hoc va duong pho; rieng tai Ha Noi, co mot con duong mang ten pho Ba Trieu. Trong Dai Nam quoc su dien ca, co doan Ba Trieu Au danh Ngo, khai quat rat sinh dong: Tuong truyen quan Ngo khiep uy dung cua Ba Trieu nen co cau: Trong dan gian hien cung con truyen tung nhieu cau tho ca va cau doi lien quan den ba nhu sau: Ngoai ra, trong Hong Duc quoc am thi tap, va trong cac tap tho cua cac danh si nhu Nguyen Don Phuc, Nguyen Don Du...deu co tho khen ngoi Ba Trieu. Lau nay su sach deu bien chep cuoc khoi nghia Ba Trieu that bai, va ba da tu van nam 248. Tuy nhien, GS. Le Manh That da dan Thien Nam ngu luc va Nguy chi de ket luan rang Ba Trieu da khong thua boi tay Luc Dan, trai lai da danh bai vien tuong nay. Luc Dan chi chiem duoc vung dat nay thuoc Quang Tay. Va Ba Trieu da giu duoc doc lap cho dat nuoc den khi Dang Tuan duoc Ton Huu sai sang danh Giao Chi vao nam 257.13 Tuy nhien, y kien moi me nay con phai duoc su dong thuan cua nhieu nguoi trong gioi. Nhung bo su co chi goi ba la Trieu nu (co gai Trieu), Trieu Au. Nhung ten goi Trieu Trinh Nuong, Trieu Thi Trinh, Trieu Quoc Trinh... theo Van Lang thi ro rang la moi dat gan day. Tac gia cho biet van de ten goi nay (cung nhu ten goi cua Ba Trung) thuoc pham tru ngon ngu Viet co va cach dat ten nguoi o thoi gian dau Cong nguyen, con dang duoc nghien cuu (tr. 33). Ngoai ra, Ba Trieu con duoc nguoi doi ton la Nhuy Kieu tuong quan (vi tuong yeu kieu) va Le Hai ba vuong (vua ba o vung bien my le).14 Rieng cai ten Trieu Au (趙嫗), thay xuat hien lan dau trong Nam Viet chi, Giao Chau ky (the ky 4, 5) roi den Thai binh hoan vu (the ky 10) chua duoi muc Quan Ninh (tuc Quan yen cu).15 Truoc day, Hong Duc quoc am thi tap, Dai Viet su ky toan thu, Thanh Hoa ki thang, Kham dinh Viet su Thong giam cuong muc... deu goi ba la Trieu Au. Sau, su gia Tran Trong Kim khi cho tai ban Viet Nam su luoc da khong giai thich ma chi ghi chu rang: Ba Trieu, cac ky xuat ban truoc de la Trieu Au. Nay xet ra nen de la Trieu Thi Chinh (tr. 52). Ke tu do co nhieu ly giai khac nhau, nhu: Sach Giao Chi chi chep: Sach Nhung trang su ve vang... giai thich: Phu nu khong lo, vu dai… la huyen thoai ve ba Me-Dat (terre-Mere, Deesse-Mere). Sau hinh tuong do duoc khoat cho bat ky mot phu nu hiet kiet nao (tr. 129). Cac tac gia sach Lich su Viet Nam (tap I) cung deu cho rang huyen thoai ve mot nguoi phu nu co \"vu dai ba thuoc\" von rat pho bien o phuong Nam, tu Hop Pho den Cuu Chan. Nhu truyen \"Tay thi phu nhan\", \"Tieu quoc phu nhan\" deu noi ho la nhung phu nu cao to va co vu dai doi ba thuoc... Co the, vi ba Trieu cung la mot nguoi phu nu kiet xuat, nen dan gian da dung hinh tuong nay khoac len cho ba (tr. 345). (Nguon: Wikipedia) "
  },
  {
    "name": "Bao Dai",
    "otherName": "Nguyen Phuc Vinh Thuy",
    "bornYear": "22 thang 10, 1913 Hue, Dai Nam, Lien bang Dong Duong",
    "deathYear": "31 thang 7, 1997 (83 tuoi) Val-de-Grace, Paris, Phap",
    "father": "Khai Dinh",
    "mother": "Tu Cung Hoang thai hau",
    "dynasty": "Nguyen",
    "home": "Hue",
    "desc": "Bao Dai (chu Han: 保大; 22 thang 10 nam 1913-31 thang 7 nam 1997), ten khai sinh: Nguyen Phuc Vinh Thuy (阮福永瑞), la vi hoang de thu 13 va la vi vua cuoi cung cua trieu dai nha Nguyen noi rieng va cua che do quan chu trong lich su Viet Nam noi chung. Tu Bao Dai chi la nien hieu cua ong, tuc le nha Nguyen cac vi Hoang de doi truoc chi giu mot nien hieu nen dan gian hay dung nien hieu de chi vi Hoang de do. Ong dong thoi cung la Hoang de cua De quoc Viet Nam (1945) va la Quoc truong cua Quoc gia Viet Nam (1949-1955).   Nguyen Phuc Vinh Thuy sinh ngay 22 thang 10 nam 19131 tai kinh thanh Hue, la con trai duy nhat cua vua Khai Dinh, me la Hoang Thi Cuc. Ve than the cua Bao Dai cho den nay van con nhieu nghi ngo, vi Khai Dinh bi mang tieng la bat luc va khong thich gan dan ba2 . Ngay 28 thang 4 nam 1922, khi duoc 9 tuoi, ong duoc xac lap lam Dong cung Hoang Thai tu3 . Ngay 15 thang 6 nam 1922, ong cung Khai Dinh lan dau sang Phap de thuong ngoan cuoc trien lam hang hoa tai Marseille, Phap. Thang 6 nam 1922, Vinh Thuy duoc vo chong cuu Kham su Trung ky la Jean Francois Eugene Charles nhan lam con nuoi va hoc o truong Lycee Condorcet roi sau o truong Sciences Po (Ecole libre des sciences politiques), Paris. Thang 2 nam 1924, ong ve nuoc de du Le tu tuan dai khanh cua Khai Dinh, den Thang 11 tro lai nuoc Phap de tiep tuc hoc. Ngay 6 thang 11 nam 1925, Khai Dinh mat, Vinh Thuy ve nuoc tho tang. Ngay 8 thang 1, khi moi 12 tuoi, Vinh Thuy duoc ton len ke vi lam hoang de ke nhiem, ong lay nien hieu Bao Dai. Thang 3 cung nam, Bao Dai tro lai Phap de tiep tuc hoc tap. Tu nien khoa 1930, Bao Dai theo hoc truong Khoa hoc Chinh tri (Sciences Po). Sau 10 nam dao tao o Phap, ngay 16 thang 8 nam 1932, Bao Dai xuong tau D Artagnan ve nuoc. Ngay 19 thang 9 nam 1932, Bao Dai ra dao du so mot tuyen cao chap chinh va khang dinh che do quan chu Dai Nam hoang trieu. Van ban nay huy bo \"Quy uoc\" ngay 16 thang 11 nam 1925 lap ra sau khi Khai Dinh mat khong lau. Bao Dai da cai cach cong viec trong trieu nhu sap xep lai viec noi chinh, hanh chinh. Ong da cho bo mot so tap tuc ma cac vua nha Nguyen truoc da bay ra nhu than dan khong phai quy lay ma co the nguoc nhin vua khi le gia toi, moi khi vao chau cac quan Tay khong phai chap tay xa lay ma chi bat tay vua, cac quan ta cung khong phai quy lay. Ngay 8 thang 4, nam 1933, Bao Dai da ban hanh mot dao du cai to noi cac, quyet dinh tu minh chap chinh va sac phong them 5 thuong thu moi xuat than tu gioi hoc gia va hanh chinh la Pham Quynh, Thai Van Toan, Ho Dac Khai, Ngo Dinh Diem va Bui Bang Doan nham thay the cac thuong thu gia yeu hoac kem nang luc Nguyen Huu Bai, Ton That Dan, Pham Lieu, Vo Liem, Vuong Tu Dai.4 Ong thanh lap Vien Dan bieu de trinh bay nguyen vong len nha vua va quan chuc bao ho Phap va cho phep Hoi dong tu van Bac Ky duoc thay mat Nam trieu trong viec hop tac voi chinh quyen bao ho, thang 12 nam 1933, Bao Dai ra Bac ky tham dan chung. Ngay 20 thang 3 nam 1934, Bao Dai lam dam cuoi voi Marie Therese Nguyen Huu Thi Lan va tan phong ba lam Nam Phuong hoang hau. Day la mot viec lam pha le boi vi ke tu khi vua Gia Long khai sang trieu Nguyen cho den vua Khai Dinh, cac vo vua chi duoc phong tuoc Hoang phi, sau khi mat moi duoc truy phong Hoang hau. Ong la nha vua dau tien thuc hien bo che do cung tan, thu phi. Cuoc hon nhan nay cung gap phai rat nhieu phan doi vi Nguyen Huu Thi Lan la nguoi Cong giao va mang quoc tich Phap. Sau khi De quoc Nhat Ban dao chinh Phap, bo may hanh chinh thuc dan Phap da tan ra, vi the viec thanh lap chinh phu moi dat ra nhu mot doi hoi cap bach va De quoc Viet Nam ra doi trong boi canh do5 . Ngay 11 thang 3 nam 1945, vua Bao Dai gap mat co van toi cao cua Nhat la dai su Yokoyama Masayuki tai dien Kien Trung de ky ban \"Tuyen cao Viet Nam doc lap\"6 , trong do tuyen bo huy bo Hoa uoc Patenotre ky voi Phap nam 1884, thong nhat Bac Ky, Trung Ky va Nam Ky. Trong tuyen bo cua Bao Dai, ong tuyen bo bai bo cac hiep uoc bao ho va bat binh dang voi Phap truoc day, tuy nhien, doan sau cua Tuyen cao duoc cai them khau hieu ve Khoi thinh vuong chung Dai Dong A cua Nhat7 : Vay Chinh phu Viet Nam mot long tin cay long thanh o Nhat Ban de quoc, quyet chi hop tac voi nuoc Nhat, dem het tai san trong nuoc de cho dat duoc muc dich nhu tren. Kham thu Ngay 7 thang 4 nam 1945, Bao Dai da ky dao du so 5 chuan y thanh phan noi cac Tran Trong Kim va ngay 12 thang 5 giai the Vien Dan bieu Trung Ky.[can dan nguon] Thang 6 nam 1945, chinh phu Tran Trong Kim dat quoc hieu la De quoc Viet Nam. Ngay 16 thang 8 nam 1945, khi De quoc Nhat Ban dau hang khoi Dong minh, Tran Trong Kim tuyen bo bao ve noi cac De quoc Viet Nam, va ngay 18 thang 8 tao ra mot Uy ban Giai phong Dan toc. Theo loi khuyen cua ong Bo truong Bo Ngoai giao, Bao Dai gui thong diep cho cac nuoc Dong Minh (Tong thong Truman, vua nuoc Anh, Thong che Tuong Gioi Thach, Tuong de Gaulle) de nghi cong nhan De quoc Viet Nam. Ngay 18 thang 8, Bao Dai gui mot thong diep den De Gaulle yeu cau cong nhan nen doc lap cua Viet Nam. Thong diep nay cho rang su doc lap cua Viet Nam \"chi co nghia la bao ve loi ich cua Phap va anh huong tinh than Phap o Dong Duong\".[can dan nguon] Tuy nhien De Gaulle du kien se hau thuan cho mot che do quan chu ma nguoi dung dau khong phai la Bao Dai, nguoi da thoa hiep voi Nhat Ban, ma la Vinh San, duoc xem nhu la mot nguoi \"Gaullist\" (nguoi ung ho nhiet tinh De Gaulle).8 Tat ca cac buc thu khac cung deu khong duoc hoi am, vi cac nuoc Dong Minh se khong cong nhan bat cu chinh phu nao do De quoc Nhat Ban thanh lap o cac vung chiem dong. Den 24 thang 8, khi cach mang thang 8 da no ra khap ca nuoc, duoc su van dong cua ong Pham Khac Hoe, Bao Dai da tra loi Hoi dong Co mat rang ong quyet dinh thoai vi \"de khong phai la mot tro ngai cho su giai phong cua dat nuoc\".9 Tu thang 3 nam 1945, Viet Nam roi vao mot tinh trang hon loan do khoang trong ve quyen luc chinh tri qua lon. Nguoi Nhat dang lo chong do cac don tan cong cua quan doi dong minh Anh-My. Ca chinh phu cua Tran Trong Kim lan trieu dinh cua Bao Dai deu khong du luc luong quan su va uy tin chinh tri de kiem soat tinh hinh. Theo Peter A. Pull, chi co Viet Minh la luc luong co to chuc duy nhat o nuoc nay co kha nang nam duoc quyen chinh tri.10 Chien tranh da lam kiet que nen kinh te, nuoc Nhat can kiet nguyen lieu nen quan Nhat chiem lay lua gao va cac san pham khac, bat dan pha lua trong day de phuc vu chien tranh, cong them thien tai, nan doi (Nan doi At Dau) da xay ra tai Bac ky va Trung ky. Nguoi ta uoc tinh rang da co khoang hai trieu nguoi chet vi nan doi nay. Ngay 17/8, quan chung Ha Noi ha co que ly, dung co do sao vang, bien cuoc mit tinh cua Tong hoi cong chuc Dong Duong ung ho vua Bao Dai thanh cuoc tuan hanh ung ho Viet Minh. Hai ngay sau, quan chung Ha Noi chiem dinh Kham sai Bac bo, thanh lap chinh quyen cach mang. Cuoc tong khoi nghia do Viet Minh lanh dao nhanh chong lan ra khap cac tinh, thanh trong ca nuoc.11 Nam 1945, Cach mang thang Tam thanh cong. Tai cac dia phuong tren ca nuoc, Viet Minh buoc chinh quyen De quoc Viet Nam giao quyen luc cho ho. Truoc tinh the do, theo loi khuyen cua quan dai than Pham Khac Hoe, Bao Dai quyet dinh thoai vi. Bao Dai khong ro phai lien lac voi ai o Ha Noi, nen gui mot dien tin toi \"Uy ban Nhan dan Cuu quoc\" o Ha Noi: \"Dap ung loi keu goi cua Uy ban, toi san sang thoai vi. Truoc gio quyet dinh nay cua lich su quoc gia, doan ket la song, chia re la chet. Toi san sang hy sinh tat ca moi quyen loi, de cho su doan ket duoc thanh tuu, va yeu cau dai dien cua Uy ban som toi Hue, de nhan ban giao.\"12 Sang ngay 23 thang 8, hai phai vien cua Viet Minh la Tran Huy Lieu va Cu Huy Can den cung dien Hue. Theo loi yeu cau cua hai ong nay, chieu ngay 30 thang 8 nam 1945, Bao Dai da doc Tuyen ngon Thoai vi truoc hang ngan nguoi tu hop truoc cua Ngo Mon va sau do trao an tin va bao kiem, quoc bao cua hoang trieu cho ong Tran Huy Lieu. Ong tro thanh \"cong dan Vinh Thuy\". Trong ban Tuyen ngon Thoai vi, ong co cau noi \"Tram muon duoc lam dan mot nuoc tu do, hon lam Vua mot nuoc no le\".13 Sau khi thoai vi, Bao Dai duoc chinh phu Viet Nam dan chu cong hoa khoan dai rat tot. Thang 9 nam 1945, Vinh Thuy duoc Chu tich Chinh phu Lam thoi nuoc Viet Nam dan chu cong hoa moi ra Ha Noi nhan chuc \"Co van toi cao Chinh phu Lam thoi Viet Nam\", ong la mot trong 7 thanh vien cua Uy ban Du thao Hien phap do Ho Chi Minh dung dau. Ngay 6 thang 1 nam 1946, Vinh Thuy duoc bau lam Dai bieu Quoc hoi khoa dau tien cua nuoc Viet Nam Dan chu Cong hoa. Ngay 16 thang 3 nam 1946, Vinh Thuy duoc cu tham gia phai doan Viet Nam Dan chu Cong hoa sang Trung Khanh tham vieng Trung Hoa. Nhung sau do ong khong tro ve nuoc, ma tach khoi doan de toi Con Minh roi Huong Cang. Tai Hong Kong, Bao Dai da tiep xuc voi nhieu gioi chinh tri, trong do co nguoi My. Dai tuong George Marshall, dai dien Hoa Ky, da dem ban giao uoc voi Bao Dai ve trinh Tong thong Harry S. Truman. Ong cung thuong lui toi cac song bac va san nhay tai Hong Kong voi cai ten \"Wang Kunney tien sinh\". Ong da nhieu lan khien cac song bac phai kinh ngac vi nhung khoan tien cuoc rat lon trong cac van bac14 Du biet viec nay nhung Ho Chi Minh van tin tuong ong, cho rang ong co ly do rieng nen khong chiu ve nuoc. Dau thang 12/1946, chinh phu con cu bac si Pham Ngoc Thach dem tien va vang qua Hong Kong cho Co van Vinh Thuy chi tieu. Den truoc thang 8/1947, tra loi phong van cua bao chi, Ho Chi Minh khong ngan ngai dap rang: \"Chung toi xa mat chu khong cach long. Chinh phu va nhan dan Viet Nam hoan toan tin tuong vao su trung thanh cua Co van Vinh Thuy hien dang o nuoc ngoai nhung van tiep tuc lam viec cho chinh phu quoc gia ma Co van van la thanh vien”15 Theo co quan tinh bao Phap thi chinh Bao Dai yeu cau duoc giup do sau khi da tieu sach tien khi o Hong Kong. Thay Bao Dai chiu nhan tien, cac phai vien Phap tiep tuc ho tro tai chinh cho ong, cu moi thang Phap lai cap cho Bao Dai 5.000 dola Hongkong. Bao Dai tro lai cuoc song xa hoa giau co. Ong mua mot toa nha rat dep theo phong cach kien truc Anh, gan bo bien Stanley Beach, thuong hay tiep khach o Causeway Bay, cho ho nghi tai Hongkong Hotel hoac o Paramount hay Saint-Francis. Ve sau, khi ban tai san rieng o Hongkong, ong duoc mot khoan tien den mot trieu dong Dong Duong. Cousseau, nguoi phu trach cap tien, noi voi nha bao Lucien Bodard: \"Toi tin sap thanh cong den noi vi Bao Dai rat can tien. Do la mot ong vua tam thuong, bi phe truat, khong co tien tieu, khong co hoai bao gi. Ong ta dang trong canh gan nhu khon cung. Thuc te do la mot cong viec khong de dang chut nao. Toi da dem den hang trieu bac, ma van khong du [...]. Tro lai voi cuoc song an choi xa lang, Bao Dai cang bi loi cuon...\"16 . It lau sau, Bao Dai ben viet thu ve nuoc xin tu chuc \"Co van toi cao\" trong chinh phu Viet Nam Dan chu Cong hoa. Nha nghien cuu Nguyen Dac Xuan nhan xet \"Bac Ho rat tin tuong co van Vinh Thuy, nhung co van Vinh Thuy von rat nhu nhuoc, khong vuot qua duoc su tung thieu ve tai chinh va cac cam bay cua mat tham Phap va cac thanh phan than Phap nen ong da bi day vao cai the phai tro lai lam bu nhin cho thuc dan Phap, phan boi lai chinh nghia cua quoc gia, chong lai khang chien giai phong dan toc, doi dau voi Chu tich Ho Chi Minh va Chinh phu da cuu mang va tin tuong ong.\".17 Dau nam 1947, D\u0027Argenlieu bi trieu hoi ve nuoc do bi nguoi Viet Nam va cac dang phai canh ta Phap cam ghet. Truoc ap luc cua cac dang phai canh ta Phap nhu Dang Cong san Phap va Dang Xa hoi Phap, Thu tuong Ramadier-mot dai bieu xa hoi chu nghia, thong bao rang chinh phu cua ong ung ho nen doc lap va thong nhat cho Viet Nam: \"Doc lap trong Lien hiep Phap [va] lien minh cua ba nuoc An Nam, neu nguoi dan An Nam mong muon no\" va Phap san sang dam phan hoa giai voi nhung dai dien chan chinh cua Viet Nam18 . De hau thuan cho Bao Dai dam phan voi Phap ve nen doc lap cua Viet Nam, cac luc luong chinh tri bao gom Cao Dai, Hoa Hao, Viet Nam Cach menh Dong minh Hoi, Dai Viet Quoc dan dang va Viet Nam Quoc dan Dang lien ket thanh lap Mat tran Thong nhat Quoc gia Lien hiep.19 Ngay sau do, Mat tran Thong nhat Quoc gia Lien hiep quyet dinh se ung ho Bao Dai dam phan voi Phap ve nen doc lap cua Viet Nam. Thang 5/1947, Mat tran Thong nhat Quoc gia Lien hiep cu phai doan den Hong Kong gap Bao Dai de thuyet phuc ong nay thanh lap mot Chinh phu Trung uong va dam phan voi Phap ve nen doc lap cua Viet Nam.20 Bao Dai duoc Mat tran Thong nhat Quoc gia Lien hiep bao gom cac luc luong chinh tri Cao Dai, Hoa Hao, Viet Nam Cach menh Dong minh Hoi, Dai Viet Quoc dan dang va Viet Nam Quoc dan Dang hau thuan.19 Day la nhung to chuc chinh tri hoac ton giao tung tham gia chinh phu Viet Nam Dan chu Cong hoa hay hop tac voi Viet Minh chong Phap nhung do xung dot voi Viet Minh nen chuyen sang ung ho Bao Dai thanh lap Quoc gia Viet Nam. Nam 1947, cuu trum mat tham Phap o Dong Duong la Cousseau da tiep xuc voi Bao Dai tai Hong Kong, ngo y moi ong ve nuoc nam quyen, hinh thanh nen \"giai phap Bao Dai\". Co y kien cho rang viec nay nham chong lai cuoc chien gianh doc lap cua phong trao Viet Minh21 , cung co y kien cho rang giai phap Bao Dai duoc dua ra nham phan ung voi xu huong quoc te trao tra doc lap cho cac thuoc dia dong thoi nham chong lai su mo rong anh huong cua chu nghia cong san tai Dong Duong22 . Con ban than Bao Dai sau nay nhan xet rang \"Cai duoc goi la giai phap Bao Dai hoa ra la giai phap cua nguoi Phap.\"23 My ung ho nguyen vong doc lap dan toc tai Dong Nam A trong do co Viet Nam, nhung voi dieu kien lanh dao cua nhung nha nuoc moi \"khong phai la nguoi cong san\", My ung ho viec thanh lap cac \"nha nuoc phi cong san\" on dinh trong khu vuc tiep giap Trung Quoc. Theo thuyet Domino, My ho tro nhung quoc gia dong minh tai Dong Nam A vi khong hai long voi dieu ma ho cho la \"luc luong cong san muon thong tri chau A duoi chieu bai dan toc\".24 Bang vien tro, My ep Phap phai nhuong bo chu nghia dan toc tai Viet Nam. Chinh sach cua My la ho tro nguoi Phap chien thang trong cuoc chien chong Viet Nam Dan chu Cong hoa, sau do se ep nguoi Phap rut lui khoi Dong Duong.25 Dap lai, phia Phap nhan dinh la My qua \"ngay tho\", va mot nguoi Phap da noi thang la \"nhung nguoi My ua lo chuyen nguoi khac, ngay tho vo phuong cuu chua, tin tuong rang khi quan doi Phap rut lui, moi nguoi se thay nen doc lap cua nguoi Viet xuat hien.\"26 Ngay 7/12/1947, tai cuoc hop tren tau chien Phap o Vinh Ha Long, Bao Dai va Phap dam phan roi ky ket Hiep uoc Vinh Ha Long. Hiep uoc the hien su dong thuan cua hai ben ve viec thanh lap Quoc gia Viet Nam tren co so nguyen tac doc lap va thong nhat cua Viet Nam trong Lien hiep Phap, mac du nghia chinh xac cua tu \"doc lap\" va cac quyen han cu the cua chinh phu moi van chua duoc xac dinh. Chinh phu hoat dong duoi mot hien chuong lam thoi, chon co vang ba soc do lam quoc ky va ban \"Thanh nien Hanh Khuc\" voi loi nhac moi lam quoc ca.27 Quoc gia Viet Nam se co mot quan doi rieng tuy nhien phai \"san sang bao ve bat cu phan nao cua Lien Hiep Phap\". Su doc lap chinh tri cua nha nuoc Quoc gia Viet Nam duoc quy dinh trong Hiep uoc Vinh Ha Long qua nho nen hiep uoc nay bi Ngo Dinh Diem va ca nhung chinh tri gia trong Mat tran Thong nhat Quoc gia Lien hiep chi trich.19 Do bi cac chinh tri gia trong Mat tran Thong nhat Quoc gia Lien hiep chi trich, Bao Dai cham dut dam phan voi Phap va di du lich chau Au trong 4 thang. Nguoi Phap cu cac nha ngoai giao theo Bao Dai de thuyet phuc ong tiep tuc dam phan va thanh lap Chinh phu. Trong cuon \"Bao Dai-hay nhung ngay cuoi cung cua vuong quoc An Nam\", Daniel Grandclement nhan xet28 : Thang 1/1948, Cao uy Phap tai Dong Duong E. Bollaert tim gap Bao Dai o Geneve, Thuy Si de thuyet phuc ong quay ve Viet Nam de tiep tuc dam phan va thanh lap Chinh phu. Bao Dai tuyen bo neu Hiep uoc Vinh Ha Long khong duoc bo sung ong se khong quay ve Viet Nam. Sau do ong di Cannes, Paris roi quay ve Hong Kong.29 Ngay 24 thang 4 nam 1948, thieu tuong Nguyen Van Xuan va Tran Van Huu cung bay toi Hong Kong de gap Bao Dai xin thanh lap Chinh phu Lam thoi cho Viet Nam, ngay 15 thang 5, Bao Dai gui thong diep cho tuong Xuan, tan thanh su thanh lap Chinh phu Trung uong Lam thoi Viet Nam do tuong Xuan dieu khien \"de giai quyet van de Viet Nam doi voi Phap va du luan Quoc te\". Ngay 5 thang 6 nam 1948, Bao Dai da gap go Cao uy Phap Bollaert o vinh Ha Long, tren chien ham Duguay Trouin, de dam phan ve nen doc lap va thong nhat cua Viet Nam. Thang 1 nam 1949, Ban tuyen ngon Viet-Phap duoc cong bo, theo do nuoc Phap cong nhan nen doc lap va thong nhat cua Viet Nam trong khuon kho cua khoi Lien hiep Phap. Viet Minh chi trich Bao Dai la xau xa, toi loi vi da lay lai tu nguoi Phap chu \"doc lap\" than ky ma Ho Chi Minh da co gang gianh giat o Fontainebleu khong duoc. Nhung nguoi Phap co tu tuong thuc dan phan doi dieu ma ho cho la su dau hang cua Bollaert, dong thoi yeu cau cat Nam Ky ra khoi phan con lai cua Viet Nam, doi dua Viet Nam quay tro lai che do Bao ho. Cac chinh tri gia o Paris ra suc tran an nhung nguoi Phap ung ho chu nghia thuc dan va dam bao voi ho rang se khong co gi thay doi-cuoc chien tranh se khong cham dut. Cac lanh tu Cong hoa Binh dan va nhieu nguoi than can voi Cong hoa Binh dan lai cho rang keo dai chien tranh se het suc co loi va da di den quyet dinh khong de cho cuoc chien tranh ket thuc som30 . Sau do Bao Dai rut lui khoi cac hoat dong chinh tri va di chau Au mot lan nua. Ngay 25/8/1948, tu Saint Germain Bao Dai bao cho E. Bollaert biet ong se khong quay ve Viet Nam neu Phap khong huy bo che do thuoc dia tai Nam Ky va trao tra Nam Ky lai cho Quoc gia Viet Nam cung nhu neu ong khong nhan duoc su dam bao cua Phap cho Viet Nam doc lap.31 Ngay 8 thang 3 nam 1949, Tong thong Phap Vincent Auriol va Cuu hoang Bao Dai da ky Hiep dinh Elysee (1949), thanh lap mot chinh quyen Viet Nam trong khoi Lien hiep Phap, goi la Quoc gia Viet Nam, dung dau la Bao Dai. Bao Dai yeu cau Phap phai trao tra Nam Ky cho Viet Nam va Phap da chap nhan yeu cau nay. Ngay 24 thang 4 nam 1949, Bao Dai ve nuoc. Hai thang sau, vao ngay 14 thang 6, Bao Dai tuyen bo tam cam quyen cho den khi to chuc duoc tong tuyen cu va tam giu danh hieu Hoang de de co mot dia vi quoc te hop phap. Ngay 20 thang 6 nam 1949, thu tuong Nguyen Van Xuan de don tu chuc, Chinh phu Lam thoi Nam phan tuyen bo giai tan. Ngay 21 thang 6, thoa uoc Elysee duoc cong bo. Cuoi thang 6 nam 1949, Viet Nam chinh thuc thong nhat duoi su quan ly cua Quoc gia Viet Nam.19 Phap chuyen giao nhung chuc nang hanh chinh cho Quoc gia Viet Nam mot cach cham chap, hai chuc nang quan trong nhat va tai chinh va quan doi thi van phu thuoc vao Phap. Ngay 1 thang 7 nam 1949, Chinh phu Lam thoi cua Quoc gia Viet Nam duoc thanh lap theo sac lenh so 1-CP cua thu tuong, tan phong Bao Dai la Quoc truong, trung tuong Nguyen Van Xuan lam Thu tuong kiem Tong truong Quoc phong32 (Co tai lieu ghi Bao Dai la Quoc truong kiem Thu tuong, Nguyen Van Xuan la pho Thu tuong kiem Tong truong Quoc phong33 ). Theo danh gia cua nguoi My, Bao Dai it tham gia vao cong viec cua chinh phu, gianh nhieu thoi gian cho nghi mat34 . Thang 1 nam 1950, Bao Dai chi dinh Nguyen Phan Long lam Thu tuong. Ngay 27 thang 4 nam 1950, giai tan chinh phu Nguyen Phan Long va uy nhiem Thu hien Tran Van Huu thanh lap chinh phu moi. Tinh den dau nam 1950, co 35 quoc gia cong nhan Quoc gia Viet Nam.35 Tu thang 6 cho den thang 10 nam 1950, Quoc gia Viet Nam va Phap hop tai Pau (Phap) de ban ve viec chuyen giao cac chuc nang quan ly xuat nhap canh, quan he ngoai giao, ngoai thuong, hai quan va tai chinh cho Quoc gia Viet Nam. Tai chinh la van de gay nhieu tranh cai nhat bao gom viec kiem soat loi nhuan tu hoat dong ngoai hoi. Ket qua tat ca cac chuc nang tren da duoc Phap chuyen giao cho Quoc gia Viet Nam. Thu tuong Quoc gia Viet Nam Tran Van Huu sau khi ky thoa thuan voi Phap da tuyen bo: \"Nen doc lap cua chung toi hien nay that tuyet voi\". Cac quan chuc Phap phan nan ve Bao Dai: \"Ong ay tap trung qua muc vao viec lay lai tu chung toi nhung gi co the thay vi tim kiem su ung ho tu nhan dan... Lich su se phan xet ong ay vi qua chu tam vao chuyen nay\". Tuy nhien nguoi Phap van danh cho minh quyen quan sat va can thiep doi voi nhung van de lien quan den toan bo Lien Hiep Phap. Nguoi Phap con co quyen tiep can moi thong tin nha nuoc, tham du vao tat ca cac quyet dinh cua chinh phu va nhan mot khoan nho tu loi tuc quoc gia cua Viet Nam.19 Ngay 8/12/1950, Quoc gia Viet Nam va Phap ky Hiep dinh quan su thanh lap Quan doi Quoc gia Viet Nam bang cach dat mot so don vi quan doi Phap tai Viet Nam duoi quyen chi huy cua Quoc gia Viet Nam. Du kien quan doi nay se bao gom 120.000 quan va 4.000 si quan. Tat ca si quan deu phai la nguoi Viet.36 Phap co trach nhiem ho tro Quoc gia Viet Nam thanh lap nhung don vi moi do si quan Viet Nam chi huy va dao tao si quan nguoi Viet thay the dan nhung si quan Phap dang hien dien trong Quan doi Quoc gia Viet Nam. Nha su hoc Spencer C. Tucker cho rang Quan doi Quoc gia Viet Nam duoc huan luyen kem va khong co si quan chi huy cap cao nguoi Viet, Phap chi don gian la dua nhung nguoi linh moi tuyen mo duoc vao cac quan doan Vien chinh cua chinh Phap, tai do, nguoi chi huy la cac si quan Phap.8 Archimedes L.A Patti nhan xet: \"Tat nhien ho (Quoc gia Viet Nam) da lam, khong bao gio Phap cho Viet Nam doc lap de mat Dong Duong. Bao Dai tro ve Viet Nam va cho rang ong ta da lam het suc minh de nguoi Phap phai giu loi cam ket. Ong se cho va xem. Co the nguoi My se khich le giup do. Nhung sau mot ngay o Sai Gon, thay Phap tu choi khong cho ong su dung dinh Norodom, tru so chinh quyen thuoc dia Phap, Bao Dai lien rut lui ve nha o Da Lat. Su viec nay cho thay ro tinh hinh chang co gi thay doi ca\".37 Tuong Georges Revers, Tong Tham muu truong quan doi Phap, duoc phai sang Viet Nam de nghien cuu tinh hinh (thang 5, 6 nam 1949) va sau do da viet: \"Ho Chi Minh da co kha nang chong cu lai voi su can thiep cua Phap lau den nhu the, chinh la vi nha lanh dao Viet Minh da biet tap hop chung quanh minh mot nhom nhung nguoi thuc su co nang luc… Nguoc lai, Bao Dai da co mot chinh phu gom do 20 dai bieu cua toan cac dang phai ma, trong so do dang manh nhat cung kho ma dem duoc 25 dang vien\"38 . Nguoi Phap tri hoan mot cach co tinh toan viec thi hanh thoa hiep Elysee voi Quoc gia Viet Nam. Quan doi cua ho tiep tuc tham chien tai Viet Nam, nhan vien hanh chinh tiep tuc lam viec o cac cap chinh quyen; Quoc gia Viet Nam chang duoc trao cho mot chut quyen hanh thuc su nao, nhu bay gio nguoi ta noi, Quoc gia Viet Nam chi la mot su nguy trang cho nen cai tri cua Phap.39 . Chinh phu do Tran Van Huu lam Thu tuong ton tai den ngay 6 thang 6 nam 1952 thi phai cao lui, nhuong cho cho Nguyen Van Tam len lam thu tuong cung thanh phan tong, bo truong da so la nguoi do Phap dao tao. Ngay 20 thang 11 nam 1953, hoang than Buu Loc tu Phap ve Sai Gon lap chinh phu thay the chinh phu Nguyen Van Tam. Thoi gian nay, Quoc truong Bao Dai song va lam viec tai biet dien o Da Lat. Xung quanh noi o cua Bao Dai co ca mot trung doan Ngu lam quan bao ve va co ca mot doan xe rieng goi la \"cong xa biet dien\", lai co ca mot doi may bay rieng do cac phi cong nguoi Phap lai phuc vu. Ngay 11 thang 1 nam 1954, Chinh phu moi do Buu Loc thanh lap trinh dien Bao Dai nhung den ngay 16 thang 6 nam 1954, Buu Loc tu chuc. Quoc truong Bao Dai moi Ngo Dinh Diem ve nuoc, ngay 6 thang 7, Ngo Dinh Diem thanh lap chinh phu moi. Sau Hiep dinh Geneve 1954, Phap phai rut khoi Dong Duong, chinh quyen va quan doi Quoc gia Viet Nam tap ket o mien Nam Viet Nam cho tong tuyen cu de thong nhat Viet Nam. Ngo Dinh Diem tien hanh cai to chinh phu lan thu nhat vao ngay 24 thang 9 nam 1954 va lan thu hai vao ngay 10 thang 5 nam 1955. Thang 9 nam 1954, tuong Nguyen Van Hinh khong chiu duoi quyen chi huy cua Ngo Dinh Diem nen danh dien sang Phap nho Bao Dai can thiep. Bao Dai dien ve Sai Gon trieu tap Diem sang Cannes gap Bao Dai de ban lai viec sap xep nhan su nhung Diem khong di. Bao Dai quyet dinh dien ve Sai Gon cach chuc thu tuong cua Ngo Dinh Diem. Tuy nhien, ngay 4 thang 10 nam 1955, Uy ban trung cau dan y thanh lap dua y kien doi truat phe Quoc truong Bao Dai va dua Thu tuong Ngo Dinh Diem len lam Quoc truong. Khi cu tri di den noi bo phieu, ho thay rang noi day da bi nhung nguoi ung ho Ngo Dinh Diem kiem soat. Mot cu tri sau khi bo phieu da noi rang \"Nguoi chi dao noi cho chung toi hieu rang o day chi co hai su lua chon, hoac la phieu do (Ngo Dinh Diem) se duoc bo vao hom phieu hoac phieu xanh se bi loai di\".40 Ve phia Bao Dai, ngay 18/10/1955, ong dua ra tuyen bo cat chuc Thu tuong cung nhu xoa bo moi quyen luc cua Ngo Dinh Diem tu van phong cua minh tai Paris de phan doi mot chinh phu cong an tri va che do doc tai ca nhan do Ngo Dinh Diem dung dau.41 Ong song tai Cannes, sau do chuyen den vung Alsace. Bao Dai giao du voi Jean de Beaumont, cuu nghi si Nam Ky, mot tay san ban co hang. Bi co quan thue de mat toi, khong con tien tai tro cua chinh phu Phap, ong phai ban dan tai san cua minh. Nam 1963, Nam Phuong hoang hau qua doi o Chabrignac. Nam 1972, khi da tieu pha het ca tai san, Bao Dai song voi Monique Baudot, mot phu nu Phap kem Bao Dai hon 30 tuoi (Monique Baudot sinh nam 1946), den nam 1982 thi ket hon. Bao Dai nhap dao Cong giao lay ten thanh la Jean-Robert. Trong thoi gian nay, anh huong cua Bao Dai tai cac khu vuc nhu Quang Tri va Thua Thien-Hue van con rat lon. Chinh vi vay phia Viet Nam Dan chu Cong hoa da phai cac dai dien sang Phap nham thuyet phuc Bao Dai tham gia mot chinh phu lien hiep nham thong nhat Viet Nam, nho do thong qua Bao Dai thi mien Bac co the thu hut them nhung nguoi ung ho tai cac dia phuong ma Bao Dai co anh huong. Duoi anh huong cua cac cuoc gap mat nay, trong nhung buoi phat bieu cong khai Bao Dai da the hien lap truong chong lai su hien dien cua quan doi Hoa Ky tai Viet Nam, chi trich chinh phu Nguyen Van Thieu va keu goi thanh lap mot chinh phu lien hiep tu do, trung lap va hoa binh tai Viet Nam [can dan nguon]. Nam 1982, nhan khai truong Hoi Hoang toc o hai ngoai, Bao Dai lan dau tien sang tham My voi tu cach ca nhan. Trong chuyen di nay ong da nhan ten cha de lam lai giay khai sinh cho nhung nguoi con ngoai hon truoc day khong ghi ten ong trong phan ten cha. Tai thi tran Sacramento, ong duoc tang chiec chia khoa vang tuong trung cho thi tran nay. Ong cung duoc ba thi truong thanh pho Westminster, California tang danh hieu \"cong dan danh du\" cua thanh pho. Ong cung tham vieng va chuc mung cac buoi le cua cong dong Phat giao va Cao Dai nguoi Viet o California cung cac cong dong nguoi My goc Viet o Texas. Bao Dai cung nhan dip nay tham do y kien cua cac cong dong nguoi Viet song o Hoa Ky ve giai phap cho viec hoa giai dan toc. Cuu hoang Bao Dai la vi vua tho nhat nha Nguyen. Ong qua doi vao 5 gio sang ngay 31 thang 7 nam 1997 tai Quan y vien Val-de-Grace42 , huong tho 85 tuoi. Ong cung la mot phe de song tho nhat tren the gioi thoi hien dai. Truoc do ong co nhan loi ve tham du Hoi nghi thuong dinh Cong dong Phap ngu (La Francophonie) duoc to chuc tai Ha Noi vao 1997.[can dan nguon] Dam tang Bao Dai duoc to chuc vao luc 11 gio ngay 6 thang 8 nam 1997 tai nha tho Saint-Pierre de chaillot so 35 dai lo Marceau, quan 16 Paris va linh cuu duoc mai tang tai nghia dia Passy tren doi Trocadero.42 Tra loi BBC ve su kien nay, ba Monique noi: \"Ngay hom nay toi rat dau buon. Di nhien roi, truoc het va tren het la vi chong toi vua qua doi. Nhung hom nay trang su cua trieu Nguyen Viet Nam cung duoc cham dut. Toi cau nguyen cho chong toi\".43 Trong cuon \"Bao Dai-hay nhung ngay cuoi cung cua vuong quoc An Nam\", Daniel Grandclement viet44 : Nha bao Merry Bromberger viet ve thoi an choi cua Bao Dai: \"Muon gap Bao Dai o Hongkong chi can dao muoi bon hop dem trong thanh pho, de hon la tim ong trong mot khach san Anh\"45 Thang 3/1948, khi mot nha bao quoc te noi rang Bao Dai se chiu hop tac voi Phap de thanh lap chinh phu, voi dieu kien quan doi va ngoai giao cua chinh phu do thuoc quyen chi huy cua Phap, chu tich Ho Chi Minh van to ra tin tuong Bao Dai: \"Ong Vinh Thuy (ten that cua Bao Dai) la Co van cua Chinh phu Viet Nam. Ong ay khong the dam phan hoac hanh dong gi truoc khi Chinh phu Viet Nam dong y. Va chang, neu quan doi va ngoai giao Viet Nam o duoi quyen Phap tuc la Viet Nam chua duoc doc lap han va van la thuoc dia cua Phap. Dieu kien nhu the thi ngoai bon phan quoc ra, khong co mot nguoi Viet Nam nao chiu nhan, co van Vinh Thuy cung vay. Hon 80 nam duoi quyen thong tri cua Phap, nhan dan Viet Nam da nem du si nhuc va dau kho.\"46 Sau do, khi thong tin nay da tro thanh su that, tra loi dien phong van cua Dan quoc Nhat bao (Trung Hoa Dan Quoc) ngay 3/4/1949, chu tich Ho Chi Minh da len an Bao Dai nhu sau: Bao Dai con co mot nguoi con do ba Tu Cung Hoang thai hau nuoi tu nho, nhung khong ro la con ba nao do ong khong tiet lo.54 Khi Bao Dai sang Trung Quoc, nha tho Viet Nam duong thoi Tu Mo co bai tho cham biem ve viec nay. Hinh tuong Bao Dai duoc dung thanh bo phim \"Ngon nen Hoang cung\" nam 2004 do dien vien Huynh Anh Tuan dong. Tien dong Bao Dai thong bao (保大通寶) la loai tien dong Viet Nam kieu co sau cung duoc che tao. Co ba loai tien Bao Dai Thong bao: loai tien duc co nho, loai tien duc co lon mat sau co noi chu \"muoi van\" va loai tien duc lon co mat sau \"tron\". Tat ca duoc phat hanh vao nam 1933. 保大通寶 (1926-1945) (Nguon: Wikipedia) "
  },
  {
    "name": "Bo Chat",
    "otherName": "Tu Son",
    "bornYear": "?",
    "deathYear": "247",
    "dynasty": "Ngo",
    "desc": "Bo Chat (?-247) tu Tu Son la mot tuong Dong Ngo duoi thoi Tam Quoc. Ong la mot hoc gia song o dat Ngo, lam quan su cho thu linh Ton Quyen vao cuoi thoi Hau Han tu truoc khi Dong Ngo ra doi. Theo sach Thuy Kinh Chu So1 , nam Kien An 16, nha Ngo sai Bo Chat dem 400 vu lai di lam Giao Chau Thu su. Doc duong Chat duoc thai thu Thuong Ngo la Ngo Cu tiep don. Cu co toi 5000 quan, Bo Chat lo lang khong tin tuong. Cu cung co y hoi tiec da ruoc Chat vao. Bo Chat ben du Ngo Cu va do doc la Khu Canh la nguoi dung cam muu luoc den nha lam viec roi chem chet ca hai, dem beu dau cho dan chung thay. Theo Ngo Chi, Bo Chat Truyen thi Bo Chat co toi 1000 cung thu, khoi hanh vao nam Kien An 16. Theo sach nay thi Ngo Cu la nguoi cua Luu Bieu, ngoai mat thi theo, trong bung thi chong doi Chat. Chat du do loi cuon, moi Cu den nha lam viec roi giet di. Giao Quang Xuan Thu noi Khu Canh khong bi giet cung Ngo Cu ma dem 2 van thuy quan xuong lay quan Nam Hai, con Hanh Nghi va Tien Bac cung la bo tuong cua Ngo Cu thi dan quan chong choi Bo Chat o cua hem Cao Yeu. Hanh Nghi va hon 1000 quan linh rot xuong nuoc chet2 . (Nguon: Wikipedia) "
  }
]